{"https://www.huffpost.com/entry/kevin-mccarthy-taxes-spending_n_646ccf4ee4b0ab2b97ea6322": "WASHINGTON — Republicans say the national debt is one of the greatest threats to the United States of America, but they’re only halfway willing to fight it.\nThe U.S. government has borrowed $31 trillion in order to cover annual budget deficits resulting from a near-constant mismatch between spending and tax revenue. Congress could slow the growth of debt by cutting spending and raising revenue, but Republicans have ruled out the latter.\n“We’re not going to raise taxes,” House Speaker Kevin McCarthy (R-Calif.) said Monday. “We have more revenue coming into government in a 50-year average than any other time in history, only two other times did we have a higher percentage.”\nRepublicans have refused to support a bill raising the debt ceiling, which would allow the government to continue borrowing to pay for basic operations, unless President Joe Biden agrees to spending cuts. The White House has privately proposed closing tax loopholes, such as the favorable treatment of investment fund managers’ income, as part of a broader deal, according to a source familiar with the negotiations.\nIt’s a high-stakes hostage situation — the government could default on its debts in less than two weeks, potentially destabilizing the financial system and skewering the economy.\nMcCarthy’s claim about record revenues is a little outdated. The historical average for tax revenue as a percentage of overall economic activity — a common metric for measuring the scale of the tax burden — is about 17.4%, according to the Committee for a Responsible Federal Budget, a nonpartisan think tank that hates budget deficits.\nTax receipts clocked in at about 20% of gross domestic product in 2022, but have been trending downward, and amounted to 17.7% of GDP in the past 12 months, according to more recent budget data analyzed by CRFB. So revenue has been coming in at the historically average pace.\n“2022 was a fabulous revenue year, but it wasn’t indicative of a trend,” CRFB’s Marc Goldwein said in an interview, adding that inflation and lots of stock sales contributed to the surge of tax receipts last year.\nMcCarthy implied that having more revenue than the historical trend means the government has more than enough, but the historical trend, after all, was a key ingredient in the recipe for a $31 trillion national debt. McCarthy has called the debt “the greatest threat to our future.”\nOn spending, McCarthy’s on firmer ground.\n“We are spending more than at any other time,” he said Monday. “We are now more than 24% of GDP spending when on the 50-year average we’re at 21%.”\nOverall federal spending surged to 30% of GDP in 2020 thanks to the largely bipartisan response to the coronavirus pandemic. It’s trended downward since then as boosts to food benefits and Medicaid coverage expire. But spending has leveled out at an above-average rate, and the Congressional Budget Office has projected that outlays will remain elevated through the next decade as more older Americans receive benefits from Social Security and Medicare — programs McCarthy has said Congress won’t touch.\nSo spending is up. But even if it weren’t, it’s unlikely that fluctuations in revenue and expenses would make a difference to Republicans, who always favor tax cuts and always favor spending cuts when a Democrat occupies the White House.\n“We have a spending problem. It’s not that the American people are taxed too little,” Sen. John Cornyn (R-Texas) told HuffPost last week. “I understand that the impulse of our friends on the left is to grow the government and raise taxes, but I think just the opposite is right. It’s the difference between Republicans and Democrats, if you haven’t noticed.”\nThe White House proposed a budget earlier this year that would significantly narrow deficits through higher taxes on corporations and the wealthy, but Democrats have not made higher taxes a prominent public demand in response to the Republican push for spending cuts attached to a debt ceiling increase. Instead, President Biden simply insisted that Congress pass a “clean” debt ceiling bill without any strings attached, and tax policy demands have been made in private negotiations.\nIn those talks, the White House has offered to freeze discretionary spending at current levels, but Republicans want spending to revert to a lesser amount, and they want “work requirements” restricting eligibility for federal food and health benefits.\n“The fundamental issue here is the spending,” Rep. Patrick McHenry (R-N.C.) told reporters on Tuesday. “We have to spend less money next year.”", "https://www.huffpost.com/entry/debt-limit-republicans-biden_n_646cc549e4b0005c605c0ff6": "WASHINGTON ― House Speaker Kevin McCarthy (R-Calif.) rejected cutting spending on the military even as he portrayed the rising debt as an existential threat to the nation that needed to be urgently addressed in negotiations with President Joe Biden.\n“Defense should not be on the table,” McCarthy told reporters after a “productive” meeting with Biden at the White House on Monday that yielded no agreement on lifting the debt ceiling.\nIf lawmakers can’t reach a deal, the federal government could default on its obligations as soon as June 1. A default would be unprecedented, throwing the entire financial system into chaos and wreaking havoc on the U.S. economy here and around the world.\nRepublicans have demanded significant spending cuts in exchange for lifting the federal government’s “debt ceiling,” a legal limit on how much the government can borrow to pay bills Congress has racked up over the years.\n“The national debt is like a credit card,” McCarthy told Fox News recently, employing his favorite metaphor. “Year after year after year, Washington keeps hitting the limit, so they just keep expanding it. Now, America’s credit card debt is higher than what we make in an entire year. Shouldn’t we reevaluate how Washington is spending your money?”\nWhen they controlled the White House and both chambers of Congress in 2017, Republicans went on a massive spending spree while also cutting taxes ― without making any fuss over the debt limit. In fact, they raised the debt limit three times with no demands for multi-year caps on spending like they’re asking Biden to agree to now.\nA similar fight over the debt limit played out in 2011 under a different Democratic president, Barack Obama, who ultimately agreed to cut spending equally split between defense and non-defense programs.\nThis time around, Republicans are insisting on actually increasing spending for the military, veterans’ care, and border security, which means that any cuts to other parts of the budget like education, health care and safety net programs would have to be even deeper to meet the GOP demands of total budget savings.\nAccording to the nonpartisan Congressional Budget Office, that would mean the remaining areas of the budget would have to be slashed dramatically, including the departments of Health and Human Services, Education, Housing and Urban Development, Transportation, and Agriculture, among others.\nU.S. spending on defense, meanwhile, has ballooned in recent years under both Republican and Democratic administrations. In 2021, Congress pushed Biden to spend nearly $30 billion more on defense than he had requested. The following year, he proposed a further increase, from $780 billion to $813 billion — yet Congress Hill pushed Biden to ultimately approve $45 billion on top of that, signing a record $858 billion defense budget. This year, the Biden administration is requesting $886 billion in defense spending, a 3% increase that would establish one of the largest peacetime military budgets ever.\nIt’s possible that Biden agrees to some sort of deal with Republicans that freezes future spending at current levels, which the CBO would then score as budget savings, including on defense, because of the growth of inflation.\nBut House Minority Leader Hakeem Jeffries (D-N.Y.) indicated on Monday that Republicans aren’t willing to discuss freezing spending at current levels, something he called “an inherently reasonable position that many in our party might even be uncomfortable with.”\n“House Republicans, their proposals haven’t gotten more reasonable,” Jeffries added. “They’ve gotten more extreme.”", "https://www.huffpost.com/entry/jared-moskowitz-ron-desantis-gop-primary_n_646c91b1e4b0005c605bd34e": "Rep. Jared Moskowitz (D-Fla.) suggested how Florida Gov. Ron DeSantis (R) will take on former President Donald Trump if and when the governor jumps into the 2024 presidential race, which he is expected to do imminently.\nMoskowitz, who joined Congress in January, served as DeSantis’ director of the Florida Division of Emergency Management from 2019 to 2021.\nTalking to CNN’s “This Morning” show on Monday, Moskowitz described DeSantis as “extremely bright,” detail-oriented and data-driven ― but said he disagreed with many of the extremist policies the governor has pushed in recent months\n“He’s data-driven, so he’s going to look at the numbers,” Moskowitz said on whether DeSantis will take off the “kid gloves” with which he’s been treating GOP front-runner Trump so far.\nDeSantis will “test his messages” and figure out “what is working and what is not working” before he attacks, he added.\nMoskowitz acknowledged, though, “If you’re going to go take down Donald Trump, you’re going to have to play on his level.” So far, DeSantis has only lightly attacked Trump, likely for fear of offending the former president’s base.\nWith DeSantis and, possibly, former New Jersey Gov. Chris Christie (R) about to join Trump in the race, Moskowitz warned the GOP primary is “about to turn into a UFC-WWE fight.” He told people to “buckle up and strap in because this is going to be something we’ve not seen.”\nWatch the interview here:", "https://www.huffpost.com/entry/ron-desantis-donald-trump-president_n_646cbd5fe4b06749be16aa11": "The political theorizing of November 2022 had Florida Gov. Ron DeSantis clearing the GOP presidential primary field of non-Donald Trump opposition, setting up a one-on-one slugfest against a former president whose iron grip on the GOP could break following legal problems and electoral losses.\nThe political reality of May 2023 has DeSantis preparing to enter a primary field that is expanding rather than contracting, with Trump back on top in polling and candidates as eager to poach DeSantis’ conservative media hype and big money donors as they are to steal Trump’s grassroots support.\nDeSantis’ official campaign launch is expected in the coming days. Never mind being the only candidate challenging Trump, he won’t be the only candidate to announce a run this week after Sen. Tim Scott (R-S.C.) announced a bid on Monday.\nFormer Arkansas Gov. Asa Hutchinson, tech entrepreneur Vivek Ramaswamy and former U.N. ambassador Nikki Haley are also already in the race. Vice President Mike Pence, former New Jersey Gov. Chris Christie and former Rep. Will Hurd (R-Texas) could all also launch bids soon.\nAnd potential new candidates are crawling out of the GOP’s political woodwork: North Dakota Gov. Doug Burgum, a wealthy former Microsoft executive, has hired political consultants. Former Texas Gov. Rick Perry, whose previous presidential endeavors are best summed up by the word “oops,” is also considering a bid.\nHopes of isolating Trump one-on-one were a pipe dream, a Republican strategist said, noting the low cost and high potential rewards — a cabinet slot or Fox News hosting gig — available to even wildly unsuccessful presidential candidates. DeSantis’ missteps in recent weeks, however, have created openings for other candidates to argue they, rather than DeSantis, are best-positioned to slay the Trump dragon.\n“Everybody who is in the race, is in the race not because of DeSantis, but because of Trump,” said John Feehery, a Republican lobbyist and former Capitol Hill aide, who is unaligned in the primary.\nThose candidates either want to block Trump, or are auditioning for a spot on his ticket or in his cabinet, Feehery said.\nBut DeSantis’ “weakness has probably given not only hope but also money to other candidates,” added Feehery, who said he prefers an alternative to Trump. “He’s been kind of shell-shocked by how quickly Trump has gone after him.”\nWith more than eight months to go until the first 2024 nominating contest, DeSantis is still the Republican most likely to stand between Trump and another presidential nomination. And indeed that is what DeSantis’ team is betting on.\n“The Republican primary is already a two-man race, and Governor DeSantis isn’t even a candidate,” Erin Perrine, communications director for the pro-DeSantis super PAC Never Back Down, told HuffPost in a statement. “As we saw at his recent visits to Iowa and New Hampshire, there is growing momentum behind the Governor because he is the only Republican who doesn’t just talk the talk, he follows through on the hard fights like taking on woke corporations.”\n“The choice couldn’t be clearer for primary voters — while Donald Trump may talk a big game, DeSantis actually fights and wins,” Perrine added.\nBut each of those lower-tier candidates can chip away at the support DeSantis needs to win in the zero-sum scramble for party delegates.\nThe stakes of candidate competition are especially high on the Republican side, because while Democrats are required to allot convention delegates on a proportional basis, the GOP relies more heavily on winner-take-all — or winner-take-more — primary contests.\nIn 2016, for example, the winner-take-all system in Florida helped Trump secure a huge batch of delegates without even winning an outright majority. The outcome prompted Florida Sen. Marco Rubio’s departure from the race.\nAhead of his reelection campaign in 2020, Trump encouraged more states to adopt winner-take-all systems, leading to a map where 60% of contests were either winner-take-all from the outset, or become winner-take-all if a candidate surpasses a certain threshold. In theory then, the more Republicans that run in 2024, the harder it becomes for DeSantis to topple Trump.\nA field of mostly longshot candidates polling in the single or low double digits may also help Trump eke out delegate wins without amassing a significant plurality of votes — or having to broaden his base.\nThe growing field of contenders, Republicans who oppose Trump worry, could lead to a repeat of 2016, when GOP candidates — fearful of Trump’s base-delighting insults and convinced of his imminent self-implosion — fought amongst themselves as Trump racked up an eventually insurmountable delegate lead.\n“I was in a 2016 campaign, the ‘attack the guy who’s a front-runner other than Donald Trump’ – we’ve tried that,” Sarah Isgur, a former aide to 2016 presidential candidate Carly Fiorina, said Sunday on ABC’s “This Week.” “It results in Donald Trump being the nominee.”\nIndeed, scattered polling from the time period when DeSantis was polling best showed him defeating or in close races with Trump when the two were matched up one-on-one. Adding other candidates to the mix, however, typically led to a stronger position for Trump.\nMany of the other contenders seem as or more eager to attack DeSantis than to do battle with Trump. Haley trolled DeSantis over his clashes with Disney earlier this month. New Hampshire Gov. Chris Sununu, yet another potential candidate, has both criticized DeSantis’ culture war tactics and insisted he is more fiscally conservative than the Floridian. Christie has said DeSantis’ war with Disney shows the latter man is “not a conservative”\nAnd DeSantis of course remains Trump’s No. 1 target. Trump has dubbed the Florida governor “Ron DeSanctimonious,” and Make America Great Again PAC, a pro-Trump super PAC, has already started running a TV advertisement that employs DeSantis’ reported use of his fingers to eat chocolate pudding as a metaphor for his votes as a U.S. House member to cut Social Security and Medicare.\n“Ron DeSantis loves sticking his fingers where they don’t belong – and we’re not just talking about pudding,” the spot says as an actor dips two fingers into the dessert.\nA second MAGA PAC ad that parodies the kids’ song “Old McDonald Had A Farm,” labels the governor “Ron DeSalestax” for raising sales taxes.\nThe attacks on DeSantis have taken a toll on his support among Republican primary voters. He has the backing of about 21% of those voters, down from about 30% in March, according to FiveThirtyEight’s latest public polling average.\nThe governor’s slide in the polls began after his pre-campaign book tour, where he didn’t always seem at ease doing the heavy retail politicking necessary to win a presidential nomination.\nHe has also struggled to justify his accelerating war with Disney and the slew of new Florida laws being challenged in court on First Amendment grounds. Last month, DeSantis signed a six-week abortion ban into law, a move that may either help him against Trump with uber-conservative evangelical voters or hurt him with more moderate Republicans and in the general election.\nHaley trolled DeSantis earlier this month over his escalating clashes with Disney.\n“If Disney would like to move their hundreds of thousands of jobs to South Carolina and bring the billions of dollars with them, I’ll let them know, I’ll be happy to meet them in South Carolina and introduce them to the governor and the legislature that would welcome it,” she said.\nTo some conservative strategists wary of again nominating Trump, the prospect of GOP candidates training their fire on DeSantis, rather than Trump, brings back unhappy memories of the 2016 GOP primary.\nTo emerge from a crowded primary, DeSantis may also have to make his message less about Trump and more about why he’s a better choice than, say, Scott, the only Black Republican in the Senate who’s running a campaign far less centered on culture wars, or Ramaswamy, a relative unknown who has shaken up the race with his stances on the voting age and a merit-based system for immigration.\nAt the same time, lesser-known candidates can make the case that DeSantis’ wave of popularity, set into motion during the coronavirus pandemic, has already crested.\nEven some conservatives who believe that DeSantis would be better than Trump and a more effective tribune for right-wing populism acknowledge that a national campaign is uncharted terrain for him.\n“DeSantis has to break out of the Florida bubble and address what he would do for the country as a national leader. That’s been a missing part of this conversation thus far,” said Ryan Girdusky, a conservative consultant associated with the more nationalist wing of the Republican Party. “You can’t plant palm trees in Michigan or Wisconsin. You need to actually tell me what you’re going to do for Michigan or Wisconsin.”\nGirdusky encouraged DeSantis and other candidates to attack Trump from the right by faulting him for, among other things, failing to complete the border wall or stem the tide of unauthorized immigration.\n“Donald Trump is like Philip Morris cigarettes in the 1960s and 70s,” said Girdusky, who founded The 1776 Project, a right-wing super PAC active in local school board elections. “It’s a great brand that will give you cancer, but people still like the brand. So you need to destroy the brand.”\nEven in a crowded field, DeSantis can still easily trample his opponents in fundraising and will enter the race with a relatively blank slate to a national audience, said Republican strategist Jason Cabel Roe.\n“What most people know about DeSantis is COVID and Disney. There’s a lot more to Ron DeSantis,” said Roe, a former senior adviser to Rubio. The other candidates are “not combative, they’re not pugnacious, and they’re not going to bring the same feistiness to the campaign that Ron DeSantis does.”", "https://www.huffpost.com/entry/tim-scott-says-wont-undo-2024-election_n_646c8919e4b056fd46dc4074": "Newly declared Republican presidential candidate Tim Scott said he wouldn’t seek to undo the democratic result of an election he lost, but stopped short of criticizing Donald Trump’s efforts to do so in 2020.\nScott, the only Black Republican in the U.S. Senate, made the comments in an interview with NBC News on Monday, shortly after he announced his White House bid in his home state of South Carolina.\nScott is joining a crowded field seeking the 2024 Republican presidential nomination, including current the front-runner, former President Donald Trump. Florida Gov. Ron DeSantis (R-Fla.) is also expected to join the race this week.\nWhile Scott told NBC News he wouldn’t try to overturn his loss in an election, he did not want to get drawn into discussing Trump’s bid to stay in power after he was defeated by Joe Biden in 2020.\nAsked to assess Trump’s behavior following the 2020 race leading up the Jan. 6, 2021, insurrection, Scott, who was inside the U.S. Capitol during the attack, replied: “We can do two things here: We can have a conversation about President Trump or we can have a conversation about my vision for the future.”\nTrump on Truth Social welcomed Scott’s candidacy, wishing the senator “good luck.”\n“It is rapidly loading up with lots of people, and Tim is a big step up from Ron DeSanctimonious, who is totally unelectable,” Trump wrote, taking a jab at DeSantis, who for now appears to be his biggest prospective rival.\nBut Scott seemed unfazed by Trump’s apparent dismissal of his candidacy.\n“I’d appreciate his vote as well,” Scott said of the former president.\nDuring the interview, Scott touted his anti-abortion credentials, telling NBC’s Tom Llamas that “as president of the United States I would sign the most conservative legislation, pro life legislation that can get to my desk.” He did not explicitly say whether he would support a federal abortion ban.\n“We won’t see legislation like that come through Congress if we don’t first win the hearts and minds of the American people,” he said.\nScott has previously said he backs a 20-week federal abortion ban and would sign it into law if he were elected president.\nThis comes as Republicans have been trying to pass laws to restrict the medical procedure following the Supreme Court’s decision to overturn Roe v. Wade last summer. Nebraska’s Republican Gov. Jim Pillen on Monday signed a bill banning abortion at 12 weeks.", "https://www.huffpost.com/entry/kevin-mccarthy-debt-limit_n_646c0fe4e4b0bfd6448465b7": "House Speaker Kevin McCarthy (R-Calif.) said the latest meeting with the White House over the need to raise the limit on how much the government can borrow was productive, even as he was pressed to point to specific signs of progress.\n“We’re getting closer. Don’t give up on us,” he admonished reporters at the U.S. Capitol early Monday night.\nMcCarthy had his third face-to-face meeting with President Joe Biden in less than two weeks as the White House and congressional Republicans try to navigate a path to avoid defaulting on the government’s AAA-rated debt or leaving other bills unpaid because the Treasury Department runs out of borrowing room.\nDefaulting on the debt or other obligations would lead to an economic crisis, economists say, given the U.S.’s pristine creditworthiness and the role of the dollar in the global economy. Republicans want to force spending cuts and other policy changes in exchange for agreeing to lift the debt limit.\nBut finding common ground has been difficult. The White House says its budget plan issued in March would cut the 10-year deficit by about $3 trillion through a combination of spending cuts and tax hikes. But there has been no vote on that budget plan.\nHouse Republicans narrowly passed a debt limit bill that would cut the deficit on net by about $4.8 trillion over 11 years. But it would get to that number through stringent budget caps that would make annual spending bills for federal agencies very difficult to pass. Several Republicans said the bill was meant as an opening bid, not a final offer.\nThe gap has been difficult to bridge and has only become more difficult as the clock ticks closer to early June, which is when Treasury Secretary Janet Yellen said the risk of default arises. Default could happen as early as June 1, she said again in a letter to lawmakers on Monday.\nA nongovernmental group, the Bipartisan Policy Center think tank, said Tuesday June 2 through June 13 posed an “elevated risk” of the Treasury running short.\n“Come early June, Treasury will be skating on very thin ice that will only get thinner with each passing day,” said Shai Akabas, executive director of BPC’s economic policy program. “Of course, the problem with skating on thin ice is that sometimes you fall through.”\nMcCarthy was asked why he was upbeat, especially after one of his lieutenants who attended the meeting, Rep. Patrick McHenry (R-N.C.), said he did not feel a sense of urgency from the White House. The speaker replied, “I don’t think we would agree to talks if we thought it wasn’t productive and that we couldn’t come to an agreement.”\n“We only talked about where our differences were. We talked about ideas. So we’re asking staff to get back and run through those ideas to see if we could come to an agreement.”\nIn a terse three-sentence post-meeting statement, Biden also called the talks productive but acknowledged there were “areas of disagreement.”\n“We reiterated once again that default is off the table and the only way to move forward is in good faith toward a bipartisan agreement,” he said.", "https://www.huffpost.com/entry/nebraska-trans-abortion-bill_n_646be9f8e4b0005c605b5b46": "As expected, Republican Nebraska Gov. Jim Pillen signed a bill Monday that both limits gender-affirming care for young people and outlaws abortion at 12 weeks of pregnancy.\nThe abortion ban goes into effect immediately, and the restrictions on transgender health care for people under age 19 take effect Oct. 1. Unlike in most states, Nebraska law considers everyone in that age group to be a minor.\n“Today is a historic day in the State of Nebraska. It is a day where we are standing up and protecting our kids so that they can have a better and brighter future,” Pillen proclaimed in a statement, calling the bill’s passage “the most significant win for social conservatives in a generation.”\nThe bill as originally written focused on prohibiting transgender people under 19 from having any gender confirmation surgeries. Though Republican lawmakers and conservative media have been raising alarms about such surgeries on minors, they are extremely uncommon. The bill also gives the state’s chief medical officer — who is neither an elected official nor a specialist in transgender health care ― the power to set regulations on the use of any puberty blockers or hormone treatments for that age group.\nBut after an attempt at a six-week abortion ban failed in the legislature, Republicans added an amendment to the transgender health care bill banning abortion at 12 weeks ― infuriating Democrats who slammed it as an abuse of the legislative process.\nAt Friday’s final debate on the matter, opponents of the abortion ban accused its supporters of quickly tacking on the amendment without a proper hearing and violating rules about combining unrelated matters onto one bill.\n“The reason the abortion part was added was because the transgender part could not pass without it ... and clearly the abortion bill couldn’t pass without the trans bill, because we had to bring it back to life. It’s a zombie bill,” state Sen. John Cavanaugh (D) said during Friday’s debate.\nState Sen. Kathleen Kauth, the bill’s author, argued in a statement Monday that the amendment was germane because it it’s “all about protecting children.”\nDemocrats also raised concern about the power the bill gives to the state’s chief medical officer, who is a political appointee.\n“The CMO being able to be delegated the authority to create rules and regulations pertaining to how individuals access care is an absolute unlawful, unconstitutional delegation of our authority as a legislature,” state Sen. George Duncan (D) argued Friday.\nOpponents of the bill have also pointed out the more obvious concerns: that gender-affirming hormone treatments for youth significantly lower their high risk of depression, suicide and other mental health problems; and that banning abortion at 12 weeks is not enough time for many patients to seek care, especially as appointment wait times have increased around the country in the wake of Roe v. Wade falling.\nBut some of the bill’s supporters said Friday they wish the abortion ban could have been more restrictive.\n“Many of us feel that the six-week ‘heartbeat’ bill was the answer,” state Sen. John Lowe (R) said during debate. “We’re giving up six weeks as a compromise.”", "https://www.huffpost.com/entry/james-comer-biden-probe-trump-2024_n_646b9106e4b0005c605afc8b": "Rep. James Comer (R-Ky.) on Monday inadvertently implied that House Republicans’ high-profile investigation into President Joe Biden’s family members and their finances is actually about helping Donald Trump win the presidency in 2024.\nComer, who is leading the GOP’s probe as chair of the House oversight and accountability committee, appeared to say the quiet part out loud during a “Fox & Friends First” interview.\n“We have talked to you about this on the show, about how the media can just not ignore this any longer. In an op-ed in The Washington Post, it says, ‘Millions Flowed to Biden Family Members. Don’t Pretend It Doesn’t Matter,’” said the show’s host, Ashley Strohmier, referring to a piece last week by conservative columnist Jim Geraghty. “So do you think that because of your investigation, that is what’s moved this needle with the media?”\n“Absolutely. There’s no question,” Comer replied. “You look at the polling, and right now Donald Trump is 7 points ahead of Joe Biden and trending upward, Joe Biden’s trending downward. And I believe that the media is looking around, scratching their head, and they’re realizing that the American people are keeping up with our investigation.”\nComer’s apparent moment of candor is reminiscent of Speaker Kevin McCarthy’s memorable gaffe in 2015, when he admitted the GOP’s Benghazi committee was created to hurt Hillary Clinton in the polls ahead of the 2016 election, as opposed to being any kind of substantive investigation.\n“Everybody thought Hillary Clinton was unbeatable, right? But we put together a Benghazi special committee, a select committee ― what are her numbers today?” McCarthy told Fox News at the time. “Her numbers are dropping, why? Because she’s untrustable. But no one would have known any of that had happened.”\nHere’s a video clip of Comer’s seeming slip-up:\nDuring Monday’s interview, Comer claimed that Biden’s family members have received money from foreign nationals, saying “that’s what we’ve proven” with the GOP’s probe.\nBut in reality, despite House Republicans’ efforts to portray Biden as hopelessly corrupt, the committee didn’t present any evidence in its hearings that directly implicated Biden.\nComer also misrepresented the state of presidential polling in his interview. His claim that Trump has a 7-point edge over Biden stems from an ABC News/Washington Post survey released earlier this month. Other surveys, however, show Biden leading, and the overall polling picture indicates a tight race between Biden and Trump.\nIn particular, polling shows little indication that House GOP investigations of Biden’s family are driving the president’s political standing downward. While Biden’s approval rating remains underwater, scattered surveys of the public show little indication that the Comer-led investigations have had a major effect one way or another.\nSurveys from earlier this year, conducted by both nonpartisan and Democratic firms, found that most voters thought Republicans were putting too much effort into investigating the president.", "https://www.huffpost.com/entry/tom-carper-senate-2024_n_646b6be1e4b0005c605acf74": "Sen. Tom Carper of Delaware won’t seek reelection in 2024, opening up another seat Democrats will need to defend if they are to maintain their Senate majority next year.\nThe 76-year-old Democrat has been in public office for decades. He began his career as state treasurer in 1976, followed by a stint in the House of Representatives, and then as governor for eight years before entering the Senate in 2001.\nCarper rose quickly in the upper chamber to chair the Homeland Security Committee and later the Environment and Public Works Committee. He was involved in drafting the climate provisions of President Joe Biden’s signature legislation, the Inflation Reduction Act.\nCarper fended off a progressive primary challenger during his 2018 race for reelection, easily beating 38-year-old Air Force veteran and community organizer Kerri Evelyn Harris.\nRep. Lisa Blunt Rochester (D-Del.) is the favorite to replace Carper in the Senate. The 61-year-old lawmaker, who was elected to the House in 2016, served as Biden’s presidential national campaign co-chair in 2020.\nCarper said that Blunt Rochester indicated to him on Monday prior to his announcement that she planned to run for his Senate seat.\n“I said, “You’ve been patient, waiting for me to get out of the way … and I hope you run and I hope you’ll let me support you,” Carper said at an event in Wilmington, recounting their conversation. “And she said, ‘Yes, I’ll let you support me.’”\nIt’s possible that Democrats elect multiple Black women to the Senate next year in addition to Blunt Rochester. County executive Angela Alsobrooks recently announced a Senate bid in Maryland, and Rep. Barbara Lee is vying in a crowded primary race in California. Rep. Colin Allred (D-Texas), another African American rising star in the Democratic Party, is hoping to oust Sen. Ted Cruz in Texas.\nDemocrats are still awaiting word on reelection plans from Sens. Joe Manchin (D-W.Va.), Kyrsten Sinema (I-Ariz.), and Bernie Sanders (I-Vt.) ― announcements that will determine their odds of holding the Senate majority next year in what looks like a very good map for Republicans.\nEarlier this month, 79-year-old Maryland Democratic Sen. Ben Cardin announced he won’t be seeking another term in office, kicking off a crowded Democratic primary to replace him.\nMeanwhile, Sen. Dianne Feinstein (D-Calif.) doesn’t appear to be showing any signs of bowing to pressure to step down ahead of her planned retirement at the end of 2024. The 89-year-old longtime California senator returned to work this month despite experiencing broader undisclosed complications from shingles, ignoring questions about calls for her resignation.", "https://www.huffpost.com/entry/gop-donor-trump-desantis-2024_n_646db604e4b0ab2b97eb20e4": "Texas investor Hal Lambert this week became the latest Republican donor to publicly dump former President Donald Trump.\nLambert told Fox Business’ Neil Cavuto on Tuesday that he’d now do “everything I can” to help Florida Gov. Ron DeSantis (R) win the GOP presidential nomination and then the White House. DeSantis is expected to launch his 2024 campaign in a livestream with Twitter owner Elon Musk on Wednesday,\n“Number one, Donald Trump can only serve one term,” said Lambert, who served on Trump’s inaugural committee. “He’ll effectively be a lame duck almost on day one if he were to win.”\nWatch the video here:\n“But I don’t think he can win the general. That’s the number two reason,” he explained. “There’s states that matter and we all know what those are. It’s gonna be things like Nevada and Arizona and Virginia, Wisconsin. I don’t see Trump winning any of those states. And so we can’t win if we don’t win those states.”\nLambert claimed DeSantis, who in recent months has passed a number of extremist policies in Florida, has done “an amazing job as governor” and offered America a “vision forward, not looking back.”\n“I think Donald Trump should drop out the race, quite frankly, for the better of the country,” he added of the GOP front-runner. “I think he should drop out of the race.”", "https://www.huffpost.com/entry/janet-yellen-debt-limit-hard-deadline_n_646b5b57e4b035573937b09c": "Treasury Secretary Janet Yellen on Sunday repeated her assessment that June 1 is a “hard deadline” for Congress to raise the debt ceiling as the White House continues to negotiate with Republicans to end the standoff.\nPresident Joe Biden and House Speaker Kevin McCarthy (R-Calif.) are set to meet at the White House on Monday to continue those talks. Biden chose to shorten his trip overseas to break the impasse, canceling visits to Australia and Papua New Guinea.\n“Well, I indicated in my last letter to Congress that we expect to be unable to pay all of our bills in early June, and possibly as soon as June 1st,” Yellen said on NBC’s “Meet The Press.” “And I will continue to update Congress, but I certainly haven’t changed my assessment. So I think that that’s a hard deadline.”\nYellen added that if Congress fails to act “some bills [will] have to go unpaid,” but would not specify which ones when pressed by NBC’s Chuck Todd.\n“I would say we’re focused on raising the debt ceiling and there will be hard choices if that doesn’t occur,” she warned. “There can be no acceptable outcomes if the debt ceiling isn’t raised, regardless of what decisions we make.”\nRepublicans have demanded spending cuts and other policy changes in exchange for their votes to raise the debt ceiling, a borrowing limit placed on the government. Failing to raise the limit would be catastrophic for the economy and for the many people who rely on government services and aid.\nBiden said Sunday that “default is not an option” and called on Republicans to abandon their “extreme positions.”\n“It’s time for Republicans to accept that there is no bipartisan deal to be made solely — solely on their partisan terms,” he said during a press conference in Hiroshima, Japan, where he attended the Group of Seven leaders summit. “They have to move as well.”\nThe Treasury Secretary dismissed the idea that Biden could invoke the 14th Amendment’s section on government debt and unilaterally raise the debt limit — a strategy progressive lawmakers have urged the president to pursue in lieu of continuing negotiations with the GOP.\n“It doesn’t seem like something that could be appropriately used in these circumstances, given the legal uncertainty around it and given the tight time frame we’re on,” Yellen said.\nBiden and McCarthy spoke by phone on Sunday while the president was on his way back to the U.S. The House speaker told reporters afterward that the call was “productive” even though a deal has yet to be reached.\n“We’re still apart,” McCarthy said.\nYellen wrote to congressional leaders last week to stress the dire consequences of a default, as well as the harm already being done as the debt limit talks drag out.\n“If Congress fails to increase the debt limit, it would cause severe hardship to American families, harm our global leadership position, and raise questions about our ability to defend our national security interests,” Yellen wrote.", "https://www.huffpost.com/entry/marjorie-taylor-greene-house-democrats-decorum_n_646e8df6e4b045ce2480b033": "Rep. Marjorie Taylor Greene (R-Ga.) found out firsthand what her Democratic co-workers think of her on Wednesday ― and it apparently isn’t much.\nThe Georgia representative was speaking during a House session when she made a simple request of her congressional colleagues.\n“Members are reminded to abide by decorum of the House,” she said, only to spark raucous laughter.\nThe giggle fest was so extreme that Greene was forced to bang her gavel repeatedly, to little effect.\nYeah, we know: Pictures or it didn’t happen.\nDecorum isn’t exactly a word that’s been associated with Greene during her time in Congress, which a few Democrats noted on Twitter.\nRep. Jimmy Gomez (D-Calif.) compared Greene’s call for decorum to “Leonardo DiCaprio telling people to date people their own age,” while Rep. Adam Schiff (D-Calif.) tweeted that he hadn’t “laughed this hard in a while.”\nThe video also amused non-politicians, many of whom provided examples of why the conspiracy-theory-embracing Greene falls short in decorum, from her heckling of President Joe Biden at the State of the Union to liking social media posts that called for the assassination of Democrats.", "https://www.huffpost.com/entry/joe-biden-anniversary-uvalde-shooting_n_646e75e7e4b091b09c2a98c0": "President Joe Biden on Wednesday marked one year since the massacre at a school in Uvalde, Texas, by again calling on lawmakers to pass long-awaited gun safety measures.\nOn May 24, 2022, a teenage gunman killed 19 children and two teachers at Robb Elementary School. The incident remains Texas’ deadliest school shooting of all time, and reignited nationwide anger over gun violence and lax firearm regulations.\nThe president delivered a speech on the somber anniversary as first lady Jill Biden looked on, with the two surrounded by 21 white candles bearing the names of the victims.\n“Standing there in Uvalde, Jill and I couldn’t help but think that too many schools, too many everyday places, have become killing fields in communities all across every part of America,” Biden said, recalling his visit to the border town a year earlier. “In each place, we hear the same message: ‘Do something. For God’s sake, please do something.’”\nLaw enforcement came under severe criticism for its response to the shooting. A report by Texas lawmakers revealed that nearly 400 heavily armed officers from federal, state and local agencies were on the scene, but that they waited more than an hour before confronting and killing the gunman. Officers also prevented parents who gathered by the school from retrieving their children inside, and at times got physical with them for expressing anger at authorities’ inaction.\nCurrently, a state-level criminal probe into the hesitant police response is still ongoing, and Uvalde authorities continue to withhold public records related to the shooting. Some Uvalde families have filed lawsuits against gun manufacturers and law enforcement.\n“It’s time to act. It’s time to make our voices heard — not as Democrats or as Republicans, but as friends, as neighbors, as parents, and as fellow Americans,” Biden said. “Because today, guns remain the number-one killer — the number-one killer — of children in America.”\nA month after the tragedy, Biden had signed the country’s most sweeping gun safety bill in decades, which included stricter background checks.\nBut the president this week renewed his calls for lawmakers to pass legislation that permanently bans AR-style firearms and high-capacity magazines, establishes universal background checks and a national “red flag” law, requires safe storage of firearms, and ends gun manufacturers’ immunity from liability.\n“How many more parents will live their worst nightmare before we stand up to the gun lobby?” Biden said.\nThe president and supporters of gun safety reforms — including Uvalde parents — have tried multiple times to advance such proposals, only for conservative legislators to block them. With the GOP-controlled House and the Democrat-controlled Senate each having a slim political majority in Washington, it’s unlikely that the U.S. Congress will pass what Biden is calling for.\nIn Texas’ Republican-controlled state Legislature, lawmakers in the past year have rejected almost every proposal to improve gun safety. GOP Gov. Greg Abbott has also shut down talks of stricter gun laws — the same response he had after several other mass shootings in his state.\n“Since Uvalde, our country has experienced a staggering 650 mass shootings,” the president said. “We can’t end this epidemic until Congress pass some commonsense gun safety laws and keep weapons of war off our streets and out of the hands of dangerous people, [and] until states do the same thing.”\nHe added: “I know for a long time it’s been hard to make progress. But there will come a point where our voices are so loud, our determination so clear, that we can no longer be stopped. We will act.”", "https://www.huffpost.com/entry/biden-capitalizes-desantis-glitchy-twitter-presidential-announcement_n_646e8f7be4b0047ed7793d1d": "The fiasco that was Florida Gov. Ron DeSantis’ presidential announcement Wednesday on Elon Musk’s Twitter made space for jokes across the site — including from the president himself.\nAfter multiple delays and technical issues with DeSantis’ 2024 presidential bid announcement on Twitter Spaces, President Joe Biden tweeted out a link to his followers.\n“This link works,” Biden’s account tweeted Wednesday.\nThe link leads to a website asking for donations for Biden and Vice President Kamala Harris’ reelection campaign.\nThe event for DeSantis’ long-awaited announcement repeatedly crashed and kicked users out of the Twitter Space and app. The debacle was met with memes and jokes (including the trending hashtag #DeSaster) across the site.\nFormer President Donald Trump, DeSantis’ most threatening opponent in the GOP primary race, also took advantage of the technical fail.\nHis campaign’s Team Trump on Twitter even dropped an ad dissing DeSantis as the livestream failed.\nMusk, the outgoing billionaire CEO of Twitter, announced Tuesday that the controversial Florida Republican would make his case Wednesday evening on Twitter Spaces.\nThough the unprecedented use of Twitter Spaces for DeSantis’ announcement was anything but smooth, he did release a video Wednesday prior to the faulty stream.\n“I’m Ron DeSantis, and I’m running for president to lead our great American comeback,” DeSantis said in the video.\nDeSantis will face Trump in the GOP primary.", "https://www.huffpost.com/entry/john-roberts-supreme-court-ethics_n_646d8d2ae4b0005c605cd0c7": "WASHINGTON (AP) — Chief Justice John Roberts said Tuesday that there is more the Supreme Court can do to “adhere to the highest standards” of ethical conduct, an acknowledgment that recent reporting about the justices’ ethical missteps is having an effect on public perception of the court.\nSpeaking at a law dinner where he was honored with an award, Roberts provided no specifics but said the justices “are continuing to look at the things we can do to give practical effect to that commitment.”\nHe said he is “confident there are ways to do that consistent with our status as an independent branch of government and the Constitution’s separation of powers.”\nThe court has resisted adopting an ethics code of its own, and Roberts has raised questions about whether Congress could impose a code of conduct on the court.\nAll nine justices recently signed a statement of ethics that Roberts provided to the Senate Judiciary Committee. His remarks Tuesday suggested he knows that statement is not enough to quiet critics.\nThe chief justice’s remarks follow a series of stories, mainly by the investigative news site ProPublica, that have detailed lavish trips and other gifts provided to Justice Clarence Thomas by Republican megadonor Harlan Crow.\nDemocrats have used the revelations to call for stronger ethics rules for the Supreme Court, and the Democratic-controlled Senate has held two hearings on ethics issues in recent weeks. Republicans have defended Thomas.\nRoberts, who has led the court since 2005, also said the hardest decision he has made as chief justice was to keep protesters away from the court last year, in the wake of the leak of the draft opinion overturning Roe v. Wade.\n“The hardest decision in 18 years I had to make was whether to erect fences and barricades around the Supreme Court. I had no choice but to go ahead and do it,” he said at the American Law Institute dinner in Washington.\nThe fencing was removed before the court’s new term began in October.", "https://www.huffpost.com/entry/trump-merrick-garland-classified-documents_n_646d821ce4b0005c605cccc4": "Former President Donald Trump’s lawyers have requested a meeting with Attorney General Merrick Garland amid reports the investigation into Trump’s handling of classified documents is nearing an end.\nThe letter, posted to Trump’s Truth Social account, criticizes the ongoing probe — centered on boxes of classified files found at his Mar-a-Lago compound in Florida — as unfair and calls for a meeting to discuss Justice Department special counsel Jack Smith’s investigation. The Wall Street Journal reported Tuesday that Smith is nearly finished collecting testimony and evidence in the case, and some in the former president’s orbit are preparing for a possible indictment.\n“No President of the United States has ever, in the history of our country, been baselessly investigated in such an outrageous and unlawful fashion,” attorneys John Rowley and Jim Trusty wrote. “We request a meeting at your earliest convenience to discuss the ongoing injustice that is being perpetrated by your Special Counsel and his prosecutors.”\nThe brief letter doesn’t point to any specific allegations against Smith.\nThe investigation into the government files is just one of several cases into Trump’s behavior after he lost the 2020 presidential election, but it may pose the most serious legal threat to the former president.\nThe FBI searched his Mar-a-Lago home last August after the National Archives attempted for months to recover the missing documents, but the Justice Department has reportedly homed in on whether Trump attempted to obstruct the government’s efforts to recover the files. The Washington Post reported last month that federal investigators had gathered evidence that the former president may have sifted through boxes of documents after receiving a subpoena to return them.\nTrump has oscillated from saying he did nothing wrong to claiming he automatically declassified the files to excoriating the probe as yet another government witch hunt. But during a CNN town hall-style event this month, he appeared to claim he was allowed to take anything he wanted when he left the White House in January 2021, pointing to what he called the “absolute right” under the Presidential Records Act.\n“I took the documents; I’m allowed to,” he said during the live event, adding later that when he left Washington he had “boxes lined up on the sidewalk,” and “everybody knew we were taking those boxes.”\nTrump has had several courtroom defeats in recent months. The former president was indicted in April on 34 felony counts centered on hush money payments to adult film star Stormy Daniels shortly before the 2016 election. Earlier this month, he was also ordered to pay $5 million in damages to writer E. Jean Carroll for sexual abuse and defamation.\nHe has excoriated those decisions and spent his time at the CNN town hall disparaging Carroll as a “whack job.” She responded on Monday, asking a judge to increase the multimillion-dollar judgment by a “very substantial amount” for his continued disparagement of her despite the jury’s verdict.", "https://www.huffpost.com/entry/ty-cobb-trump-sad-thing-donald-trump-prison-inauguration_n_646d7e6ae4b035573939c990": "A former White House attorney under Donald Trump detailed a bizarre potential scenario in which the former president wins next year’s election but is in prison by Inauguration Day ― and then pardons himself while behind bars.\nTy Cobb, who led the White House response to the Russia investigation in 2017-2018, spoke with CNN’s Erin Burnett about his prediction that Trump “will go to jail” as a result of the classified documents investigation.\nBurnett asked what would happen if the trial takes place during the election and Trump wins anyway.\n“Does he just pardon himself and it all goes away?” she asked.\nCobb said that’s a possibility.\n“The sad thing is nobody knows,” he said. “This is so unprecedented.”\nCobb noted a debate in the legal community over whether or not presidents have the authority to pardon themselves.\n“There are good lawyers on both sides of that. I tend to believe he doesn’t, but I could be wrong,” he said.\nHe added that a possible trial next year could conclude during or after the election, with Trump sentenced and behind bars before Inauguration Day.\n“He doesn’t have the power to pardon himself until he’s actually inaugurated,” he noted, meaning Trump “would have to report to jail” until then in any case.\nAlong with the possibility of federal charges, Trump is also facing nearly three dozen state-level felony charges in New York in a trial set to begin in March, in the middle of primary season.\nIf he loses that case, he would not be able to pardon himself on the state conviction.\nSee more of Cobb’s conversation with Burnett, as posted on Mediaite, below:", "https://www.huffpost.com/entry/trent-skaggs-utah-senate-mitt-romney_n_646d1259e4b056fd46dd071d": "SALT LAKE CITY (AP) — Riverton Mayor Trent Staggs announced plans to run for U.S. Senate next year and challenge first-term Republican Mitt Romney in what could emerge as a competitive primary battle in the deeply conservative state.\nRomney, 76, has not yet announced whether he plans to seek reelection, but his transformation from 2012 presidential candidate to a recurring critic of President Donald Trump has led many to believe Trump could be vulnerable in next year’s Republican primary.\n“The only thing I’ve seen him fight for are the Establishment, ‘wokeness,’ open borders, impeaching President Trump and putting us even deeper into debt,” Staggs says in an announcement video that highlights Romney’s votes to impeach Trump.\nStaggs, 49, is one of several candidates expected to run to the right of Romney and, in the announcement, brands the incumbent as a “Massachusetts millionaire” who moved to Utah.\nAfter a career in securities trading, Staggs was elected mayor of Riverton in 2017. He has focused throughout his tenure on typical municipal issues including policing, budgets, managing growth and spurring development.\n“That’s what I want to take to D.C.,” he said in an interview. “As a mayor, I’m on the front lines of pushing back on government overreach.”\nIn the months leading up to his announcement, he’s grown increasingly vocal on other issues, spearheading resolutions against “ ESG ” investing principles and speaking out against library books he called “pornographic” on Jordan School District shelves last month.\nStaggs’ announcement makes him the first Republican to officially enter the race, though Utah House Speaker Brad Wilson set up an exploratory committee in April, allowing him to raise funds toward a candidacy. Former U.S. Rep. Jason Chaffetz told The Associated Press in February that he was thinking about running. A representative for state Attorney General Sean Reyes has also said many were pressuring him to run as well.\nThough Romney has vocal critics in Utah Republican Party activist circles, his challengers will likely face an uphill battle owing to his widespread popularity as one of the most prominent members of The Church of Jesus Christ of Latter-day Saints and as a person who helped save the 2002 Winter Olympics after a bribery scandal.\nRomney defeated a rightwing challenger by more than 40 percentage points in Utah’s June 2018 Republican Senate primary before winning the general election by a margin nearly as large. He raised and spent more than $4 million in campaign contributions that year.\nStaggs said he was confident he could overcome Romney’s national name recognition, given his early conversations with Utah voters, particularly Republican primary voters.\n“The question is whether or not Utah has a Senator in Romney who’s supporting them. So many have told me they don’t feel he represents them. They feel abandoned,” he said.", "https://www.huffpost.com/entry/janet-yellen-debt-limit-dropdead_n_646cfb19e4b06749be170965": "One Republican representative says Treasury Secretary Janet Yellen should be hauled before Congress to explain herself. Another accuses her of “narrative building.”\nYellen’s alleged offense? Lying about whether the Treasury will be unable to pay the government’s bills as of June 1.\nYet Yellen’s never actually said June 1 was the “drop dead” date.\nAs recently as Monday, Yellen repeated her projection that the Treasury would run out of borrowing room under the current debt ceiling “by early June, and potentially as early as June 1.”\nThe Treasury Department receives and spends massive amounts of money each day on its way to spending $6.27 trillion annually. It’s been dancing around the debt limit since January, using various accounting “extraordinary measures” to stay below it and avoid triggering a global economic crisis.\nBut the room provided by those measures is dwindling fast, and projecting exactly when Treasury will face more in bills than it has in cash on hand and borrowing capacity is difficult. Thus, Yellen’s somewhat inexact warning.\nThat’s not enough for Rep. Ralph Norman (R-S.C.).\n“For this president just to sit back and act like nothing’s happening, this isn’t something he can do. I do think Yellen will say that, you know, we do have money coming in,” Norman told reporters on Tuesday.\n“She will extend it, but right now she’s using June 1. Everybody knows that’s false.”\nAsked when he thinks Congress actually needs to act, Norman said, “Ask [Yellen]. We need to subpoena her and get her plan.”\nNorman’s not the only House GOP member feeling that way as the clock keeps ticking toward a potential default.\n“Ask [Yellen]. We need to subpoena her and get her plan.”\nRep. Andy Biggs (R-Ariz.) tweeted Monday that Yellen was “fearmongering” and that there was no need to act by June 1.\n“This is all rhetoric driven. There’s some amounts of reality to it, but there’s also a tremendous amount of narrative building, which Janet Yellen is doing with Joe Biden,” Biggs said in an interview with former Donald Trump adviser Steve Bannon.\nBiggs is part of a group of House Republicans seen as unlikely to ever vote for a debt ceiling increase, no matter what sort of deal is negotiated with the White House.\nIn April, he told HuffPost, “My position is that you don’t have to raise the debt ceiling if you bring your spending under control.”\nAnother factor muddying the waters is that the Treasury would like to be able to hold out until mid-June, when quarterly tax payments are due, which could enable it to get to the end of June. By then, a new slate of accounting moves would be available that could allow the Treasury to keep borrowing until the end of July.\n“There’s some amounts of reality to it, but there’s also a tremendous amount of narrative building, which Janet Yellen is doing with Joe Biden.”\nThat could explain why the Treasury has, according to Washington Post reporting, asked agency budget staffers whether they could delay payments due before early June. Effectively, it would be equivalent to finding change in the couch cushions to make it to the next payday.\nSeveral private sector debt-watchers think the Treasury will likely be able to scrape by through June, but only barely, and with margins so thin that they would raise the chance of an accidental default to a dangerous level. The Bipartisan Policy Center, for example, said on Tuesday that the period of June 2 through June 13 posed an “elevated risk” of default.\nYellen’s challenge is how to be prudent — and warn when the Treasury is getting unacceptably close to default even when it will most likely be able to pay bills — without seeming to cry “wolf!” as some Republicans are accusing her of doing.\nThe panel of private sector advisers to the Treasury on debt management, the Borrowing Advisory Committee, warned Treasury on May 2 that it already had an inadequate margin for error with only $238 billion in cash on hand, “significantly below what even the nation’s largest banks hold in available liquidity despite managing significantly smaller balance sheets.”\nAs of Friday, the Treasury had only $60.7 billion on hand.\nHouse Speaker Kevin McCarthy (R-Calif.) defended Yellen, though, when asked about June 1.\n“That’s up to Janet Yellen,” he said Monday. “They decide when that date is.”\n“That’s why we took action all the way back in April, even before she said it was June 1. We thought it was in July. We don’t want to do this last minute.”\nRep. Hakeem Jeffries (D-N.Y.), the Democratic leader in the House, also defended Yellen while taking a swipe at Republicans.\n“The June 1 date is a real one. Secretary Yellen continues to make that clear,” Jeffries told reporters Tuesday morning.\n“Unfortunately, extreme MAGA Republicans are taking us down the dangerous road of default, for ideological reasons.”", "https://www.huffpost.com/entry/joe-biden-debt-limit_n_6466619ee4b06749be125fbd": "WASHINGTON ― Congressional Democrats are watching anxiously from the sidelines as President Joe Biden negotiates with House Republicans on a budget deal that would avoid a harmful default on the nation’s debt early next month.\nBiden has expressed openness to the idea of paring back some federal safety net programs, and his allies have acknowledged they will need to make concessions in order to reach an agreement by June 1, the projected date the U.S. is expected to no longer be able to meet its obligations.\nThe fact that Biden is even in the position of having to negotiate with Republicans over the debt ceiling, something they lifted three times under former President Donald Trump without any fuss, has left progressive lawmakers fuming.\n“If Democrats cave to the GOP on work requirements, 1.7 million poor people could lose their healthcare and 275,000 could go hungry. That’s what is at stake. We must stand firm,” tweeted Rep. Ro Khanna (D-Calif.) on Thursday, referring to a key GOP demand to add stricter “work requirements” to federal programs that help low-income Americans afford food and health care.\nIn further sign of angst on the left, 11 Senate Democrats sent a letter to Biden on Thursday urging him to prepare to raise the debt ceiling unilaterally by invoking the 14th Amendment of the U.S. Constitution, which states that the public debt “shall not be questioned.” The theory behind their argument is untested and would likely be challenged in the courts, however.\n“Republicans’ unwillingness to consider one penny in new revenue from the wealthy and large corporations, along with their diminishment of the disastrous consequences of default have made it seemingly impossible to enact a bipartisan budget deal at this time,” the senators wrote in the letter, questioning House Speaker Kevin McCarthy’s (R-Calif.) ability to pass a deal should one emerge in the coming days.\nBut there’s rising discontent on the right about the direction of the talks, as well.\nOn Thursday, the House Freedom Caucus, a group of dozens of hardline conservatives, called for an end to negotiations and for the Senate to simply approve the House GOP’s bill that raised the debt ceiling and sharply slashing spending over the next decade. Their stance implied that they won’t support any bipartisan agreement.\n“No more discussion on watering it down. Period,” the group warned in a statement.\n“The last thing we need is a repeat of the 2013 deal. It was a terrible deal for the country. I hope we’ve learned from our mistakes.”\nIt’s possible that the urgent warnings from the left and the right this week are a sign that negotiations between Biden and McCarthy are making progress, and that perhaps a deal is close to materializing. Still, neither side is likely to support an agreement, and their votes may not be ultimately needed to pass one.\nSenate Majority Leader Chuck Schumer (D-N.Y.) has insisted for months that Republicans agree to a “clean” debt ceiling increase that would take default off the table with no strings attached, before negotiating over the budget later this year. On Thursday, however, he said that the only path forward is a bipartisan agreement.\n“No one will get everything they want,” Schumer cautioned.\nDemocrats haven’t always loved Biden’s deals with Republicans, despite his successful track record as president. During a 2019 presidential primary debate, for example, Biden was criticized by Sen. Michael Bennet (D-Colo.) for making a “terrible deal” with Sen. Mitch McConnell (R-Ky.) that staved off a debt default in 2012. As vice president, BIden helped negotiate an agreement that made the bulk of George W. Bush’s tax cuts permanent.\n“I don’t know. I hope not,” Bennet told HuffPost on Thursday when asked if he worried about Biden agreeing to a similar deal this time around.\n“The last thing we need is a repeat of the 2013 deal. It was a terrible deal for the country. I hope we’ve learned from our mistakes,” he added.\nMcCarthy claimed one early victory over Democrats this week, bragging that he had gotten them to back off against their stance of not negotiating over the debt limit.\n“The president and Leader Schumer have finally backed off their idea that they won’t negotiate,” McCarthy declared at a press conference on Wednesday. “They finally backed off the insane, un-rational, un-sensible idea that you just raise the debt ceiling.”", "https://www.huffpost.com/entry/eugene-robinson-ron-desantis_n_646c734be4b0005c605baa04": "Washington Post columnist Eugene Robinson predicted that Florida Gov. Ron DeSantis’ expected attempt to win the Republican presidential nomination could turn out to be very short.\n“Polls still show DeSantis as having the best chance to defeat Donald Trump in the GOP race,” he wrote. “But they also show his prospects rapidly heading in the wrong direction.”\nDeSantis, who is expected to announce his candidacy within weeks, is down by 37 percentage points in one recent poll.\nDeSantis is trying to run to the right of Trump, pushing “some of the most draconian” restrictions on abortion rights as well as attacks on everyone from the LGBTQ+ community to teachers in the name of his “anti-woke” agenda.\n“Ta-da! Yet his poll numbers keep going down, not up,” Robinson wrote.\nDeSantis has also been locked in a war with Disney in retaliation for the company’s criticism.\n“Trying to punish a company for statements that had no practical impact — except, perhaps, on DeSantis’s brittle ego — seems wildly at odds with traditional conservative values,” he noted, adding: “The Disney thing would just be a loopy sideshow if it didn’t highlight traits that could hold DeSantis back as a presidential candidate — and that would be dangerous for the nation and the world if, heaven forbid, he ever became president: paper-thin skin, a propensity to hold grudges and a tendency to go way too far.”\nDeSantis has been telling donors that he’s a better candidate than Trump because he thinks he can win in the swing states. But Robinson said DeSantis’ far-right agenda won’t play well in those key regions.\n“Why would suburban women who voted for Joe Biden in 2020 vote for Ron DeSantis in 2024?” he wrote, adding: “Great politicians learn from their mistakes and course correct as necessary. DeSantis seems not to understand that going full-speed ahead is a bad idea if you’re approaching a cliff.”", "https://www.huffpost.com/entry/john-dean-donald-trump-e-jean-carroll_n_646c705ce4b0ab2b97e9eb9c": "Watergate lawyer John Dean on Monday hailed writer E. Jean Carroll’s request for more damages from Donald Trump over the former president’s continued slurs about her.\nTrump has continued to defame Carroll — most notably during his controversial town hall on CNN — even after a Manhattan jury found him liable in a civil trial for sexual abuse and defamation after Carroll alleged Trump raped her in the 1990s.\nFollowing the trial, Trump was ordered to pay $5 million in total damages.\nCarroll’s request for that figure to be raised because of Trump’s ongoing attacks on her character was “a brilliant move,” Dean told CNN’s Abby Phillip.\nDean was “not at all surprised” by Carroll’s request, he said.\n“And I think Trump could end up paying another 5 or more million dollars as a result of his loose lips,” he added.\nWatch the interview here:", "https://www.huffpost.com/entry/donald-trump-hearing-judge-witnesses_n_646c6d9de4b056fd46dc1f96": "NEW YORK (AP) — The judge in Donald Trump’s criminal case is holding a hybrid hearing Tuesday to make doubly sure the former president is aware of new rules barring him from using evidence to attack witnesses.\nTrump won’t have to show up to court for the afternoon hearing at a Manhattan courthouse, avoiding the mammoth security and logistical challenges that accompanied his arraignment last month.\nInstead, the Republican will be connected by video conference, with his face beamed onto courtroom TV monitors. His lawyers and prosecutors must still appear in person.\nJudge Juan Manuel Merchan agreed to the extra step of personally instructing Trump on the restrictions after listing them May 8 in what’s known as a protective order.\nTrump is allowed to speak publicly about the case, but he risks being held in contempt if he uses evidence turned over by prosecutors in the pretrial discovery process to target witnesses or others involved in the case.\nTrump pleaded not guilty on April 4 to 34 felony counts of falsifying business records related to payments his company made to his former lawyer, Michael Cohen.\nProsecutors say those payments were intended to reimburse and compensate Cohen for orchestrating hush money payments during the 2016 campaign to bury allegations of extramarital sexual encounters. Trump denies having had extramarital flings and says the prosecution is politically motivated.\nMerchan’s protective order bars Trump and his lawyers from disseminating evidence to third parties or posting it to social media, and it requires that certain, sensitive material shared by prosecutors be kept only by Trump’s lawyers, not Trump himself.\nProsecutors sought the order soon after Trump’s arrest, citing what they say is his history of making “harassing, embarrassing, and threatening statements” about people he’s tangled with in legal disputes.\nMerchan, noting Trump’s “special” status as a former president and current candidate, has made clear that the protective order shouldn’t be construed as a gag order and that Trump has a right to publicly defend himself.\nTrump’s lawyers are seeking to have his criminal case moved to federal court. It will continue in state court while that plays out.", "https://www.huffpost.com/entry/chris-christie-mike-murphy-2024_n_646b1d04e4b0bfd64483570a": "GOP strategist Mike Murphy predicted former New Jersey Gov. Chris Christie (R) will be “the popcorn candidate” if he decides to run for president against his onetime pal Donald Trump in 2024.\n“He’s lighting a stick of dynamite and running right at Donald Trump. This is going to be entertaining,” Murphy said of Christie to MSNBC’s Alex Wagner on Friday in a video shared online by Mediaite.\n“Voters don’t necessarily dig the guy,” Murphy said of Christie, who has indicated he’ll decide whether to run later this month.\n“But catalytically, to affect the process, he can be very powerful,” added the strategist, a former adviser to Sen. Mitt Romney (Utah) and the late Sen. John McCain (Ariz.).\nWagner pointed out Christie’s claim that he’s not “a paid assassin” whose role is to attack GOP front-runner Trump while the other Republican contenders stand back to avoid offending Trump’s base.\n“I agree, he’s not a paid assassin,” Murphy responded.\nThen came the zinger: “He’ll do it for free and for fun.”\nWagner chuckled at the comment.\nChristie endorsed Trump after quitting his own campaign in 2016, but has since become a fierce critic of the former president.", "https://www.huffpost.com/entry/michael-steele-jim-jordan-committee_n_646b0b3ee4b056fd46dace33": "Michael Steele, a former chair of the Republican National Committee, on Saturday mocked Rep. Jim Jordan’s (R-Ohio) Select Subcommittee on the Weaponization of the Federal Government, suggesting the probe of claimed bias against conservatives was actually a self-own for the Donald Trump-loving Ohio Republican.\nAsked by MSNBC’s Charles Blow if Jordan’s performance in recent subcommittee hearings had helped Democrats prove that it’s in fact Republicans who have weaponized the government, Steele replied:\n“Any time Jordan opens his mouth he proves that point. The reality is there’s no substance to any of this. This is just the dog and pony show. It’s like the worst you can come up with in the world where you can just make stuff up.”\n“So, you’re trying to connect dots that do not exist,” Steele continued. “You’re grasping about little lines of this and a little line over here about something else, and none of it ever comes together.”\nWatch the video here:\nSteele then pointed to former President Donald Trump’s actual weaponization of the justice system during his time in office.\n“Didn’t this all occur during Trump’s term in office? It was his Justice Department and FBI. It just kind of proves the point,” Steele said. “So, are you mad at Trump? Jordan, Jim, are you mad at Trump? Are you mad at Mr. Barr? Who are you mad at? What are you trying, where was the weaponization against Trump’s own people by Trump? Because that’s basically what we are looking at here.”", "https://www.huffpost.com/entry/trump-border-wall-lie_n_6467c180e4b0355739361123": "With Donald Trump’s “finished” wall at the Mexican border, how is it possible that thousands of migrants are illegally crossing into the country, as Republicans and right-wing media point out is happening on a daily basis?\nSuch is the are-you-going-to-believe-me-or-your-lying-eyes problem for the coup-attempting former president as he simultaneously argues that he kept his 2016 campaign’s signature promise while also claiming that illegal immigration is out of control.\nUnlike most of his falsehoods about NATO or trade agreements or the condition of the economy during his tenure that are difficult to fact-check by the average voter, the lack of a “big beautiful wall” along the southern border is constantly proven anew in television footage aired relentlessly on Fox News and other outlets.\n“He left hundreds of miles of border without a fence, Mexico paid for nothing, and our military families suffered,” said Jennifer Horn, a former chair of the New Hampshire state GOP. “But it will not impact his standing in the primary unless his opponents grow the courage to call him out on his failures.”\nTrump’s campaign did not respond to HuffPost queries on this topic.\nBased on recent statements, however, he appears to have settled on the brazen lie that he followed through on his most famous pledge of the 2016 campaign. At a “town hall” sponsored for him by CNN earlier this month, Trump repeatedly claimed that he completed his project.\n“I did finish the wall. I built a wall,” Trump said. “And then I said, we have to build some more because there are areas like water going through a dam. There are some areas where a lot of people are coming. You close up one and they come into another. And we started another 100 miles of wall.”\nIt was unclear how, if he had “finished” a border wall, migrants would nevertheless be coming in “like water going through a dam.”\nIn any event, his claim that he had kept his 2016 campaign promise is untrue on multiple levels.\nFrom the time he announced his run at his Trump Tower building in Manhattan in June 2015, Trump’s favorite promise for his followers was that he would not only build a wall, but force Mexico to pay for it.\n“I would build a great wall, and nobody builds walls better than me, believe me, and I’ll build them very inexpensively,” Trump said in in his announcement speech. “I will build a great, great wall on our southern border. And I will have Mexico pay for that wall. Mark my words.”\nTrump on several occasions went into great detail on the construction standards, describing how it would be at least 30 feet tall and extend deep underground to prevent people from tunneling beneath it.\n“It’s going to be made of hardened concrete, and it’s going to be made out of rebar. That’s steel,” Trump said at a December 2015 visit to Manassas, Virginia, in response to a question from a young boy in the audience. “And we’re going to set it in nice, heavy foundations.”\nOf equal importance in the promise was to force Mexico to pay, both as a way to humiliate the nation’s neighbor to the south as well as a pledge to voters not to use American taxpayer dollars on the project.\nBut both elements of the promise began to crumble soon after he took office. Within weeks, Trump spoke to then-Mexican President Enrique Peña Nieto and told him he had no intention of forcing Mexico to pay for a border wall, but that he needed Peña not to mention that publicly so Trump would not anger his supporters. “You cannot say that to the press,” he said, according to a transcript of the call obtained by The Washington Post. “If you are going to say that Mexico is not going to pay for the wall, then I do not want to meet with you guys anymore because I cannot live with that.”\nAnd even though both the House and Senate were controlled by Republicans during his first two years, Trump made virtually no effort in that time to press for border wall funding. Instead, the Department of Homeland Security stayed with a program started under Republican President George W. Bush and continued under Democrat Barack Obama to replace deteriorating sections of old fencing with new, 18- to 30-foot steel bollards.\nIndeed, Trump did not get serious about winning congressional funding for his wall until after Democrats won back the House in 2018 after picking up dozens of seats, thanks to Trump’s unpopularity. Trump forced a partial government shutdown in an attempt to win wall funding, but eventually gave up and decided to raid the military’s construction budget, diverting billions of dollars intended for housing, schools and daycare for service members and their families to his border wall instead.\nBy the end of his four years in office, Trump delivered all of 52 miles of new fence where no barrier had previously existed — a far cry from his original promise of a “big beautiful wall” along the entirely of the 1,954-mile southern border. An additional 400 miles of older, existing barrier was replaced with the new, taller steel bollard fencing — just as old barrier had been replaced over the previous two presidencies.\n“Not only couldn’t he get Mexico to pay for it, he couldn’t get a Republican Congress to pay for it,” said Rick Tyler, a former top aide in Texas Sen. Ted Cruz’s 2016 bid for the GOP nomination.\nBut despite Trump’s easily proven failure to deliver on his top campaign promise over the course of four years, most of his GOP rivals — all of whom say the United States must get tougher on border security — thus far do not seem inclined to point out Trump’s record on the matter.\nFlorida Gov. Ron DeSantis, for example, on March 30 said at a Georgia visit: “We’ve talked a lot, but I think we need to get serious and finally build a wall along the southern border” — but did not mention the obvious point that the front-runner for the 2024 GOP nomination failed to build one.\nAn adviser to one of the GOP hopefuls, who spoke on condition of anonymity, said attacking Trump on the border wall would be difficult because voters understand that he wanted to build one but that he could not overcome the obstacles placed in his way. “There are better attacks,” the aide said, pointing to Trump’s recent comments disparaging anti-abortion activists and his inability to control government spending.\nThe only candidate or likely candidate to attack Trump on the wall appears to be former New Jersey Gov. Chris Christie. “More nonsense from Donald Trump last night,” Christie wrote in a social media post the morning after the CNN town hall. “Fact: He promised to build a big beautiful wall on the border. Fact: He did not deliver & immigrants are pouring over the border. Fact: He said Mexico would pay for it. Fact: We have not gotten one peso yet. He failed us on immigration.”\nTrump critics, including former Republican officials, said other candidates are not likely to criticize Trump so directly unless and until Republican primary voters signal that they are no longer willing to accept Trump’s falsehoods.\n“The truth is, GOP primary voters have already made it clear that they don’t care about his lies. They will stand with him till the end,” Horn said.\nDavid Axelrod, a Democratic consultant who helped Obama win the White House in 2008, said the loyalty of Trump’s base continues to confound him. “The man has been indicted, found liable for sexual assault and defamation and is clearly in the crosshairs of other probes, and he has only gained ground in recent months,” Axelrod said. “To his base, it may be that if he says there’s a wall, there’s a wall — and anyone who suggests otherwise is engaged in ‘fake news.’”\nTrump, who tried to use the threat of violence and then actual violence on Jan. 6, 2021, to remain in power despite losing reelection, is under criminal investigation for his post-election actions by prosecutors in both Georgia and at the Department of Justice. He is separately under DOJ investigation for his refusal to turn over top-secret documents he had been keeping at his Florida country club in defiance of a subpoena, and has already been indicted in New York City for falsifying business records in his attempt to hide a $130,000 payment to a porn star in the days ahead of the 2016 election. He nevertheless remains the polling leader for the 2024 Republican presidential nomination.", "https://www.huffpost.com/entry/bc-debt-limit_n_646a1cc6e4b035573936de67": "WASHINGTON (AP) — Debt ceiling talks were set to resume Sunday evening as Washington races to strike a budget compromise along with a deal to raise the nation’s borrowing limit and avert an economy-wrecking federal default.\nPresident Joe Biden and House Speaker Kevin McCarthy spoke by phone Sunday while the president was returning home on Air Force One after the Group of Seven summit in Japan. Upbeat, McCarthy, R-Calif., told reporters at the Capitol that the call was “productive” and that the on-again, off-again negotiations between his staff and White House representatives are focused on spending cuts.\nHe’s to meet Biden on Monday at the White House.\nNegotiators for the Democratic president and Republican speaker appear to be narrowing on a budget cap for the 2024 budget year that would be key to resolving the standoff. They face a deadline, as soon as June 1, when the government could run out of cash to pay its bills. Treasury Secretary Janet Yellen said Sunday that June 1 is a “hard deadline.”\nMcCarthy said after his call with Biden that “I think we can solve some of these problems if he understands what we’re looking at.” The speaker added, “But I’ve been very clear to him from the very beginning. We have to spend less money than we spent last year.”\nMcCarthy emerged from that conversation sounding optimistic and was careful not to criticize Biden’s trip, as he had before. He did caution, “There’s no agreement on anything.”\n“We’re looking at, how do we have a victory for this country?” McCarthy said. “How do we solve problems? He said he did not think the final legislation would remake the federal budget and the country’s debt, but at least “put us on a path to change the behavior of this runaway spending.”\nThe White House confirmed the Monday meeting and late Sunday talks but did not elaborate on the leaders’ call.\nEarlier, Biden used his concluding news conference in Hiroshima, Japan, to warn House Republicans that they must move off their “extreme positions” over raising the debt limit and that there would be no agreement to avoid a catastrophic default only on their terms.\nBiden said “it’s time for Republicans to accept that there is no deal to be made solely, solely, on their partisan terms.” He said he had done his part in attempting to raise the borrowing limit so the government can keep paying its bills, by agreeing to significant cuts in spending. “Now it’s time for the other side to move from their extreme position.”\nBiden had been scheduled to travel from Hiroshima to Papua New Guinea and Australia, but cut short his trip in light of the strained negotiations with Capitol Hill.\nEven with a new wave of tax revenue expected soon, perhaps giving both sides more time to negotiate, Yellen said on NBC’s “Meet the Press” that “the odds of reaching June 15, while being able to pay all of our bills, is quite low.”\nGOP lawmakers are holding tight to demands for sharp spending cuts with caps on future spending, rejecting the alternatives proposed by the White House for reducing deficits in part with revenue from taxes.\nRepublicans want to roll back next year’s spending to 2022 levels, but the White House has proposed keeping 2024 the same as it is now, in the 2023 budget year.\nA compromise on those topline spending levels would enable McCarthy to deliver for conservatives, while not being so severe that it would chase off the Democratic votes that would be needed in the divided Congress to pass any bill.\nTop Republican negotiator Rep. Garret Graves of Louisiana, speaking alongside McCarthy at the Capitol, said the numbers “are the foundation” of any agreement.\nRepublicans also want work requirements on the Medicaid health care program, though the Biden administration has countered that millions of people could lose coverage. The GOP additionally introduced new cuts to food aid by restricting states’ ability to waive work requirements in places with high joblessness. That idea, when floated under President Donald Trump, was estimated to cause 700,000 people to lose their food benefits.\nGOP lawmakers are also seeking cuts in IRS money and, by sparing Defense and Veterans accounts from reductions, would shift the bulk of spending reductions to other federal programs.\nThe White House has countered by keeping defense and nondefense spending flat next year, which would save $90 billion in the 2024 budget year and $1 trillion over 10 years.\nAll sides have been eyeing the potential for the package to include a framework that would speed energy project developments.\nAnd despite a push by Republicans for the White House to accept parts of their proposed immigration overhaul, McCarthy indicated the focus was on the House’s previously approved debt and budget package.\n“I think that we can reach an agreement,” Biden said, though he added this about Republicans: “I can’t guarantee that they wouldn’t force a default by doing something outrageous.”\nRepublicans had also rejected various White House revenue proposals. Among the proposals the GOP objects to are policies that would enable Medicare to pay less for prescription drugs. Republicans also have refused to roll back Trump-era tax breaks on corporations and wealthy households as Biden’s own budget has proposed.\nBiden, nonetheless, insisted that “revenue is not off the table.”\nFor months, Biden had refused to engage in talks over the debt limit, contending that Republicans in Congress were trying to use the borrowing limit vote as leverage to extract administration concessions on other policy priorities.\nBut with the June 1 potential deadline looming and Republicans putting their own legislation on the table, the White House launched talks on a budget deal that could accompany an increase in the debt limit.\nBiden’s decision to set up a call with McCarthy came after another start-stop day with no outward signs of progress.\nThe president tried to assure leaders attending the meeting of the world’s most powerful democracies that the United States would not default. U.S. officials said leaders were concerned, but largely confident that Biden and American lawmakers would resolve the crisis.\nThe president, though, said he was ruling out the possibility of taking action on his own to avoid a default. Any such steps, including suggestions to invoke the 14th Amendment as a solution, would become tied up in the courts.\n“That’s a question that I think is unresolved,” Biden said, adding he hopes to try to get the judiciary to weigh in on the notion for the future.\n___\nMiller and Boak reported from Hiroshima, Japan. Associated Press writers Lisa Mascaro, Colleen Long and Will Weissert contributed to this report.", "https://www.huffpost.com/entry/trump-classified-documents-lawyer_n_64697386e4b035573936a019": "WASHINGTON (AP) — A lawyer who quit Donald Trump’s legal team this past week attributed his decision Saturday to strategy disagreements with a close adviser to the former president.\nTimothy Parlatore, who had been a key lawyer for Trump in a Justice Department special counsel investigation into the potential mishandling of classified documents at his Florida estate, told CNN in an interview on Saturday that there were “certain individuals that made defending the president much harder than it needed to be.”\nHe singled out Boris Epshteyn, another lawyer and top Trump adviser in multiple criminal investigations, whom he accused of “doing everything he could to try to block us to prevent us from doing what we could to defend the president.”\nParlatore disclosed Wednesday that he was resigning from the Trump legal team, a move that comes as the investigation by special counsel Jack Smith shows signs of winding down and nearing a decision on whether or not to bring charges against the former president. His comments Saturday provided additional context for the decision.\nIn a statement responding to Parlatore’s comments, a Trump spokesman said “Mr. Parlatore is no longer a member of the legal team. His statements regarding current members of the legal team are unfounded and categorically false.”\nIn his interview, Parlatore said Epshteyn had served as a “filter” in preventing the legal team from getting information about the investigation to or from Trump.\nHe also said Epshteyn had resisted the idea of the legal team organizing months ago a search of Trump’s property in Bedminster, New Jersey, for potential additional classified documents, and that he had impeded a defense strategy aimed at helping “educate (Attorney General) Merrick Garland as to how best to handle this matter.” Parlatore was one of the authors of a letter last month to the chairman of the House intelligence committee laying out a series of potential defenses in the investigation.\n“It’s difficult enough fighting against DOJ, and in this case a special counsel, but when you also have people within the tent that are also trying to undermine you, block you and really make it so that I can’t do what I know that I need to do as a lawyer,” Parlatore said.\n“And when I am getting into fights like that, that’s detracting from what is necessary to defend the client and ultimately was not in the client’s best interest, so I made the decision to withdraw,” he added.", "https://www.huffpost.com/entry/new-york-republicans-dodge-george-santos-expulsion-vote_n_6467e52fe4b0ab2b97e78029": "Several House Republicans from swing seats in New York said there’s not enough votes to kick fraudster Rep. George Santos out of Congress ― after they blocked a vote that would have put exactly that question to the test.\nThese five New York Republicans — Reps. Mike Lawler, Anthony D’Esposito, Nicholas LaLota, Marc Molinaro and Brandon Williams — joined the rest of their party in preventing an up-or-down vote on the expulsion of Rep. George Santos (R-N.Y.), despite repeatedly calling for him to leave office.\nTheir justification? Given the need for a two-thirds majority to expel any member of the House, Santos’ expulsion wouldn’t have passed an up-or-down vote anyway.\n“Since we don’t yet have the needed 2/3 supermajority to expel Santos, the quickest way to rid this institution of this stain is to refer this issue to the House Ethics Committee,” D’Esposito said in a Wednesday statement, after leading the charge for an Ethics Committee referral.\nHere’s how it happened: In response to California Rep. Robert Garcia’s introduction of a resolution to expel Santos, House Republicans instead passed a motion to refer the matter of Santos’ expulsion to the House Ethics Committee.\nAll 221 House Republicans, who participated in the vote, voted in favor of the motion’s passage.\nWhile Republicans involved in the effort depicted it as a matter of adhering to proper protocol — or, as in the case of the New York members, pragmatism — their action amounted to punting on the expulsion indefinitely.\nThe bipartisan House Ethics Committee has already been investigating Santos since March. And the Department of Justice, which earlier this month charged Santos with 13 fraud and theft-related crimes, has reportedly instructed the House panel to stand down and allow federal prosecutors to take precedence.\nInstead, House Democrats maintain that their GOP counterparts are simply keen to avoid prompting a special election that would, at the very least, create a temporary vacancy that would jeopardize their ability to pass party-line legislation. Republicans have nine more seats than Democrats in the House, but the routine defection of far-right members of the House Republican Conference has given them even less wiggle room on close votes.\n“This was an effort to bury accountability for a serious fraudster,” House Democratic Leader Hakeem Jeffries (D-N.Y.) said at a Thursday press conference. “Why? Perhaps it’s because extreme MAGA Republicans need George Santos’ vote.”\nWhatever House Republicans’ motive, their successful tabling of a Santos expulsion effort puts five New York Republicans in purple House districts in a tight spot.\nThose members have been among the most outspoken voices condemning Santos and calling for his exit, either through resignation or expulsion.\nD’Esposito, who flipped a Democratic-held Long Island seat in November, was the first House Republican to call on Santos to resign.\nAsked how he reconciled his decision to vote against an expulsion vote with his previous calls for Santos’ resignation, D’Esposito’s office referred HuffPost to the Congress member’s Wednesday statement affirming that he wished to expel Santos but that there is not yet a two-thirds majority in the House needed to expel him. In that statement, he also described Santos as a “disgusting liar.”\nLaLota, also a Long Island Republican, called for Santos to resign shortly after D’Esposito did, and went on to endorse his expulsion in late February.\nAsked to explain Wednesday’s vote, a spokesperson for LaLota referred HuffPost to his statement from that day.\n“If the Democrats were serious about his expulsion, they would work with us to get a report and referral from the Ethics Committee, rather than offer a political resolution that has no chance of passing the House.”\n“While I would have preferred there to be enough votes to expel the sociopath scam artist, Congressman D’Esposito has spearheaded the next best option: To refer this matter to the Ethics Committee where we expect a result within 60 days and for the terrible liar to be gone, by resignation or expulsion, before August recess,” LaLota said.\nRep. Marc Molinaro, who represents a district stretching from the upper Hudson Valley to the Finger Lakes region, was perhaps the first New York Republican to say he would support Santos’ expulsion in early February, a position he reiterated in March.\nMolinaro also based his vote on an understanding that the House lacked the two-thirds majority needed for expulsion, according to a spokesperson, who also shared a statement with HuffPost.\n“George Santos should not be a Member of Congress. He has irrevocably lost the trust of his constituents and colleagues,” Molinaro said. “I expect the Ethics Committee to conduct an immediate and swift review.”\nLawler, a lower Hudson Valley lawmaker who ousted then-Democratic Congressional Campaign Committee (DCCC) Chair Sean Patrick Maloney in November, has repeatedly demanded Santos’ resignation.\nAfter voting for the motion to send Santos’ expulsion to the House Ethics Committee, Lawler accused Democrats of playing politics.\n“If the Democrats were serious about his expulsion, they would work with us to get a report and referral from the Ethics Committee, rather than offer a political resolution that has no chance of passing the House,” he said in a Wednesday statement.\nFinally, Rep. Brandon Williams of central New York has more than once called for Santos to resign. Williams represents a seat long held by the GOP, but where President Joe Biden won in 2020.\nHuffPost did not receive an immediate response from a Williams spokesperson about his vote to send Santos’ expulsion to committee.\nRegardless of these Republicans’ explanations, House Democrats see an opportunity to inflict damage on five of the Republicans they are hoping to unseat in 2024.\nThe DCCC, House Democrats’ campaign arm, announced Friday that it was spending thousands of dollars on a small digital advertising campaign blasting the five New York Republicans for their vote. (A second ad blitz is due to target House Republicans in 14 other states.)\n“Vulnerable House Republicans have proven they are too weak to buck party leadership and — instead of expelling serial grifter and indicted criminal George Santos from Congress — they are protecting him,” DCCC spokesperson Viet Shelton said in a statement.\nJonathan Nicholson contributed reporting.", "https://www.huffpost.com/entry/debt-ceiling-negotiations-pause_n_6467ad1ce4b056fd46d97102": "WASHINGTON ― The lead Republicans negotiating a debt ceiling deal with the White House walked out of the talks on Friday morning, saying Republicans needed to “press pause,” but returned hours later.\n“Until people are willing to have reasonable conversations about how you can actually move forward and do the right thing, then we’re not going to sit here and talk to ourselves,” Rep. Garrett Graves (R-La.) told reporters after leaving a meeting at the Capitol.\nThe White House confirmed that the two sides remained far from an agreement.\n“There are real differences between the parties on budget issues, and talks will be difficult,” a White House official said in an email, adding that the president’s team “is working hard towards a reasonable bipartisan solution that can pass the House and the Senate.”\nHours later, the negotiations resumed, a source told HuffPost. House Speaker Kevin McCarthy (R-Calif.) said during an appearance on Fox Business that Republicans were “back in the room.”\nAnd then, shortly after the talks took up again, they ended again. Graves and Rep. Patrick McHenry (R-N.C.) told reporters they had a “candid discussion” but made no progress.\nRepublicans have demanded significant spending cuts in exchange for lifting the federal government’s “debt ceiling,” a legal limit on how much the government can borrow to pay bills Congress has racked up over the years. Republicans also want stricter “work requirements” in certain federal safety net programs.\nIt’s a high-stakes negotiation: If lawmakers can’t reach a deal, the federal government could default on its debts as soon as June 1. A default would be unprecedented and have big economic repercussions because the entire financial system benchmarks borrowing costs to the interest rates on presumably reliable government debt.\nMcCarthy and President Joe Biden sounded optimistic this week that they were making progress on a deal, prompting progressive Democrats to sound alarms about potential benefit cuts.\nFar-right Republicans in the House Freedom Caucus, meanwhile, called for McCarthy to cease negotiations, which did actually happen for several hours on Friday. Former President Donald Trump urged Republicans on Friday not to make a deal “unless they get everything they want.”\nBiden has signaled openness to new work requirements ― better understood as limits on benefits to the unemployed ― but it’s unclear where he might be willing to add them. Republicans proposed stricter eligibility rules for jobless Americans in Medicaid, the Supplemental Nutrition Assistance Program and the relatively tiny Temporary Assistance for Needy Families program.\nThe talks began in earnest last week after McCarthy demanded for months that Biden negotiate over federal spending and the debt limit. Friday’s drama went down with less than two weeks until a potential default that both sides agree could wreck the economy.", "https://www.huffpost.com/entry/aoc-debt-limit-14th-amendment_n_64677a7de4b0ab2b97e6e71e": "Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Thursday said invoking the 14th Amendment to raise the debt ceiling “should be on the table” for President Joe Biden as he continues negotiating with Republicans to prevent a default on the nation’s debt.\nThe president plans to cut short his attendance at a dinner with other leaders at the Group of Seven summit in Japan for a briefing on the negotiations, according to CNN. Biden has already agreed to shorten his travels, canceling stops in Australia and Papua New Guinea to continue talks with congressional leaders.\nEleven progressive senators, including Sen. Elizabeth Warren (Mass.) and Bernie Sanders (I-Vt.), wrote to Biden on Thursday, urging him to not give in to GOP demands and instead unilaterally raise the debt limit by invoking the constitutional amendment.\n“While we cannot default on our debt, we also cannot allow the destructive Republican budget to be implemented,” the senators wrote.\nOcasio-Cortez echoed those sentiments, telling Politico Playbook: “I think it should be on the table. And I think that the grounds for it are legitimate.”\nThe 14th Amendment includes a section on government debt that says “the validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned.”\nCritics of this approach caution that the constitutional theory is untested and would very likely be challenged in court.\nTreasury Secretary Janet Yellen, who has warned of catastrophic consequences if the U.S. doesn’t resolve the debt limit standoff before June 1, also has expressed skepticism about invoking the 14th Amendment.\n“It’s legally questionable whether or not that’s a viable strategy,” Yellen said last week.\nMeanwhile, Ocasio-Cortez also addressed the possibility of Donald Trump winning the Republican nomination in the 2024 presidential race. Asked if Democrats should hope for this scenario, Ocasio-Cortez appeared cautious.\n“I don’t think we should ever be rooting for Trump in any situation,” she said. “2020 was not a blowout.”\nBiden won the race by over 4 percentage points.\nOcasio-Cortez pointed out that the Electoral College system means presidential outcomes often are decided “in a very small handful of states.”\n“There are a lot of times that I think people overestimate Trump in certain areas,” Ocasio-Cortez said. “But they still continue to underestimate Trump, I think, in his ability to carry a message and carry a base.”\nTrump for now appears to be the GOP front-runner, even after he was indicted by a grand jury in Manhattan over his role in a hush money payment scheme, and found liable for sexual abuse in a civil case brought by former columnist E. Jean Carroll. He also faces ongoing criminal probes involving the Jan. 6, 2021, insurrection and his mishandling of classified documents.", "https://www.huffpost.com/entry/mike-pence-fox-news-woke-disney-joke_n_646696aae4b0ab2b97e639f4": "Former Vice President and expected 2024 presidential candidate Mike Pence attempted to show a new side of himself to Fox Business viewers on Thursday: the comic side.\nAnd it definitely inspired giggles, but probably not the kind Pence wants.\nPence’s attempt at being funny happened during an interview with Larry Kudlow over the Disney Co. decision to cancel a $1 billion plan to expand its Orlando, Florida, operations as its culture war with Gov. Ron DeSantis escalates.\nThe former vice president attempted to sum up his opinion on the battle between Disney and DeSantis with a quip that came off like a truly lame “dad joke.”\n“I like Walt Disney, not Woke Disney,” Pence said, before chortling at what his advisers probably assured him was a surefire laugh riot.\nProbably the funniest part of the clip is Pence trying to stop his guffawing after he notices Kudlow hasn’t joined his giggle-fest.\nPence’s punchline did inspire laughs from many Twitter users, but mostly at him, not with him.\nOthers mocked Pence by turning the structure of his woke joke on its head.\nBut one person thought the best way to respond was with the actual definition of \"woke,\" instead of the bastardized version used by right wingers.\nCORRECTION: An earlier version of this article said that Mike Pence was speaking on Fox News. He was on Fox Business."}