{
    "https://www.huffpost.com/entry/worst-foods-for-brain-health_l_6426e714e4b00c951751c2f2": "When we think about improving our brain health, we often think about mind-stimulating activities like crossword puzzles, Sudoku or Wordle. But there’s a lot more to a sharp mind than brain games: Day-to-day habits play a big role in brain health, too, starting with your diet.\nWhile occasionally indulging in certain foods that aren’t great for your brain is fine, there are popular (and admittedly delicious) foods and beverages that people who specialize in brain health — like neurologists and neuroscientists — do their very best to avoid. Here are seven of them.\nProtein powder\nIn the habit of adding a scoop of protein powder to your daily smoothie? You may want to stop, or at the very least, check the ingredients. While protein powder is often marketed as a healthy, lower-calorie option for people trying to lose or maintain weight, a lot of them are filled with artificial sweeteners, according to neuroscientist Friederike Fabritius.\n“It is those additives that really give me pause when it comes to protein powders because they wreak havoc on your gastrointestinal microbiome,” Fabritius said. “A healthy and robust internal microbiome is so important for great brain health because most of our neurotransmitters are produced in the gut.”\nSoda\nSorry, soda drinkers. Neurologist Dr. Shaheen Lakhan says your favorite bubbly beverage is just flat-out bad for your brain. “Soda is one of the worst foods for brain health due to the high concentration of simple sugars, which damage the blood vessels supplying the brain,” he said. “Over time, this starves the brain from the very fuels it needs to function, leading to premature dementia and strokes. Acutely, sugar also causes brain inflammation, irritability, poor mood and sleep disturbances.”\nPlus, the constant highs and lows (the proverbial sugar “rush” and “crash”) can also cause a state of addiction with cravings and withdrawals — and diet soda is no better. “Even diet or zero versions of soda have negative effects, as the calorie-free additives stress out the brain and trick it into consuming more calories and craving real sugar,” he said.\nMargarine\nDown with fake butter! Dr. Shae Datta, a neurologist and co-director of the NYU Langone Concussion Center, said she avoids margarine as much as possible because it contains trans fats. (Though it should be noted that there are butter alternatives without trans fats, so take a close look at the ingredients list.)\n“We often hear that trans fats aren’t good for your heart and blood vessels. The same applies to the vessels of the brain,” she said. “A study from the journal Neurology found that older adults who had the highest levels of elaidic acid (a common type of trans fat) in their blood were more likely to develop dementia. Better to stick to olive oil and real butter.”\nCannabis-infused foods\nWith the rise of CBD and the legalization of marijuana in most states, this one might come as a bit of a surprise. But just because cannabis is legal and can help you relax doesn’t mean it’s doing great things for your brain.\n“Besides the short-term cognitive impairing effects of cannabis, tetrahydrocannabinol (also known as THC, or what produces the ‘high’) appears to constrict arteries in the brain,” said Dr. Lester Leung, a neurologist and the director of the Comprehensive Stroke Center at Tufts Medical Center. “This can be very dangerous when used in large amounts by people with migraines, a very common headache condition that, together with heavy cannabis use, can lead to stroke, even in young, otherwise healthy people.”\nBeer\nThis summer, you may want to skip the beer at your neighborhood barbecue. “Beer is comprised completely of empty calories with no nutritional value,” said Dr. Byran Ho, a neurologist and director of the Movement Disorders Program at Tufts Medical Center. “Alcohol is a neurotoxin that can injure both the central and peripheral nervous system, even if consumed in moderate amounts.”\nDecaf coffee\nIf you’re a fan of decaf, Sean Callan, a neuroscientist and CEO of Ellipse Analytics, recommends you skip this jolt-free beverage unless you’re sure the decaffeination process is solvent-free.\n“Solvents, the chemicals used to remove caffeine from coffee, are generally toxic to humans,” he said. “Many are linked to increased risk of cancer or neurological harm, especially in large or repeated doses. Beyond that, solvents like methylene chloride (a solvent commonly used in the decaffeination process) are known to cross the placenta, meaning pregnant women risk exposing their unborn child to the solvent.”\nIf you still want to enjoy decaf coffee, Callan recommends you visit the site checkyourdecaf.org, where you can find out what chemicals are in any decaf brands you drink.\nFrench fries\nHere’s another bummer: French fries are one of the main foods neurologist Dr. Pedram Navab avoids. “A diet that incorporates fatty foods like French fries can damage blood vessels that supply the brain, causing cognitive impairment,” he said. “It reduces the blood-brain barrier (BBB) integrity and leads to neuronal damage of the hippocampus, a part of the brain that is instrumental for learning and memory.”\nWhile some of these foods may be easier to cut out — looking at you, protein powder and decaf coffee — some might be a bit harder. So remember to consume any favorite foods and beverages that may damage brain health in moderation, and when possible, opt for a healthier version of it.",
    "https://www.huffpost.com/entry/drinks-nutritionists-avoid_l_643715bde4b0ac4091895216": "When you think about your meal plan for the day, you’re probably thinking about breakfast, lunch, dinner, snacks and maybe dessert. But you’re probably not thinking too much about the beverages you’re consuming and how they contribute to (or take away from) your health goals.\n“Unfortunately, in this country, so much of the added sugar we’re consuming is coming from sugar-sweetened beverages,” said Heather Nace, a registered dietitian and the director of operations at Tulane University’s Goldring Center for Culinary Medicine in New Orleans.\nNace said that too much added sugar is detrimental to our health for a number of reasons: There’s a connection between added sugar and diabetes, a link between added sugar and cardiovascular disease and it can be tied to cognitive problems.\n“We know it’s not good for us, [but] it can also be tricky to avoid,” Nace said.\nBut experts don’t say you should completely cut sugar-sweetened beverages from your diet. You can still have a soda here and there.\n“I think there’s a time and place for everything to fit into a healthy diet,” Nace said, “but if you’re somebody who’s drinking soda as your main beverage throughout the day, it’s something to be mindful of.”\nWhy? There are a few reasons. Below, experts share the beverages they tend to avoid and the reasoning behind their choices.\nDiet Soda\n“For me, personally, I don’t like diet beverages and diet sodas,” said Carlie Saint-Laurent Beaucejour, a registered dietitian and owner of Crave With Carlie, a virtual nutrition practice.\nDepending on the artificial sweetener in these drinks, she said she doesn’t enjoy the aftertaste.\nAnd it’s “also the side effects … just because it can cause bloating and other digestive issues that may not be good — I do see that a lot in people that I work with,” she said.\nArtificial sweeteners can affect your digestion, research shows. Additionally, artificial sweeteners affect your sweet tolerance and make you want sweeter things, Saint-Laurent Beaucejour said.\nBut, again, she also believes that all foods and drinks can fit into a meal plan — so, for most folks, if you’re going to have soda, go for a half can instead of a full can of diet soda.\nSaint-Laurent Beaucejour added that dietary advice is individualized, though, so for someone with diabetes, diet soda is the best option because it won’t have as much of an effect on blood sugar.\nRegular Soda\nIn addition to diet soda, regular soda is not a frequent beverage choice among the experts who spoke to HuffPost.\n“Soda would be the one for me,” said Nace, who noted that the added sugar is a major reason why.\n“A 12-ounce can of soda has about 39 grams of sugar in it,” she said, and the current dietary guidelines say 10% of our total daily calories should come from added sugars — so, for a 2,000-calorie diet, one can of soda is almost equivalent to that 10% limit. And it’s pretty common to have more than just one 12-ounce can of soda in a day.\nJeanette Andrade, a clinical dietitian in the food science and human nutrition department at the University of Florida, added that soda “doesn’t contribute to any kind of health benefits for me ... it doesn’t really have a lot of vitamins or minerals in there.”\nEnergy Drinks\n“The thing about energy drinks, which is really interesting, is most people ... think of them as being, ‘Oh, it’s good for me. It’s going to give me energy,’” Nace said. “They sort of often overlook the fact they also have a lot of this added sugar.”\nShe said that one 8-ounce can of Red Bull has 27 grams of sugar, which is equal to about 7 teaspoons of sugar.\nAccording to the American Heart Association, women should limit themselves to 6 teaspoons of sugar per day. For men, it’s 9 teaspoons. One can of Red Bull is more sugar than a woman should have a day and is nearly the daily allotment for men.\nJuices\nJuices also fall in line with the high sugar concerns that experts have. For example, Minute Maid’s fruit punch drink has 24 grams of sugar in an 8-ounce glass, which is comparable to the high amount of sugar in Red Bull.\nJennifer Scherer, a fitness nutrition professional and president of Fredericksburg Fitness Studio in Virginia, said this is why she avoids drinks like apple juice, Hawaiian Punch and sugar-sweetened lemonade.\n“I’m just of the belief that you should have the whole fruit itself, which has the fiber,” Scherer said.\nWhen she has a craving for something sweet, she reaches for an orange instead of orange juice.\nAlcohol ... With A Caveat\nAt first thought, alcohol seems like something to avoid — it’s often high in sugar, is linked with liver damage and increases your risk of cancer.\nAdditionally, some people have adverse reactions to alcohol and can’t tolerate it at all, Andrade said.\nBut research says that certain alcohols — namely, red wine — potentially carry a small health benefit, she added.\n“Dark red wines ― not necessarily a rosé, that’s not going to give you as much antioxidant boost ― but the really dark, rich red wines,” she said.\nThe exact benefits of red wine still need to be explored, Dr. Don Pham, a cardiologist in Houston, previously told HuffPost. There’s some thought that resveratrol, an antioxidant in red wine, can lower inflammation and blood clot risk, Pham said, but more research is needed because the data has been mixed.\nBeyond wine, though, Andrade said the mixers that accompany cocktails add to the beverage’s caloric and sugar contents (like margarita mix in tequila or rum in a rum and Coke). For example, 4 ounces of Margaritaville margarita mix has 26 grams of sugar, which is just as much as a can of Red Bull.\nOn top of that, folks often don’t accurately disclose how much alcohol they truly drink, Andrade said.\n“It’s a taboo subject that no one really wants to admit. And if they do admit to it, they’re usually underestimating how much they’re consuming,” Andrade said.\nWhen you underestimate how much alcohol you consume, you’re also underestimating the amount of sugar that you’re drinking alongside your dinner.\nAnd, as the experts pointed out, high-sugar beverages can be OK sometimes, but drinking them shouldn’t become a habit.",
    "https://www.huffpost.com/entry/cancer-doctors-food_l_64357018e4b0c2da1508a4a9": "When you think of lowering your cancer risk, your mind probably goes to quitting smoking, exercising regularly and wearing a sun hat and sunscreen.\nBut so much of your cancer risk is dependent on other behaviors, too, like how much alcohol you drink and the kinds of food you eat.\nUnfortunately, carcinogens are everywhere and hard to avoid.\n“My philosophy is you need to manage your exposure to cancer-causing agents or carcinogens. You cannot remove carcinogens from your entire life,” said Dr. Otis Brawley, the associate director of community outreach and engagement at the Sidney Kimmel Comprehensive Cancer Center at Johns Hopkins Medicine.\nPart of managing your exposure is understanding what foods contribute to your cancer risk so you can limit your consumption.\nAdditionally, Dr. Xavier Llor, the medical director of the colorectal cancer prevention program at Smilow Cancer Hospital at Yale New Haven Health, said many of the items he avoids for cancer risk reasons he also avoids for other health reasons, too.\n“Really, it’s kind of like most of this stuff is just not good for a variety of reasons,” Llor said. Very few things are bad for one aspect of your health but great for another — for example, many foods carry both a cancer risk and cardiovascular risk, he noted.\nBelow, cancer doctors share the foods they avoid to help lessen their cancer risk.\nHot Dogs, Sausage, Bacon, Deli Meat And Other Processed Meats\nYou probably know that processed meats are not a healthy food choice. In fact, Dr. Diane Reidy-Lagunes, a medical oncologist at Memorial Sloan Kettering Cancer Center, said processed meats are linked to cancer (in addition to conditions like heart disease and diabetes).\n“Processed meats include food such as hot dogs, sausage, bacon and others such as deli meats,” Reidy-Lagunes told HuffPost via email. “It is believed that the preservatives, (such [as] nitrates or nitrites) can lead to the formation of potentially cancer-causing chemicals.”\nAccording to Reidy-Lagunes, processed meats are classified as a Group 1 carcinogen by the World Health Organization, which is in the same category as tobacco, smoking and asbestos.\n“However, it is important to note that this doesn’t mean that the risk of eating processed meat and developing cancer is the same risk as smoking and the development of cancer; the level of risk with smoking and cancer is considerably higher,” she said.\nBut, she added that avoiding processed meats altogether or only having them occasionally is a healthier diet. Instead of reaching for a hot dog or a sandwich with salami, Reidy-Lagunes said lean meats (like chicken) are the better option, along with proteins like fish, beans and nuts.\nCharred Foods\nIn today’s “we can’t have anything” news, it turns out that while foods like grilled chicken and grilled fish are nutritious — they’re high in protein and low in calories — putting something on the grill to the point that it chars can increase your cancer risk, according to Brawley.\n“The [char] has heterocyclic aromatic amines and polycyclic aromatic hydrocarbons, both are known carcinogens,” he said. And this goes for grilled red meat, of course, but also for the healthier grilled items mentioned above.\nYou can still have grilled foods, but to reduce your cancer risk, Brawley said you shouldn’t grill them to the point of charring. He added that, for this reason, he avoids meats that are really, really grilled.\nRed Meat\nDr. Chris Scuderi, a family physician in Jacksonville, Florida, and a cancer survivor, said he doesn’t eat red meat because it can increase your risk of certain kinds of cancer. “I haven’t had meat in 12 years,” Scuderi said.\nLlor agreed and added that red meat is something that he consumes rarely because of its cancer risk and cardiovascular risk (red meat consumption is linked to heart disease).\nSpecifically, studies show that red meat is linked to a higher probability of colorectal cancer and, according to MD Anderson Cancer Center, it also heightens the risk of prostate and pancreatic cancer.\nCereal And Other Sugary, Processed Foods\nLlor said he avoids foods that are ultra-processed, like cereal, because of the connection between processed foods and cancer. Additionally, he said he tries not to consume cakes and pastries for the same reason.\nWhile sugar doesn’t directly influence cancer, it can increase other risk factors, like obesity (one of the leading risk factors for many types of cancer) and Type 2 diabetes, which can also increase one’s risk of cancer.\n“There’s a diabetes and obesity link to cancer,” Brawley said. According to a 2018 study (Brawley is a co-author of the study), 7.8% of cancers are due to excess body weight.\nIn addition, a British study of 200,000 people found that those who consumed ultra-processed foods (like cereal and cakes) may have a higher risk of developing cancer.\nScuderi said he also avoids processed items.\n“I’m a cancer survivor, so I pay close attention to my diet, and also avoid processed and packaged foods as much as possible, and eat as cleanly as possible,” Scuderi added.\nWhite Bread\n“The thing that I avoid as much as possible, and I don’t avoid it 100%, [is] white bread,” Brawley added.\nWhen asked why, Brawley explained that white bread has no nutritional benefit that you can’t get with whole-grain bread. And, similar to cereal and sugary foods, it’s linked to cancer risk factors like diabetes and obesity.\nSoda And Other Sugary Drinks\n“I also, by the way, do not drink sugary beverages,” Brawley said. This is again because of the lack of nutritional value and the high caloric value.\nLlor added that soft drinks and sugary beverages are also something he rarely consumes.",
    "https://www.huffpost.com/entry/most-dangerous-foods_l_643068d1e4b0859acb93fdf8": "Food inspectors see a lot of gnarly food.\nAlso referred to as food safety managers and food science technicians, these professionals are tasked with enforcing the Food and Drug Administration’s guidelines across companies to ensure that all matters related to food meet important standards — not just how the fare is made, but also how it’s sourced, packaged, stored, dealt with over time and distributed all over the country. These folks makes it easy for us to buy groceries without having to worry too much about what’s safe.\nWhen you hear about salmonella and E. coli breakouts, for example, it’s because a food safety inspector was able to recognize and isolate the issue, a job that requires different levels of training depending on where in the United States you’re looking to practice.\nSo if there’s a food at the supermarket that you should avoid, a food safety inspector is the first person you should ask. We reached out and asked them what, exactly, they won’t shop for when they’re at the grocery store.\nUnpasteurized (Raw) Milk\nAlso known as raw milk, unpasteurized milk is milk that has not gone through a heating process as defined by the U.S. Department of Agriculture that kills pathogens, extends shelf life and makes the drink safer for consumption.\nAs a result, according to the Centers for Disease Control and Prevention, raw milk may boast harmful germs like salmonella, E. coli, listeria, brucella and more.\nInterestingly enough, the sale of raw milk is actually illegal in some states. The Farm-to-Consumer Legal Defense Fund offers a pretty nifty state-by-state breakdown. In Alabama and Colorado, for example, the ban on raw milk extends to retail store sales, off-farm sales and on-farm ones. On the other hand, in California, Maine, New Mexico and Pennsylvania, among others, it is permissible to sell raw milk.\nThat being said, food safety regulators tend to stay away from the drink.\n“Although it is possible to purchase raw, unpasteurized milk in some states, I recommend people not consume it,” said professor Kali Kniel, a microbiologist at the University of Delaware who also explained that when a product is actually contaminated with a pathogenic microbe, the food won’t smell or look different for the most part. So a “sniff test” of raw milk won’t indicate whether it would be safe for consumption.\n“There are a lot of people who tout [raw] milk as having all these health benefits, but it’s just not worth the risk because there are a lot of pathogenic organisms that are still alive in that milk, especially if it’s coming straight from a processing facility,” said Dr. Bryan Quoc Le, a food chemist and industry consultant based in Washington state.\nRaw Sprouts\nAccording to the experts, you shouldn’t necessarily entirely stay away from sprouts (think radish, alfalfa and clover, for example ― not Brussels sprouts), but, given that the food may be a source of harmful bacteria like E. coli and salmonella, it’s important you wash all products thoroughly before eating them. (According to the FDA, “there’s no need to use soap or a produce wash but plain running water is fine.”)\n“In order for sprouts to germinate, the seeds cannot be adequately disinfected to kill all the salmonella that could be there, for example,” Kniel explained. “But, in saying this, let’s keep in mind that there are sprouts growers who are doing a great job and pay close attention to cleaning and sanitation.”\nLe’s outlook is a bit more cautious. “There seem to be more foodborne issues with sprouts and I think that is because of the desire not to use chemicals because of the type of consumers who like to buy them,” he said. “The probability of contamination is not so high, it’s more of a moderate risk, but I personally would avoid them.”\nPre-cut Produce\n“If you’re going to eat pre-cut produce raw, you are dealing with the same amount of microbial risk as you would with sprouts,” Le said. “That’s because I don’t know what the person behind the counter has done while cutting the produce and what practices they implement. Packaged food, by law, has to go through a stringent process but food that has been produced on-site doesn’t necessarily.”\nKniel warns against cut melons in particular as they tend to support quick bacteria growth. Melons are most susceptible to contamination for a variety of reasons: They grow on the ground and can therefore soak and trap infected water throughout its harvesting process. On the ground, they can also come into contact with bacteria from animal feces that share space with them. Finally, the skin of the melon or cantaloupe lends itself to bacteria growth as the pathogens can easily stick to it and, perhaps, penetrate the rind.\nThat being said, when it comes to produce — pre-cut or whole — both experts suggest washing everything thoroughly prior to ingestion, storing all in the fridge, consuming the fare within a few days of purchase and, perhaps, considering cooking it instead of eating it raw.\nHot Food Bars (With A Caveat)\nWhen it comes to hot food bars at delis, supermarkets and the like, experts tend to look at the conditions of where the prepared food is kept over what is actually being offered.\nRule number one: All food should be maintained at a hot temperature of 135 degrees Fahrenheit or higher or below 41 degrees Ferenheit if being kept cold in order to properly fend off any potential bacterial growth.\n“If the heating system is questionable, I would avoid the hot food bar,” Le advised. “But if it is kept above the proper temperature then you are OK eating it because it can’t be contaminated.”\nKniel agrees with that assessment and offers a few more tips to keep in mind while at the hot food bar. “I look to see that the sneeze guard is in place and clean and that tongs are clean and available,” she said. “I want to see that the tongs are being handled carefully by my fellow consumers.”\nKniel also mentions keeping turnover in mind. When visiting a hot food bar during lunch or dinner hours, for example, you can expect the offerings to be replenished pretty often. If considering grabbing some fare during “off hours,” you might want to think about the fact that the “foods may have been sitting there longer and you may be more careful with your choices.”\nOther Things To Keep An Eye (And A Nose) Out For\nThis one should come as no surprise: If you notice packaged food that looks unsafe or smells bad, stay away from it.\n“Consumers should look at the integrity of packaged foods to be sure the packages are not compromised in any way,” Kniel said, specifically advising to stay away from dented cans, as well. “In terms of food safety, if a meat or seafood product smells ‘bad’ or too fishy then it may be spoiled and those should be avoided. Also: Check the sell-by dates on the fresh produce packages to help you understand when the quality may start to deteriorate unless you are going to eat it right away. This is good for bagged salads, which actually have a long shelf life.”\nRegarding fruits in particular, the expert doesn’t purchase bruised products and, when selecting berries, looks for packages that are free of molds by checking the underside of the container.\nBonus Tip: Wash Your Reusable Shopping Bags\nWhen stocking up pantries and fridges, most shoppers keep safety-related issues in mind while actually selecting foods at the store, but, according to Kniel, the conscientiousness should go further than that.\n“One important consideration today is the reusable grocery totes that many people use,” she said matter-of-factly, suggesting that consumers clean and wash the totes after and in-between shopping trips and, perhaps even more importantly, avoid using them for other tasks. “For example, don’t place soccer cleats in a bag one day and then fresh produce in it the next day without appropriate cleaning — or just don’t do that at all.” Cross-contamination is a real thing.",
    "https://www.huffpost.com/entry/what-does-an-antibacterial-cutting-board-do_l_644fed8be4b0d840388feb33": "Take a look at any cooking show, restaurant kitchen or Instagram food influencer and you’ll see a variety of cutting boards, with everyone having their own allegiance to a certain material. Some prefer hard plastic, whereas others love wood or bamboo.\nBut if you’re concerned about food safety, which type of cutting board is the most sanitary?\nA new label has recently entered the conversation: antibacterial cutting boards. But before spending money on yet another cutting board, we wondered: Do you really need an antibacterial cutting board? What does that mean, exactly? We spoke with some food safety experts, and here’s what they had to say.\nWhat is an antibacterial cutting board, anyway?\nWhile antibacterial cutting boards come in many materials, some are naturally antibacterial and some are synthetic. One goal they have in common is eliminating pathways for bacteria to live on the surface, or in cracks and crevices.\n“In general, cutting boards come in different materials, including thin or thick plastic, wood, glass, metal, bamboo, pressed wood or stone,” explained Trevor Craig, a food safety expert at Microbac Laboratories. Many antibacterial boards have “coating or material that creates environments that do not support the growth or survival of bacteria.”\nWhile some antibacterial cutting boards are plastic, there are steel and wooden ones, too. Antibacterial boards can’t be damaged as easily as cheaper boards, and without cracks for bacteria to hide in, germs can’t survive a good cleaning as easily.\nBefore purchasing an antibacterial cutting board, Craig said you should know that “some materials, like wood, already have natural antimicrobial effects.”\nWood with antimicrobials can kill off mold, mildew and other microbes in addition to bacteria. A 1994 study in the Journal of Food Protection found no trace of dangerous bacteria intentionally applied to wooden cutting boards and allowed to soak into the wood.\nHow many cutting boards do I need?\nAlthough owning an antibacterial cutting board is good step to ensuring food safety, you shouldn’t stop there. To stay safe from cross-contamination, it’s advised that you have more than one board ― at the very least, one for meat and another for vegetables and fruit, said food scientist Bryan Quoc Le.\n“Fruits and vegetables are usually consumed raw. If meat were to be used on the same board, there could be contamination,” Le said.\nHow do I sanitize my cutting board?\nEven with two boards, it’s essential to clean them thoroughly. Many are now dishwasher-safe.\n“Wooden cutting boards should be hand washed, but most plastic or metal boards can go into the dishwasher,” Craig said. Follow the manufacturer’s instructions.\nAll cutting boards, including antibacterial ones, should be washed regularly with soap and water. But if you want to take it further, the U.S. Department of Agriculture suggests washing your boards with diluted bleach ― 1 tablespoon of unscented liquid chlorine bleach per gallon of water.\nWhen should I replace my cutting board?\n“Plastic cutting boards should be replaced once every one to five years,” Le said. “For wooden cutting boards, they can be replaced once they are warped or have excessive large grooves from water damage, which can trap mold and bacteria.”\nThe USDA and the Food and Drug Administration both suggest replacing your cutting boards, no matter the material, when you notice they have become excessively worn, or have hard-to-clean cracks. This includes cutting boards that claim to be antibacterial.\nBelow, we rounded up some antibacterial cutting board options to consider. They can make great gifts for your next shower or housewarming. Or, if you need a new one for yourself, look no further than right here.\nHuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change.",
    "https://www.huffpost.com/entry/unhealthy-foods-doctors-eat_l_6447f986e4b03c1b88c98a54": "Doctors spend years learning about the best ways to take care of the human body. But as humans themselves, they know that life is not all rules and best practices. Sometimes, you just need a slice of pizza, a cold can of Diet Coke or some milk and cookies, and that’s OK, too.\nWe talked to physicians in fields including family medicine, cardiology, internal medicine, public health, dermatology and plastic surgery who told us about ways they balance their own nutritional lives. One good example is Dr. Femi Akinnagbe, a resident physician in family medicine at Harbor-UCLA Family Medicine in Los Angeles. Four to six days a week, he exercises and meditates. “I find those practices are not only good for my health but essential in my daily stress reduction,” he said. But, he said, there are moments when he takes a different approach.\nHe admitted there are times when “gymming and sitting in silence don’t totally get me to the equanimous state of being that allows me to navigate the world from a state of inner repose,” and, for those occasions, “I spend some quality time with my two therapists, Ben & Jerry. In my younger days, I could polish off a whole pint of cold, creamy goodness in one sitting. After treating countless patients with diabetes, I’ve cut back on my habit to just a couple of spoonfuls when I do indulge.”\nSweet Cravings\nMany of the doctors we spoke with admitted to having a sweet tooth that occasionally needs attention. Facial plastic surgeon Dr. Babak Azizzadeh savors Italian gelato with a wafer cookie. “I usually have it about once a week when I’m home in Los Angeles, but I enjoy it daily when I’m in vacation mode,” he said. “It reminds me of walking around in Florence and other parts of Italy when I was on a backpacking trip through Europe during medical school.”\nAnother plastic surgeon, Dr. Mark G. Albert, follows a vegan diet fairly closely, describing himself as a “casual endurance athlete.” Still, every month or two, when he finds himself in a pharmacy, he buys peanut butter cups. “It reminds me of my childhood, and there’s nothing better than finding one with especially crunchy chocolate on the outside and fresh peanut butter on the inside,” he said.\nAnd of course, it’s always good to leave room for chocolate. Dr. Nsisong Asanga, a physician with a background in public health and field epidemiology, enjoys chocolate on special occasions. “Nutrition, celebration and enjoyment are cool, but guilt is useless,” she said.\nDermatologist Dr. Mojgan Hosseinipour is also an unabashed chocolate aficionado. “I like dark chocolate with raspberries, the perfect mix of bitter and sweet,” she said. “I try to eat mostly plant-based, whole food recipes, and I avoid processed foods and foods with a high glycemic index that can spike blood sugar. But sometimes I crave chips, cookies or ice cream, and that’s OK, as long as it’s not a daily habit.”\nFamily Favorites\nSometimes our favorite foods are connected to family moments. For Dr. Rich Joseph, whose clinical practice focuses on obesity and metabolic health, pizza night is an important family ritual. “My whole family loves pizza, especially my two young kids,” he said. “Seeing their eyes light up when pizza boxes come through our front door is priceless. I want them to have a healthy relationship with food and learn to eat things they enjoy mindfully, without guilt and in moderation.”\nFamily medicine physician Dr. Faisel Syed sets aside time with his sons for an after-dinner ritual of cookies and milk. “It’s become a time for us to connect, laugh and enjoy each other’s company,” he said. “By no means am I encouraging indulging in unhealthy foods, but this is more about finding balance and joy in the little things in life. It feeds my soul.”\nCheers To Beer And Diet Coke\nDr. Deirdre Mattina, a cardiologist at Cleveland Clinic, follows the Mediterranean diet and doesn’t drink alcohol. But there’s one indulgence she allows herself: a daily can of Diet Coke. “I have a lifelong obsession with that drink,” she said. “We all choose our vices, and I struggle with this one, but no one can pry that cold can out of my hand.”\nAs they work their way through long hours, a refreshing beverage is often welcome. For plastic surgeon and associate professor of surgery at Harvard Medical School Dr. Samuel Lin, a favorite workday beverage is bubble tea. “It’s a great pick-me-up when I’m seeing patients in the office all day,” he said.\nAfter hours and when they’re not on call, some doctors prefer a potent potable. Dr. Bradley Serwer is an interventional cardiologist who said he maintains a cardiac healthy diet “98% of the time.” Still, he makes room for a double IPA once or twice a month. He realizes that “we meet with friends for drinks or dinner, not to survive, but to connect on a social level, and an occasional ‘guilty pleasure’ is part of that.”\nNostalgic Foods That Taste Like Home\nFood that tastes “like home” can be nourishing for more than just our physical selves. Dr. Reid Maclellan is an adjunct faculty member at Harvard Medical School, with expertise in vascular anomalies and lymphedema. His treat of choice, he said, is whiskey. “I’m both Scottish and a Tennessean, so whiskey is part of my culture,” he said. “Hosting friends and family over a dram is always a wonderful bonding experience.”\nAnother cultural connection is made by internal medicine physician Dr. Simon Pimstone, an associate professor at the University of British Columbia. He savors a taste of his native South Africa with the beef-jerky-like national snack known as biltong, which he described as “my absolute indulgence.”\n“It’s delicious, verging on addictive,” he added.\nDr. Joon Lee practices functional, integrative and obesity medicine. For her, a cherished nighttime snack is Korean spicy shin ramen. While acknowledging that it’s a “spice, salt and carbohydrate bomb,” she said that eating a hot bowlful “brings me back to childhood memories of my mom cooking ramen for me when I got hungry studying in the middle of the night,” she said. “It not only fills my belly, but satisfies my inner core of being Korean. We need fresh whole food for our bodies, but sometimes — just sometimes — certain foods reward our hard work or reconnect us to our roots.”\nAll Things In Moderation\nAs you’re navigating your own balance for nutrition and health, consider this practical advice from Akinnagbe: “I actually like to partake in treats like ice cream and beer from time to time, because it reminds me to not take myself too seriously. If you were to ask my co-workers, friends and family, they would all tell you I’m a super healthy, fit guy. While that’s true, sometimes having that reputation can become a little confining.”\n“Don’t get me wrong, making healthy dietary and exercise choices is essential for good health and a long life,” he said. “Still, sometimes it just feels good to not always be ‘on point’ and just allow myself the opportunity to indulge.”",
    "https://www.huffpost.com/entry/eco-friendly-grilling-tips_l_6447f706e4b0408f3e55b848": "While the perks of outdoor grilling are legion, it can leave behind some less-than-appealing effects on the environment. Studies show that charcoal grills in particular release substantial carbon dioxide into the air with each use, and the cumulative effect of these greenhouse gasses contributes to global warming and climate change.\nAlso, demand for charcoal (which is made from burnt wood) can promote deforestation and release further greenhouse emissions from the charcoal-making process (the burning of large quantities of wood produces carbon dioxide, carbon monoxide and methane).\nAll of this together can diminish the goal that chef Sarah Glover recommends for all outdoor grillers: “Leave the space better than you found it and never take for granted what you get from being outdoors.”\nTo find out how to have an enjoyable summer barbecue while causing the least-possible damage to your natural surroundings, we asked professional grill chefs and eco-conscious cookware experts to give us their top tips on eco-friendly grilling.\nSeek out high-quality pure lump charcoal.\nCharcoal briquettes are popular among home grillers, since they’re easy to light without the aid of lighter fluid and provide even heat to the grill. However, these composite chunks, which contain wood chips and sawdust, are often held together with chemical additives that extend their burn time and help them maintain their shape. Those additives also can release additional emissions into the air.\nChef Luis Mata doesn’t recommend briquettes for eco-conscious cooking. Instead, he said that “the key to making your charcoal grilling experience more eco-friendly is to use the highest quality lump charcoal you can get your hands on.”\n“Lump charcoal” is exactly what it sounds like: lump-shaped pieces of charcoal that haven’t been chemically processed or shaped. It tends to be the preferred charcoal of barbecue pros, who cite the fact that it lights quickly, burns hot and leaves behind less residual ash than briquettes.\nFor an especially solid lump charcoal that’s better for the environment, Mata recommends Binchotan, “a Japanese crafted hardwood lump charcoal that’s known as the purest in the world. It burns longer, hotter and cleaner than any other charcoal or briquette. It’s also smokeless and odorless, and can be reused.”\nSteer clear of lighter fluid.\nCharcoal (particularly lump charcoal) generally requires a fire starter to light. While petroleum lighter fluid is popular for this purpose, the experts we spoke to generally advise against it.\n“Lighter fluid is made of hydrocarbons, which can be toxic if ingested and could cause symptoms such as stomach or throat pain, vomiting, difficulty breathing and skin or eye irritation,” said Ben Jablonski, CEO and co-founder of The Good Charcoal. “Furthermore, the smoke given off by lighter fluid-soaked coals contributes to air pollution.”\nThe University of Illinois Sustainable Technology Center backs up these claims, stating that “lighter fluid causes air pollution, such as polycystic aromatic hydrocarbon, when burned.”\nPima County, Arizona, issued a warning about the use of lighter fluid on grills in 2016, noting that, when “mixed with intense solar radiation and other pollutants, the chemicals in lighter fluid create a pollutant called ground-level ozone. Elevated levels of ground-level ozone can affect children, people who work or exercise outside, the elderly and people with lung or heart disease, including asthma and congestive heart failure.”\nHealth issues that can come from ground-level ozone exposure include coughing, difficulty breathing and heightened vulnerability of the lungs, according to the U.S. Environmental Protection Agency.\nGlover recommends using “natural fire lighter fluids — or, even better, get an ax and split your own wood into small kindling so you don’t have to use fire-lighting fluid at all.”\nIf you’re using kindling, invest in a charcoal chimney starter to speed along the charcoal-lighting process.\nIf possible, switch to a natural gas grill.\nCharcoal grills have a serious cult following among grilling enthusiasts, but they’re not the only game in town. If you want to really optimize your eco-friendly grilling practices, consider ditching the charcoal in favor of a natural gas grill. Because of their very low emissions, wide availability and moderate price point, the Sierra Club calls natural gas grills “the most realistically eco-friendly option” for most home grillers.\nPrevent flare-ups with catch pans or aluminum foil.\nFire breakouts on a grill can be alarming for many reasons, but an underrated one involves the fact that they release more smoke — and, therefore, more toxins — than necessary into the environment, according to chef Ron Stewart.\nTo lessen the risk of flare-ups, take Stewart’s advice and “put aluminum foil below your meat so that any dripping fat does not land directly on the coals/embers. You should also consider either investing in an inexpensive catch pan designed for catching grease drippings or using a heavy-duty aluminum foil tray underneath your food during cooking to safely collect excess fats before they fall onto coals/burner elements.”\nShut down the grill as soon as you’re done cooking.\nFor an easy way to cut back on emissions, turn off the grill as soon as your food is ready.\n“When using charcoal, most people will let their coals burn down and out when done cooking, which can take hours,” Jablonski said. “The result is hours of charcoal emissions emitted with no further purpose. The solution is quite simple: When you are done cooking, simply close the lid to the grill and shut any vents or baffles. This will very quickly stifle the lit coals and leave a basket of slightly used charcoal ready for your next grilling encounter.”\nBriquettes should be thrown in the garbage, but lump charcoal can be repurposed as fertilizer.\nWhile briquettes with synthetic materials should be thrown in landfill garbage after use, Jablonski told us that lump charcoal can often be reused if it hasn’t burned down completely. But after the second grill cycle, it’s time to figure out where to dispose of those residual bits and ash.\nJablonski has a simple and eco-friendly solution: “As long as you use an additive-free wood charcoal, you can use it as fertilizer. The ash contains potash (potassium carbonate), which is nutritious for many plants. Potash can also increase the pH levels in your soil, but depending on what you’re growing, you want to use it sparingly. Don’t use charcoal ash with acid-loving plants (like blueberries, azaleas and hydrangeas), nor newly planted seedlings and seeds.”\nAs an alternative, Jablonski said that tossing a few pieces of used lump charcoal into your compost pile can help the entire composting process.\n“Charcoal increases the carbon content” of the compost pile, he said. “Carbon is important to provide energy to microorganisms while they break down the organic matter in compost.”",
    "https://www.huffpost.com/entry/worst-foods-for-skin-dermatologists_l_645403d4e4b00eb7e63a3c4a": "If you’re like me, you grew up hearing all kinds of questionable advice about what you should and shouldn’t eat if you want clear, glowing skin. The “chocolate causes acne” myth is one that is oft-repeated, but blessedly, it’s been found to be more urban legend than empirically proven fact.\nWhen it comes to the human body, few things are as simple as “X causes Y” — cutting out or adding any given food is unlikely to be the magic bullet for beautiful skin. But there are some links between diet and skin health that are backed by reliable evidence.\nAdvertisement\n“Patients commonly ask about dietary modifications to help improve their skin or control certain skin diseases,” said Dr. Tiffany J. Libby, a Rhode Island-based board-certified dermatologist. “The short answer is that diet can absolutely affect your skin, and we are learning more about the responsible pathways for how it does so.”\nAs a result, there are some foods you’re not likely to catch certain dermatologists eating for lunch. We spoke to several skin docs about the foods they do and don’t eat for the sake of their skin. Keep in mind that there’s no one-size-fits-all prescription for skin health, but keep reading for guidelines these dermatologists use in their own lives.\nDairy\nToday’s milk mustache could be tomorrow’s breakout. Several of the doctors we spoke to say they severely limit their intake of dairy products, if not cut them out altogether.\n“Dairy products, especially high-fat milk, and cheese, contain hormones that can trigger acne in some people,” said Dr. Yoram Harth, a board-certified dermatologist. “Milk contains an androgen precursor that can increase oil production and clog pores, while cheese contains a high amount of saturated fat, leading to inflammation in the body and skin.”\nAdvertisement\nThere is actually a pretty substantial body of research that links acne and dairy consumption, especially milk itself — whole, low-fat and skim milk included. Researchers haven’t figured out why, exactly, but some hypothesize that the proteinwhey is to blame. If you struggle with breakouts, you might want to consider cutting back on (or eliminating) milk and other dairy-based foods.\nFried Foods\nIt probably doesn’t come as much of a shock to hear that many dermatologists advise to stay away from oily, fried foods like doughnuts, fried chicken and french fries.\n“Fried foods are often high in unhealthy fats, particularly trans fats and saturated fats,” said Dr. Asmi Sanghvi, a board-certified dermatologist in New York City. She mentioned, first and foremost, that these kinds of fats can impact your overall health ― but the effects might show up on your skin, too.\n“From a skin health perspective, research has shown that diets high in unhealthy fats may contribute to inflammation in the body, including the skin,” Sanghvi said. “Inflammation is a common factor in many skin conditions, including acne, psoriasis and eczema. A diet high in unhealthy fats may also contribute to the breakdown of collagen and elastin in the skin, leading to premature aging and the development of wrinkles.”\nSoda\nThis one isn’t terribly surprising, but several of the doctors we interviewed specifically called out soda as something they never or rarely consume. The primary reason for that, Sanghvi said, is the high sugar content present in most sodas.\nAdvertisement\n“Consuming large amounts of sugar can lead to increased inflammation throughout the body, which can exacerbate skin conditions such as acne, rosacea and eczema,” Sanghvi said. “Sugar can damage collagen and elastin fibers in the skin, which can contribute to wrinkles and premature aging.”\nSanghvi said sugar-free sodas aren’t a good alternative, because ”artificial sweeteners interfere with the body’s normal signals that control hunger and satiety,” increasing the risk that you might consume more sugar. She recommends skipping stevia, aspartame, sucralose and sugar alcohols like xylitol and maltitol in favor of natural sweeteners like monk fruit, honey or maple syrup.\nOf course, anything that’s high in sugar can cause inflammation and contribute to signs of aging, not just soda. But, if you’re a big soda drinker, the beverages contain something else you should watch out for.\n“Many sodas contain caffeine, which can dehydrate the body and leave the skin looking dry and dull,” Sanghvi said. “Dehydration can also lead to an impaired skin barrier, which can make the skin more susceptible to environmental damage and skin irritations.”\nAdvertisement\nSanghvi advises people to skip sugary drinks, including soda, as much as possible and hydrate with water instead.\nRefined Carbohydrates (Pasta, Bread)\nAlmost every doctor we spoke to mentioned that they try to limit their consumption of refined carbs like pasta, bread and white rice. Libby pointed out that these foods, like sugary drinks and desserts, have a high glycemic index.\n“High glycemic index [foods] (i.e., white rice, white bread, sugary beverages, etc.) and dairy are examples of proposed dietary triggers for acne,” Libby said.\nHigh glycemic index foods are ones the body is able to break down quickly, which can lead to spikes in blood glucose. There is some evidence linking low glycemic diets to reductions in acne; the American Academy of Dermatology Association notes that studies have not yet proved a causal relationship between high glycemic diets and acne, but there may be a link. Doctors and researchers hypothesize that high glycemic foods can cause inflammation as well as increased production of sebum (an oil produced by your skin).\n“I, and I don’t think I’m alone, love my pastas, but try to eat them in moderation as these certainly fall in the high glycemic index chart for foods,” Libby said. “I try to look for foods that fall lower on the glycemic index (< 55) such as most fruits and vegetables, beans, minimally processed grains, pasta, low-fat dairy foods and nuts.”\nAdvertisement\nCured And Processed Meats\nDr. Roberta Del Campo, a Miami-based board-certified dermatologist, pinpointed cured and processed meats as a group of foods that she avoids. Cured and processed meats, like hot dogs, sausages, bacon, pepperoni and salami, are frequently red-flagged by medical professionals because they’re linked to serious illnesses like heart disease, Type 2 diabetes and several different cancers. If that weren’t reason enough to skip sausages, Del Campo says the nitrates in cured and processed meats can have a negative effect on skin health, as well.\n“I avoid eating foods that are high in nitrates such as bacon, ham and hot dogs,” she said. “Nitrates are known to increase inflammation throughout the body. Skin is our biggest organ and inflammation can wreak havoc on it.”\nInflammation is the body’s natural immune response to injury or infection, and depending on the cause, it can manifest in the form of swelling, pain, fatigue or even psoriasis. The direct relationship between cured meats and skin health hasn’t been extensively studied in clinical settings, but knowing what effects they can have on overall health, there’s good reason to be wary.\nFermented Foods, Citrus and Spinach (For Some People)\nIf you have a skin condition that causes itching, like eczema or rosacea, some seemingly innocuous foods could be contributing to your symptoms. Fermented foods like kimchi and kombucha, citrus fruits, and even eggplant and spinach are all nutritionally rich foods, but they’re also high in histamines — the compound that’s activated in your body when you’re having an allergic reaction. Typically, the body breaks down histamines with an enzyme called diamine oxidase, but if you’re taking in histamines faster than your body can break them down, it may exacerbate preexisting skin conditions. Dejarra Sims, a San Diego-based naturopathic doctor with a focus in natural skin care, explained what some of her patients experience.\n“Upon eating citrus they will have increased or new pimples, increased itching with hives and eczema, and increased redness and flushing with rosacea,” she said. For those who do have this sensitivity, “most will know immediately once I teach them to start paying attention to their diet and see a resolution of symptoms within one to two hours after eating.”\nAdvertisement\nFor most people, however, histamine-rich foods won’t have any effect, in which case you can eat all the oranges and kimchi your heart desires.\nWant a quicker fix to boost your glow? Check out these skin care products under $50 that actually work, according to experts and reviewers.\nHuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change.\n1\nMaelove\nMaelove The Glow Maker serum\nMaelove's Glow Maker serum has long being considered an affordable alternative for those who covet the ultra-pricey SkinCeuticals C E Ferulic acid serum. This cult favorite has the same balance of active ingredients, including vitamin C, vitamin E, ferulic acid and hyaluronic acid. It drenches the skin in healing antioxidants that can help improve brightness and texture while infusing it with hydrating and nourishing botanicals.\nPromising reviews: \"Wow. I'm 61, and after two weeks of using this my cousin who I have not seen in 3 years told me my skin looked so smooth and bright.\" — Debbie J.\n\"Amazing product! I've seen a massive difference since I started using The Glow Maker! It makes my skin glow and has helped with dark spots. I am going to continue purchasing!\" — Robert S.\nThis French drugstore-brand moisturizer is everywhere these days, beloved by influencers, models, makeup artists and our own staff writer Tessa Flores. It has a sensitive-skin-friendly formula that includes calming aloe vera, protective beeswax, nourishing soy proteins and skin-softening shea butter.\nPromising review: “I’m 43 and live in Colorado and I’m not kidding when I say I have tried 20+ moisturizers in the past few years trying to find something that works in the winter for my super fair, super sensitive skin. I tend to break out easily with certain ingredients and fragrances, also often deal with flaking/redness. It has been so hard to find something that is moisturizing ENOUGH that doesn’t break out or irritate my skin, but still actually works. I’ve tried so many Sephora lines as well as Biossance and Caudalie, numerous drugstore brands in all price ranges, but this cream is amazing. Moisturizing enough to use as a night cream but not so greasy that you can’t wear it during the day under makeup, and super soothing for redness and irritation.” — KaritaG\nBlack Girl Sunscreen moisturizing sunscreen lotion SPF 30\nSPF is a non-negotiable regardless of skin tone, but it's not easy to find formulas that don't leave a white cast. Makeup artist Kierra Lanice Wray just recently recommended Black Girl Sunscreen's lightweight hybrid formula. It's made with zinc oxide, aloe, lavender and shea butter and leaves skin dewy, soft, smooth and healthy — as well as protected.\nPromising review: \"I absolutely love this sunscreen and will forever repurchase it. It leaves my extremely dry skin looking super dewy. It is a necessary step before applying my makeup! The only downside for me personally is that i wish it was more than spf 30 but im looking to try their new hybrid formula that's spf 50.\" — Dom\nDr. Shari Sperling, a board-certified dermatologist at Sperling Dermatology in New York and New Jersey, told HuffPost previously, \"Retinol helps promote cell turnover, stimulate collagen, reduce discoloration and restore your skin’s natural texture and tone. Differin, which used to be prescription-only but is now available over the counter, is a great product for acne and anti-aging.\" Use it to spot treat acne or all over to help prevent breakouts and help with overall skin health.\nPromising review: \"My dermatologist recommended this to me for the comedonal acne on my forehead. She said it could take up to 3 months to work, but within 7 days of using it, my forehead was mostly clear. I am thrilled and will keep using this from now on. I use a good moisturizer afterward and it hasn't been drying out my skin.\" — Olivia\nLaneige lip sleeping mask is a wildly popular lip mask and for good reason. It creates a seal on the lips that lets the product’s hydrating ingredients soak in. Wake up to soft, hydrated and thoroughly nourished lips of your youth with minimal effort.\nPromising review: \"I absolutely love this lip mask. I've tried other ones and this one is just so soft and stays on well but doesn't feel sticky. The scent is nice and subtle. The chocolate one has a bit of a brown cast to it which does show more than the pinkish berry one. I LOVE LOVE LOVE the little silicone tipped spatula thingy - it is so nice to use. I like using that so much more than using my fingers. My lips have been a lot softer since I've been using this regularly. Since the chocolate is smaller, I use that one for travel mainly and use the pink more for night time when I'm home.\" — Pandalu\nSimilarly to The Ordinary's exfoliating treatment, Paula's Choice uses a potent blend of BHAs to help gently resurface acne-prone, rough and dull skin. It can help to unclog pores, smooth wrinkles and even out skin tone. It's less abrasive than other treatments, and also hydrates and smoothes out skin without causing damage or irritation.\nPromising review: \"I had wanted to try this for a long time so I finally got the travel sized bottle to give it a go and it’s been great. I disagree with the reviews saying it’s tiny, it is small but it’s the same ounces as my other serums but without the thick glass bottle and dropper. The travel sized bottle has lasted me a month at this point and has about a third left and I use it once a day. I would say if you used a cotton pad to apply it then it would probably go a lot quicker so I prefer to use my fingers immediately after washing my face. Anyways, this works miracles and hasn’t dried my skin out yet when using with a Hyaluronic acid serum over top. I’ve gotten compliments on my skin a lot and people thinking I’m wearing foundation when I’m not. I tried differin and tretinoin last year for several months each and never got results like this. I also am allergic to so so many cosmetics and this has yet to cause me to get the flaky rash that I so easily get around my mouth and eyes. My only tiny complaint might be that the texture can feel a smidge oily/heavy at first, but it really isn’t too bad and it sinks in after about 10 minutes to where you wouldn’t notice it more than any other skincare product. I also think I notice that less when I use it immediately after washing my face when my skin is still not totally dried out, which maybe helps it sink in quicker, I’m not sure. I highly recommend giving this a try though. For $13 you would definitely have enough product to see some results before deciding to splurge on the full size.\" — Rhyann Wilson\nDr. Brendan Camp, a board-certified dermatologist at MDCS Dermatology in New York, noted that this mineral sunscreen is great for people who have breakout-prone skin. This is the tinted version, but you can also grab a clear one if you prefer a natural, clean slate. It doesn't clog pores or feel heavy and has a lovely soft finish that isn't too oily. It's the perfect combination of skin care and makeup.\nPromising review: \"I was prone to breakouts from other sunscreens which made me not want to wear them. Elta MD is a great dermatologist recommend sunscreen that keeps your pores clear while providing break protection and a tinted appearance. Great to wear alone or as a base layer in your make up routine. Will be buying again.\" — Madi\nAzelaic acid is a must for anyone hoping to reduce the look of dark spots and fade acne scarring, while also targeting active breakouts with the help of salicylic acid. It's a very effective, versatile serum that's available at a very reasonable price. Many reviewers also note that it works wonders for those with rosacea.\nPromising review: \"Great product. This cream is a perfect solution for oily parts of my face. It blurs pores and makes my skin tone even. It was a great preventive treatment for my acne as well.\" — Jane\nFirst Aid Beauty hydrating serum with hyaluronic acid\nLeave your skin bouncy and firm with this popular and highly-rated serum from First Aid Beauty. Camp stated that \"hyaluronic acid (HA) is normally found in skin, and functions to attract water molecules to keep skin moisturized. Using an HA serum at night helps skin recover from environmental stresses from the preceding day.\"\nPromising review: \"Bye bye wrinkles. I absolutely love their products. This hyraluronic Acid is the best non greasy fast absorbent. It leaves my skin looking bright. I love the way my face feels after using it and i can still apply my makeup after using without clumping or smearing. It has also done wonders for my aging neck. Get old stinks but this is making it a little less of a problem.\" — Kelly McConnell\nThe Ordinary AHA 30% + BHA 2% exfoliating peeling solution\nHardcore skin care devotees rave about The Ordinary's 10-minute chemical peel in a bottle. It's a blood-hued exfoliating treatment that can help with acne, skin texture and dullness. It harnesses the power of both AHAs and BHAs like glycolic acid, lactic acid and salicylic acid, which exfoliate the skin and pores to help reduce congestion.\nPromising review: \"Was skeptical given the price. This is a miracle product. I tried it before going to bed one night, not thinking it would do much and I realized when I looked in the mirror the next morning that my skin was visibly smoother and less textured. I chalked it up to good sleep but after it happened a couple more times after using this product I realized it’s the serum that’s making my skin look so good. I had my mom try it as well and she said the thing. It does sting a little when applied (do NOT apply to wet or damp skin- must be dry) but it’s not bad at all for me. I use this weekly and my skin has never looked better!\" — barb99\nWhile a face mask might seem high-maintenance, there's a good chance you'll be able to find a way to pop it into your routine even just once or twice a week. This is a great option for those who want the luxury skin care experience but don't want to go into major debt trying to get the skin of their dreams. According to Sperling, \"this mask is soothing, anti-aging, hydrating and is great for all skin types, including dry/dehydrated skin. It leaves the skin looking and feeling refreshed.\"\nPromising review: \"After a year of use I cannot say enough good things about this product. I have a mix of dry and oily very sensitive skin. Most exfoliating products either give me hives, cause breakouts, burn, or leave the skin more dry than before. This product smells fantastic (pineapple/orange), is so unbelievably gentle, and leaves skin feeling clean and moisturized. It feels like a professional facial in a bottle. It's helped reduce breakouts and even out my skin tone as well. I use 1-2 times a week on a wet face after the shower before any other products or just in the shower after cleanser. Worth every penny even if you don't have an elaborate skin care regimen.\" — KayliJean\nNiacinamide is one of those wonderfully versatile antioxidants that generally works well with a range of skin types and addresses everything from uneven skin texture to signs of aging and excess oil production. This Inkey List serum has a whopping 20% concentration of niacinamide along with hydrating squalene and zinc to help balance it all out. As Dr. Carmen Castilla, a board-certified New York-based dermatologist, mentioned in a previous article, \"the 20% niacinamide concentration is relatively high and has the potential to be irritating. However, the formulation also has squalene, a fatty acid, which can help support the skin barrier and may prevent irritation.\"\nPromising review: \"New added product for my routine! So I have used this product for about 2 months ... It works! Before my face would be super oily and shiny at the end of the day, but when I would put this on every morning my face is completely not oily! it really works very well, a good bit will be good and it will be a little tacky. Put it on after all your serums and before your moisturizer.\" — ClearCleanBeaut\nFor anyone seeking deep, restorative hydration, this barrier repair cream is a must. It's great for dry patches, irritated skin and anyone who needs to add an extra dollop of moisture to their routine. Colloidal oatmeal and beta glucan soothe, reduce redness, smooth and support skin's natural barrier. It's just as nourishing and effective as pricey creams like SkinFix and Sunday Riley, but it won't leave you panicking about the cost.\nPromising review: \"Love love love this moisturizer!! It has such a rich and balmy texture that relieves the dryness on my skin the second I put it on.\" — hafsamlb",
    "https://www.huffpost.com/entry/healthier-ice-cream-brands_l_63fe5ee3e4b0db7a1f686277": "When it comes to ice cream, the options in the freezer aisle of your grocery store are myriad these days, from full-fat dairy-based ice creams to brands like Halo Top that pack a surprisingly small number of calories (along with ingredients like erythritol, xylitol and guar gum). When it comes to what’s “healthy” and what’s not, there are a lot of factors at play.\nIn recent years, conversations about nutrition have shifted in a really positive direction, with support for mindful eating replacing old, harmful ideas about “guilty pleasure” foods. After all, eating foods that bring you pleasure “can catapult the brain into feeling happier and more positive, thanks to the surge of serotonin, which is considered essential and healthy,” said Tracy Lockwood Beckerman, a New York City-based registered dietician and author.\nIce cream falls into this category, and “healthy” ice cream options can include low-sugar and dairy-free versions, as well as full-fat and dairy ice creams eaten in moderation.\nWe asked dieticians, nutritionists and doctors to recommend the healthiest ice creams sold at grocery stores, and they provided these eight suggestions, all available nationwide.\nHaagen-Dazs Ice Cream\nIt’s easy to be skeptical about the idea that full-fat dairy ice cream can be worked into a healthy diet, but our experts overwhelmingly agreed that it’s very possible, as long as you pay close attention to the ingredients. Caroline Young, the registered dietician behind Whole Self Nutrition, argued that these ice creams “are typically the best options, unless you have a dairy allergy or intolerance. I find full-fat dairy to be the most satiating option, which makes sense, because fat is the main nutrient that makes food satisfying!”\nWhen helping clients interpret ingredient lists and figure out which treats to add to their diets, Dr. Lisa Oldson, a physician specializing in internal medicine and obesity medicine who’s also an instructor at the Feinberg School of Medicine at Northwestern University, urges them to pick “desserts made with actual food, rather than ultra-processed versions of dessert.”\nOldson finds that many lower-calorie, dairy-free brands use additives and artificial components, and these chemical ingredients make it easy to overeat (since they’re not as satisfying and hearty as natural ingredients) and can also put consumers at risk for “other health problems, including diabetes and dementia.”\nOldson recommends Haagen-Dazs as her top ice cream choice for a healthy diet, since this brand uses only “cream, skim milk, cane sugar, egg yolks and vanilla extract” to make vanilla ice cream.\nElizabeth Quinn, a certified nutritionist and the creator of Whole Story Nutrition, agreed. “Haagen-Dazs only uses eggs to stabilize their dairy products,” she said, so there are no gums (processed stabilizers). “Their ingredient lists are clean and natural. They do not use rBST-treated milk or cream,” Quinn added.\nA 2/3-cup serving of Haagen-Dazs vanilla ice cream contains 320 calories, 25 total grams of sugar, 21 total grams of fat and 6 grams of protein. Each pint container includes 2.5 servings.\nHalo Top Ice Cream\nThe rise of Halo Top in the frozen dessert world has been very noteworthy. In 2017, Halo Top earned the title of the most popular ice cream pint in the United States.\nWhile some of our experts expressed concern about Halo Top’s artificial and processed ingredients (including synthetic sweeteners and coloring agents), Katherine Gomez, a registered dietician and medical reviewer at Psychemag, finds that Halo Top can be healthily incorporated into a balanced diet because the brand’s “unique flavors include dairy, nondairy and keto options.”\n“It is creamy ice cream with low calories and no sugar,” Gomez said. “It is also gluten-free, kosher and protein-rich.”\nA 2/3-cup serving of Halo Top vanilla bean ice cream contains 100 calories, 7 total grams of sugar, 2 total grams of fat and 6 grams of protein. Each container includes 3 servings.\nTalenti Gelato\nGelato, the Italian version of ice cream, features numerous benefits from a health perspective. It contains less air than ice cream, which gives it a silkier texture. Some frozen-dessert fans assume that gelato’s richer mouthfeel and more concentrated flavors mean this product contains more fat and sugar than standard ice cream, but the exact opposite is true.\nTalenti gelato, which can be found at grocery stores nationwide, “is slow-churned, [so] it has a creamy texture and reduced fat,” said Erin Lehman, a registered dietician who’s a diabetes care and education specialist with Arden Nutrition. Talenti is lower-fat, lower-calorie, and just as satisfying and indulgent as any full-fat dairy ice cream out there.\nA 2/3-cup serving of Talenti Madagascan vanilla bean gelato contains 260 calories, 30 total grams of sugar, 13 total grams of fat and 5 grams of protein. Each container includes 3 servings.\nArctic Zero Ice Cream\nArctic Zero has made a real name for itself in the nondairy ice cream space, thanks to its sizable range of flavors, widespread distribution and creamy texture that’s very close to that of “real” ice cream.\nIt’s a favorite brand of Mary Sabat, registered dietician, certified trainer and creator of Body Designs by Mary. It’s made from purified water, organic cane sugar, allulose (a naturally occurring sweetener with fewer calories than sugar), sugar cane fiber, faba bean protein concentrate, gum blend, natural flavors, sea salt and monk fruit concentrate.\n“These plant based ingredients make for a higher protein product with less sugar and more fiber,” Sabat said.\nIn terms of pure numbers, Sabat points to the low calorie count and high nutritional value of a reasonably sized portion: “Each 2/3-cup serving contains 50 calories, 3 grams of fiber, 2 grams of protein and 0 grams of fat.”\nAlec’s Ice Cream\n“Organic” might feel like a buzzword with little meaning these days, but ice cream that genuinely meets the U.S. Department of Agriculture standard of organic (made using milk harvested from pasture-fed cows that aren’t given growth hormones or antibiotic treatments) can easily be incorporated into a health-conscious, additive-free diet.\nPooja Mahtani, a functional medicine clinical nutritionist, considers Alec’s Ice Cream, which makes dairy ice cream with organic milk, a prime example of healthy dairy-based ice cream.\n“Alec’s sources dairy from organic and pasture-raised cows, and contains a moderate amount of sugar compared to other brands on the market,” Mahtani told us. “Further, there are no preservatives or additives in this ice cream.”\nA 2/3-cup serving of Alec’s Tahitian vanilla bean ice cream contains 270 calories, 23 total grams of sugar, 18 total grams of fat and 5 grams of protein. Each container includes 2.5 servings.\nCado Avocado Frozen Dessert\nBy using avocado as its core ingredient, Cado Avocado Frozen Dessert manages to create a plant-based ice cream that’s rich and creamy while also being vegan-friendly and packed with healthy vitamins.\n“I would consider an ice cream ‘healthy’ [if it is] higher in protein than others and lower in sugar than others, while also offering some micronutrients,” explained Morgyn Clair, a registered dietician and a health writer for Fit Healthy Momma. Cado, she said, fits into all of these categories because it “has lower sugar than other choices, [it’s] high in healthy fats and fiber, and Vitamin E is present from the avocados.”\nA 1/2-cup serving of Cado nondairy vanilla bean frozen dessert contains 170 calories, 12 total grams of sugar, 11 total grams of fat and 0 grams of protein. Each container includes 3 servings.\nBen & Jerry’s Ice Cream\nBen & Jerry’s, the delightfully kitschy ice cream brand founded by (and named after) two Vermont hippies, is best known for its creative flavors and slumber-party-perfect pint containers. While neither of those characteristics necessarily point to Ben & Jerry’s potential as a healthy treat, Barbara Kovalenko, a nutrition consultant at Lasta, assured us that the brand’s ice cream can be enjoyed in moderation as part of a nutritious diet, largely because of its careful sourcing and focus on natural ingredients.\n“Ben & Jerry’s provides organic and fair trade options,” Kovalenko said. To balance out the high calorie content, Kovalenko suggested that you “adhere to suggested serving sizes and treat yourself to it sometimes rather than making it a regular component of your diet.”\nDr. Ellen Albertson, a registered dietician and psychologist and creator of The Midlife Whisperer, also pointed out that the higher fat content of Ben & Jerry’s can make it easier to stick with smaller portions:\n“The brand uses natural ingredients, no artificial fats, and non-GMO milk from cows that graze,” Albertson said. “Plus, each scoop is packed with flavor, so a small serving is very satisfying.”\nA 2/3-cup serving of Ben & Jerry’s vanilla ice cream contains 330 calories, 28 total grams of sugar, 21 total grams of fat and 6 grams of protein. Each container includes 3 servings.\nYasso Ice Cream Bars\nGreek yogurt tends to be a popular choice among dairy fans who want to take a healthier approach, thanks to its dense texture, its slightly tangy flavor and its higher protein content. Yasso Greek Yogurt Bars echo more typical ice cream bars with their luxe, tongue-coating creaminess.\nMolly Pelletier, a registered dietician who specializes in gut health, recommends them to anyone in search of a healthy ice cream option. “I’m a huge fan of Yasso Ice cream bars. Yasso bars are not only low in sugar, but also a good source of protein,” she said.\nA single serving of chocolate fudge flavored Yasso contains 80 calories, 12 total grams of sugar, 0 total grams of fat and 6 grams of protein.\nYasso also makes bite-sized Poppables, which Beckerman views as an ideal grab-and-go frozen snack. “Yasso Poppables are the healthiest on the market, thanks to the portion-controlled, probiotic-forward, poppablility of Greek yogurt coated in a dark chocolatey quinoa crunch,” she said",
    "https://www.huffpost.com/entry/how-to-compost-at-home_l_645a4d4be4b0c10612e73fdc": "Composting has been around since the beginning of time, but the climate crisis has driven up interest in turning waste into fertilizer in recent decades. While some people do their own composting, others take advantage of weekly compost pickups provided by their cities or towns, or visit bins at their local farmers market to drop off their compostable waste.\nComposting reduces waste and lowers greenhouse gas emissions by as much as 50%, making it an important action step in the fight against climate change. Unfortunately, composting can be incredibly confusing for beginners. What can you compost, and what can’t you compost? Does “biodegradable” mean compostable? What kind of bin do you need? If you’re not doing it right, you could be wasting a lot of time and energy without even making a positive impact.\nHere are the most common mistakes sustainability experts see composting novices making.\nGiving Up Too Quickly\nMark Driscoll, a sustainability expert and founder of the sustainable food systems consultancy Tasting the Future, is the first to admit that composting is an art, especially if you’re composting in your own backyard or even saving up compost throughout the week. “People give up too early when things go wrong,” he said. “For example, people often fail to get the right mix of green and brown material within their compost bins/heap. Unless your grass clippings are mixed with brown material, it will turn into sticky, smelly sludge.”\nHe explained that “greens” are things like grass clippings, uncooked kitchen waste, fruit and vegetable peelings and leafy plants. “Browns,” on the other hand, include items like hedge clippings, wood chips, leaves, plant stems, paper (including shredded paper), cards and paper straws, wooden egg boxes and paper-based tea bags.\nAbby K. Cannon, a registered dietitian who lives an eco-friendly lifestyle, admitted that there is a bit of a learning curve when it comes to composting. “But once you get the hang of composting, which doesn’t take very long to do, it becomes second nature and you’ll wonder why you didn’t start sooner,” she said.\nNot Knowing What You Can Compost\nMost people know you can compost fruits and vegetables. But according to Cannon, there are plenty of other little-known waste items that should go in the compost bin, not the trash. “You can actually compost your own hair and nail clippings,” she said. Gross? Yes. Great information? Also yes.\nDriscoll added that you can compost pet hair, among other surprising items: “You can compost coffee grounds and tea bags (be careful, though, as some tea bags are made from plastic and should be avoided), natural loofahs, cotton balls and cotton T-shirts that are made from 100% cotton without added synthetics, old wool clothing (preferably with natural dyes) with any zips, buttons or fasteners removed, the inner tube of toilet rolls and small amounts of shredded cardboard” with any tape removed.\nAnd perhaps most surprising, Driscoll said you can actually compost human urine. “For men, peeing on your compost can add high levels of nitrogen or phosphorus, although you’ll need a secluded garden for this.”\nNot Knowing What You Can’t Compost\nJust as important as understanding what you can compost is understanding what you can’t compost. Both Driscoll and Cannon note that you cannot compost meat, as this will create a smelly compost pile and probably attract vermin, and, although eggshells are fine to compost, eggs are not.\nDriscoll said many people take the “biodegradable” label on plastic bags to mean “compostable.” “Just because they are biodegradable does not mean they are compostable,” he said. “Biodegradable plastics can leave a toxic residue, while compostable plastics break down into water, carbon and biomass that can produce nutrients for plants.”\nIn a similar vein, Cannon said that if you have a backyard compost, you may not be able to compost packaging that says “compostable” on it. “You have to make sure that it’s backyard compostable, not commercially compostable,” she said. “If something is labeled commercially compostable, it’s not suitable for your backyard compost, unfortunately.”\nNot Turning Your Compost Regularly Enough\nWhether you’re composting in your own backyard or saving up compost in a bin throughout the week, it’s important to turn your compost every three to four days. But many people forget to do this. “I’m totally guilty of this myself,” Cannon admitted.\nDriscoll explained that turning your compost regularly actually speeds up the composting process, which is especially convenient when you’re building your own backyard compost. “You can either use a rotating compost bin or turn it by hand,” he said. “Turning adds air that speeds up the composting process.”\nUsing Compost As Your Main Source Of Discarding Food Waste\nWhile composting is an excellent way to reduce food waste and lower greenhouse gas emissions, if you find your compost pile getting unwieldy, it’s worth it to consider other ways to reduce food waste. “Vegetable scraps can be used to make broth, nut milk can be made from leftover nut pulp and stale bread can be transformed into croutons or breadcrumbs,” plant-based chef Matthew Kenney said. “By getting creative and using all parts of our food, we can reduce our environmental impact and enjoy delicious meals at the same time.”\nThere’s no doubt that composting requires some patience, but as with anything, it will become easier the more you do it. And sustainability experts will be the first to tell you the environmental payoff is well worth it.",
    "https://www.huffpost.com/entry/stress-eating-unhealthy-foods_l_5f8efa7dc5b69daf5e16db1e": "From COVID-19 to a stressful news cycle, there’s no shortage of things stressing us out. And unfortunately, when the going gets tough, the tough get hungry. Tension triggers the release of stress hormones like cortisol, which can signal hunger cravings and send us on a search for food (especially the junk variety) to soothe our uneasy souls.\nUsing food as a coping mechanism for stressful situations ― think emotional eating ― can cause more harm than good. But on the other hand, food doesn’t have to be the enemy. In fact, when you make mindful choices, food can be a useful tool for taking the edge off. It all boils down to selectivity.\nChoosing wisely between what will help alleviate overall stress in the long run versus the instant gratification given by unhealthy fixes is how the war on stress can be fought (and won) with food.\nFood and stress are connected and should be managed concurrently\nThe brain and the gut literally feed off each other, so the idea that what we eat triggers and affects our emotions is by no means far-fetched.\n“The gut is our second brain,” explains Nikki Ostrower, an integrative nutritionist and founder of NAO Wellness. “Some of the brain’s neurotransmitters, aka happy chemicals, are manufactured in the gut ― 90% of serotonin, for example [a neurotransmitter associated with mood, sleep, appetite and gastrointestinal activity] is produced in the gut, which means there’s a direct correlation between mental health, well-being, digestion and food cravings.”\nWhat drives people in the direction of comfort food is those aforementioned cravings, plus a lack of healthy options at hand. “People turn to food when they’re stressed because it provides easy albeit temporary relief,” Ostrower said. Unfortunately, the quick and easy fixes often don’t offer any health benefits.\nComfort in the moment can be consequential in the future\nOften, what we eat for contentment increases physical and mental stress. Those sluggish, tired or foggy feelings that follow an overindulgent meal are no accident, and the side effects are far from comforting.\nJudith Joseph, a psychiatrist and professor at New York University, has noticed an uptick in patients “cooking more decadent foods that remind them of happier times” during the pandemic. She warns, however, that “typical comfort foods like fried and sugary dishes boost a chemical in our brain called dopamine, so initially it feels really good eating these things.” But those good feelings are short-lived, Joseph reminds us, because “these foods can cause unhealthy spikes in insulin and lead to a buildup of unhealthy cholesterol in your organs, which puts stress on the body and brain.”\n“We reach for the usual comfort food suspects because they initially help us feel better, but they all cause stress in the body’s organs and ultimately end up making things worse,” Joseph said. In order to tap into food’s ability to control angst, Joseph advises choosing healthy foods “as an important component of self-care that can lead to decreased anxiety.”\nWhat to eat when you’re stressed\nThe urge to stress eat makes it tough to make mindful choices, but fighting that urge can prove beneficial to keeping your emotions in check. Rheumatologist Magdalena Cadet recommends eating any foods rich in zinc (which lowers cortisol levels), magnesium (which encourages relaxation and sleep) and vitamin E (which reduces oxidative stress on the brain) to help with stress reduction. “Sunflower seeds and legumes like chickpeas are great starting points,” she suggested.\nOstrower, who documented her personal battle with pandemic-induced stress eating on social media, attests, “A diet rich in natural whole foods and absent of the packaged processed stuff, can be a strong ally in fending off stress. After one day of mindful and conscious food choices, feelings of clarity and strength slowly returned.”\nFoods rich in omega-3 fatty acids like salmon, tuna and walnuts have been known to help with combating stress since, according to Cadet, they can “reduce inflammation in the body and help prevent spikes in blood pressure.” Based on their similar stress-busting capabilities, Cadet suggests “opting for flaxseed, soybean or canola oil when cooking” and is also a fan of sweet potatoes and other nutrient-rich complex carbohydrates “for their ability to lower cortisol levels and provide adequate vitamin C and potassium, which are important stress fighters.”\nChocolate devotees have options as well, according to Ostrower, who “always suggests dark chocolate for clients craving something decadent because it’s filled with essential calming minerals like magnesium.” Citrus fruits, chamomile and turmeric are also high on Ostrower’s list because they “support healthy gut function and have mood-boosting qualities.”\nChoose healthy foods with similar qualities to your favorite snacks\nSwitching from potato chips to an apple feels like a downgrade, right? To combat that, Joseph recommends searching for reasonable facsimiles.\n“Instead of seeking the crunchy sensation from chips, try crunchy almonds; instead of sipping two glasses of wine, sip one glass of wine and one cup of chamomile tea, which has natural relaxants,” she suggests. “Instead of overdosing on coffee, replace a cup of joe with a cup of matcha, which contains antioxidants and boosts attention without the high buzz or anxiety.”\nIf you’re struggling with an eating disorder, call the National Eating Disorder Association hotline at 1-800-931-2237.",
    "https://www.huffpost.com/entry/what-athletes-eat-for-breakfast_l_61fd5250e4b09170e9d0482e": "The Winter Olympics are here, and as we watch super humans (aka professional athletes) perform impressive physical feats, you may wonder what exactly they eat to be able to do these incredible things. To get answers, we chatted with two experts who have spent years working with professional athletes to figure out the best foods to fuel their grueling workouts and perform at their peak on game day.\nSo, what do professional athletes eat for breakfast?\nThe short answer: It depends. Brittany Dunn, a performance dietitian and chef for the Philadelphia Eagles, has found that what professional athletes eat varies widely among athletes and the sports they play.\n“I have worked with an athlete who prefers two boiled eggs with peanut butter toast and a coffee, an athlete who prefers an acai bowl and sauteed veggies, and an athlete who orders two breakfast sandwiches and tater tots,” she told HuffPost.\nAs far as macronutrients and micronutrients go, Dunn notes that all of these breakfasts deliver nutritional benefits to each athlete. “The contrasting characteristics of athlete breakfasts are heavily influenced by personal preferences and diets, the amount of time between eating and the following training session, body composition and sport,” she said.\nCome game day, race day or competition day, athletes don’t take any chances with their breakfast. Consistency is the name of the game, and the last thing a professional athlete needs is an upset stomach. “What I’ve found is that many athletes have an established game day meal plan,” Dunn said. In her experience, most athletes eat the same breakfast before every competition. “Game day is not the day to try new foods,” she said. Additionally, having a consistent breakfast routine can help professional athletes feel more mentally prepared for the day ahead.\nAs for general caloric needs, professional athletes need to consume more than the average person given the amount of energy they’re using in their respective sports, and to help with recovery. Dunn said that while she hasn’t directly worked with an athlete with a diet quite as astonishing as Michael Phelps’ (who is rumored to have consumed 12,000 calories a day when training), she has worked with an athlete who required a 1,000-calorie recovery smoothie post-training, plus three to four additional meals throughout the day. “The goal here was for the athlete to maintain body composition and provide fuel to support training and energy needs,” she said.\nHow do the diets of professional athletes compare to that of an everyday person?\nGiven the higher caloric needs of professional athletes, it’s not uncommon for them to consume five, six or even eight meals a day, with a mix of full meals, shakes and snacks. Since they need to consume so many calories (particularly carbs), professional athletes get a bit of a pass as far as simple sugars go, as they’re easier to digest.\n“We really need to put a lot of fuel into athletes, so we might give them things like juice or even candy to make them feel more hungry,” Dr. Marc Bubbs, a performance nutritionist with a portfolio of professional and Olympic athletes and the author of “Peak 40,” told HuffPost. “For the general population, we don’t want them eating these foods that make them hungry more often or that have a lot of energy density to them.”\nBubbs explained that the more intense your exercise, the greater your reliance on carbohydrates, so professional athletes simply need more carbohydrates in their system. “It’s a bit like a fire: If you have a really hot fire, you can put all sorts of logs on there and the fire is still going to burn really well and stay hot, kind of like the metabolism and the exercise and activity of athletes,” he said. But put too many logs on the fire and the fire goes out, similar to when an average person consumes more calories than they need, which eventually leads to weight gain, high blood sugar and inflammation. The male athletes he’s worked with need about 4,000 calories a day while the general recommendation for the average person is around 2,000 calories per day.\n“The total calories depend on the energy demands of the sport,” Bubbs said. “A cyclist or swimmer may need 6,000 to 8,000 calories per day (due to the high volume of training), while team sport athletes like basketball and soccer will land between 3,500 and 5,000 calories (which will vary depending on the demands of the day).” He added that since women are, in general, smaller and lighter, they would most likely (but not always) require fewer calories.\nWhile the average person might make a smoothie for breakfast with water, protein powder and berries, a professional athlete might substitute fruit juice for the water and add mangoes, pineapples and bananas to up the carb content. Another example Bubbs gave was a bowl of plain yogurt with berries and nuts, which makes for a solid breakfast for the average person (not too many carbs or fats, and plenty of protein). To up the carb content, a professional athlete might add sliced banana, muesli and maple syrup. The key concept here, Bubbs explained, is carbohydrate periodization: fueling for the demands of an athlete each day, whether that’s competition, practice or even rest.\nIn crafting meal plans for her clients, Dunn’s primary goal is to ensure that she’s providing proper calories and appropriate nutrients specific to the athlete’s needs and sport. In doing this, she takes into consideration which foods fit into any dietary restrictions and preferences the athletes have. It’s important that the athletes actually like what they’re eating so that they finish their meals and get the fuel they need to perform.\nThe breakfasts of professional athletes are, by necessity, more consistent than those of an average person as far as consumption, timing and nutritional content go. Skipping breakfast is a fairly inconsequential choice for the average person headed to their desk job, but for an athlete headed to an intense workout that lasts several hours, skipping breakfast can lead to disastrous results. “One of the biggest differences is that my work with professional athletes can be a lot more meticulous, as I am typically more involved with them on a daily basis, with access to the frequent labs and body composition analysis, to make necessary adjustments along the way,” Dunn said.\nExpert-approved breakfast recommendations for active people\nFor the active person who isn’t a professional athlete, there are some general guidelines to follow to help fuel your workouts and help achieve your health and fitness goals. Dunn recommends ensuring that your breakfast includes healthy fats, protein and complex, fiber-filled carbohydrates. “These nutrients not only support muscle, combat inflammation and aid in vitamins and mineral absorption, but they also help maintain a feeling of satiety until the next mealtime.”\nSome specific breakfast options she recommends are yogurt with granola and berries, whole-grain cereal with fruit toppings and milk or a protein-packed milk substitute, oatmeal with nut butter and fruit, cottage cheese and whole-grain toast, a veggie omelet with toast, and a waffle with nut butter and milk.\nBubbs recommends starting with protein when building your meal, with at least 20 grams of protein for active individuals. “Breakfast is the meal of the day that people typically get the least amount of protein, so that should be the main focus,” he said. He said 30 to 40 grams of protein per meal for men and 20 to 30 grams of protein per meal for women are ideal amounts to hit. This number will vary for individuals based on their activity level and body weight. For reference, the Academy of Nutrition and Dietetics recommends 1.2 to 2.0 grams of protein per kilogram of body weight per day for active individuals.\nNext up is carbohydrates, which Bubbs recommends decreasing for individuals looking to lose weight or improve their blood sugar. “Have more berries rather than bananas, and have a slice of bread rather than three or four,” he said. Last is fats. Again, if you’re trying to lose weight, this is an area you can be conservative with: a drizzle of olive oil or a quarter or half of an avocado.\nIf you’re the type of person to get a morning workout in, Bubbs’ recommendation differs depending on the type of workout you’re doing. For an aerobic workout, he recommends fasting or having a low-carb breakfast, but for an intense training session he recommends eating a full breakfast beforehand with sufficient carbohydrates. “If you’re training hard, make sure you have enough fuel on board,” he said.",
    "https://www.huffpost.com/entry/diet-exercise-fitness-mistakes-certified-health-coach_n_62372160e4b0f1e82c4afab2": "“Your assignment from your health coach is to eat a pint of ice cream every night before bed.”\nEven as the words came out, I knew how absurd they seemed. But this was not an attempt at reverse psychology. It was an invitation to experience ice cream for what it is — to explore the pros and cons of a sizable nightly dose of sugar and cream.\nA health coach is not a therapist, and a well-trained one offers concrete guidance only when asked, in response to a client’s needs. This particular client was already eating a pint of ice cream most nights. She loved the nightly indulgence but hated the long-term impact on her health. She felt stuck and was pushing for solutions.\nAs a Mayo Clinic- and National Board-certified health coach, I work with people who are stuck in habits they’d rather lose and are interested in building new ones.\n“The whole pint, every night, until we meet again,” I said. “Take note of the effects in the moment and after. If you do that, we can get a clear, guilt-free assessment of how it feels.”\nMy client was embroiled in a classic struggle: Wake up with all the “best” intentions and set a bunch of rules for how to get through the day and night. Decide in advance how much to eat (and when) and what calisthenics to perform. Grow frustrated as the day wears on, abandon the goals in exchange for promises of tomorrow, heavily indulge in anticipation of upcoming deprivation, and sleep fitfully before doing it all again the next day.\nTo be clear, this was not an eating disorder by her own or any doctor’s assessment. Unlike binge eating disorder — which is a clinical diagnosis characterized by shame, hiding food, eating excessive amounts in short periods of time, and withdrawing from friends and meaningful activities to allow for binging — this was a rut, paved with rocky road. (If you are struggling with symptoms of BED or any other eating disorder, you can find help through the National Eating Disorders Association.)\nMy client wanted an escape hatch from the nauseating carnival ride of diet culture. She wanted to be healthy, functional and confident in her body. She also hoped ice cream could continue to be part of her life.\n“My client wanted an escape hatch from the nauseating carnival ride of diet culture.”\nThe traditional way to “get healthy” in the United States over the last century has been to exert control — to set and comply with rules that are purported to help achieve this elusive goal. The problem with that is two-fold: (1) life is stressful and triggering, and (2) most people don’t like being controlled, even by their own rules. They want autonomy, to make their own decisions on their own time and to deal with stress however they see fit.\nA “bad” habit is just a coping mechanism. And for those of us lucky enough to have stable jobs in relatively peaceful, developed countries, food is one of the most reliable “quick fixes” there is. It delivers an accessible, easy hit of pleasure — consequences be damned.\nTrying to banish soothing balms in a blaze of chronic stress is a recipe for frustration and failure, even if those balms don’t feel so good in the long run.\nWe’ve been told: Stop eating late at night. Cut out all your favorite foods. You’re lazy if you don’t work out, and God forbid you simply don’t like to cook. You need to control yourself! Send in the self-care apps, trackers, diets and fitness plans that will transform you into a “better” person.\nIf I could fossilize any word on the self-help landscape and shatter it with the power of Medusa’s snakes hissing wildly atop my head, it would be the word CONTROL. “Self-care” that feels more like prison than a step toward freedom is bound to send you ricocheting blindly back to your old “bad” habits.\nWe don’t need control. We need relief. How we find it is as unique as we are.\nWhen I started out as a personal trainer many years ago, I was broken-hearted over an ex-boyfriend. I worked out aggressively every day to render my heart shatterproof. I dragged myself out of bed and raged at the gym for an hour each morning before plunking down behind a desk at my temp job.\nPounding his memory out of my body felt like a relief, but, as time passed, the routine began to feel like a trap. He owned my mornings, even after he was gone. The habit served its purpose at first, but, eventually, I was faced with a choice: stick with a tired routine, give up and feel like a failure, or honor the situation for what it was and move on to something new.\nI chose the latter and went hiking instead.\nThrough all of this, I was stuffing myself at night: bowls of homemade cookie dough and large pizzas for one. The food felt like a different kind of relief, and I discovered that no good ever came of trying to “control” myself. It sent me into a deprivation mindset where I generally ended up swinging from the ceiling fan with a box of Krispy Kreme howling, “Oh yeah? How do you like this, Buzzkill?”\nAgain, I was faced with a choice: I could keep eating reactively and hating myself for it, keep stuffing myself and enjoy the comfort, or start exploring alternative ways to get that nightly relief.\nI couldn’t decide. I knew I didn’t want to hate myself, but the other two choices left me stumped. Was the food making me feel good enough to justify the pain of acid reflux and bloating? It was a definite maybe. I really did love the high of a sheet cake and a fork (and still do). But what if there were other ways to feel just as good at night, if not better?\nI needed to investigate, and in order to investigate, I needed to eat — on purpose, judgment-free, with curiosity — to root into the old habits for a while (and play around with new ones) to figure out what “good” and “bad” actually felt like. I was eating that way anyway, so I might as well find out precisely how a bowl of cookie dough and a large pizza felt in my body.\nTurns out, it felt uncomfortable to be so full at night. It messed with my sleep. It didn’t feel great to abuse myself at the gym in the name of an absent ex-boyfriend, either. These truths are now self-evident.\nMeanwhile, my clients faced all kinds of health challenges. I had folks with kids and folks with none. I had attorneys, gardeners and designers, and they all wanted to know the same thing: How can I change my bad habits, and why is changing so hard? They wanted me to provide the answers, but I was a 26-year-old personal trainer with a volatile relationship with food. I didn’t have answers yet, but I was hellbent on finding them.\nOver the following 20 years of health coaching and personal training, what I found is that prescribed diet and fitness plans breed rebellion in most people, but it’s often a quiet rebellion. If I created a plan for them, they didn’t tell me not to bother. They took it home and printed it out. They dutifully stuck it on the fridge or the bathroom mirror. They blamed themselves for not following through, but — at the end of a long day — my well-intended directions didn’t hold any relevance for them. Relief did.\nPeople tell me about the things they’re doing “wrong” all the time. They imagine taking command of their bodies and impulses is the only way to change, but when I ask what they’re looking to achieve, the answer is usually about freedom — freedom from dieting, from procrastination, low body image, discomfort, or physical aches and pains.\nIn my professional experience, control doesn’t lead to freedom.\nRules can certainly offer relief, but only if they’re established to fill a need. They can serve as a kind of scaffolding to feed cravings for new healthy habits, but the decision to follow any rule has to be made again and again, day after day. If it feels like a chore, what are your odds of following through? Rules are infinitely easier to follow when they serve up a hit of pleasure or relief.\nDestructive habits aren’t personal failures. They make evolutionary sense. People return to activities that have eased stress or suffering in the past. Research on behavior change is complex, but, to start, it shows the most effective way to change is to:\ngather evidence about what matters to you and why (in other words, identify what fuels your motivation) and\ncreate conditions for easy access to the new choice.\nWe need visceral, dependable, unbiased data to determine which routines enrich our quality of life — and which ones detract from it — and convenient, alluring alternatives. The most trustworthy place to find that data is in the habits themselves. They have a lot to teach us, but we can’t receive the messages while silencing them and demonizing ourselves.\n“If it feels like a chore, what are your odds of following through? Rules are infinitely easier to follow when they serve up a hit of pleasure or relief.”\nWhen my client came back a week after receiving her ice cream assignment, she was full of apologies. She had failed to complete the mission. Knowing another pint of ice cream was coming the next night, she found herself satisfied with a half or third of a pint. She let her body do the talking and discovered she did, in fact, like ice cream, but not as fanatically as she thought. When she figured that out, the battle fizzled — the one over ice cream, anyway. She had robbed it of its fuel.\nMost folks I work with want to maintain flexibility or pleasure in their lives, so we start by identifying what pleasure actually means for them. In the case of this client, a whole pint wasn’t it.\nShe set aside “control” and put herself in a position of power to choose — “good” things, “bad” things, or whatever things made her feel well. She didn’t have to comply with declarations she made the day before or pretend she knew in advance what choice she would make tomorrow. Without the threat of deprivation, the impulse to overindulge withered.\nBad habits can be good fun, until the repercussions add up to something worth changing. When that happens to me, I head straight back into the bad habit until the desire for something new is indisputable. From there, I go looking for relief and invariably find it in something a little kinder for my body.\nIt’s a scavenger hunt for satisfaction, and relief is just around the bend at the intersection of wellness and pleasure.\nIf you’re struggling with an eating disorder, call the National Eating Disorder Association hotline at 1-800-931-2237.\nSarah Hays Coomer is a Mayo Clinic and National Board Certified Health and Wellness Coach and author. She writes a biweekly column for Forbes Health called “Hey, Health Coach.” Sarah has spent nearly 20 years helping nonconformists build personalized systems to support their health and ease chronic stress. She has contributed to publications including Forbes, HuffPost, Triathlete Magazine, Utne Reader and Thrive Global. Her books include “The Habit Trip,” “Physical Disobedience,” and “Lightness of Body and Mind.” She lives in Nashville, Tennessee with her family and two rescue pups. You can find her at www.SarahHaysCoomer.com, Instagram @sarah.hays.coomer, or Twitter @sarahhayscoomer.\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch!\nIf you’re struggling with an eating disorder, call the National Eating Disorder Association hotline at 1-800-931-2237.",
    "https://www.huffpost.com/entry/full-fat-yogurt-better-than-low-fat_l_60bf952ee4b0427b3fdc15b9": "Have you ever eaten plain yogurt and thought that it tastes like sadness? That’s probably because it was of the low-fat variety ― or worse, nonfat. The fact of the matter is, plain yogurt made with whole milk tastes better. It has a richer mouthfeel and a creamier body that’s so much more enjoyable to spoon up.\nNot only that, it has nutritional advantages over low-fat yogurt.\nWhen it comes to plain (unflavored) yogurt, it’s important to know the main variations:\nAmerican-style plain whole-milk yogurt, made by brands like Stonyfield, which is about 120 calories and 6 grams of protein per 3/4 cup.\nWhole-milk Greek yogurt, also known as strained yogurt, made by brands like Fage and Chobani, which is typically 160 calories per 3/4 cup with a protein boost of 15 grams.\nThere’s also skyr, which is really more like a milk cheese, but eaten the same way as yogurt. It’s high in protein and low in sugar, but tends to have a smoother flavor than its yogurt cousins. You’ll find about 170 calories and 18 grams of protein in a 2/3-cup serving of whole milk skyr from Siggi’s.\nThe experts interviewed for this article told HuffPost they typically prefer the Greek and skyr variations of yogurt because they’re higher in protein. Here’s why you should eat full-fat yogurt, according to the experts.\n1. Full-fat yogurt tends to have less sugar\nFat wasn’t the enemy of American diets until about 1977. Around then, the government started pushing low-fat diets, which resulted in the mass manufacturing of low-fat products in the 1980s. The reason for this anti-fat craze was the belief that saturated fats were directly linked to heart disease. But newer research has shown that isn’t necessarily the case.\n“People often fear full-fat yogurt for its saturated fat content and risk for raising LDL cholesterol levels,” explained Rahaf Al Bochi, registered dietitian and owner of Olive Tree Nutrition. “However, research in this area is inconclusive and is evolving, with a body of evidence suggesting a protective effect of full-fat dairy on cardiovascular disease and diabetes risk.”\nSometimes, lower fat yogurts are higher in sugar to accommodate the low-fat taste, which leaves people feeling unsatisfied (and might result in them adding even more sugar), Al Bochi explained.\n2. Full-fat yogurt is less likely to spike your blood sugar\nWhen you eat plain full-fat yogurt instead of varieties that contain more sugar, like fruit-flavored ones, you’re less likely to experience a spike in blood sugar. “If you’re having flavored yogurt, it might spike your blood sugar more, which leads to more of a crash later on,” said Lauren Sharpe, a Philadelphia-based registered dietitian. Chobani’s raspberry yogurt, for example, has 9 grams of added sugar (a total of 13), compared with about 4 total grams of sugar in the company’s full-fat plain yogurt.\nWhen you crash after a blood sugar spike, you’re more likely to have cravings that make you want to grab the closest snacks. Instead of eating flavored yogurt, consider adding a drizzle of honey or some fresh fruit to plain yogurt.\nIt’s important to note, though, that even plain full-fat yogurt contains sugar. “You’re still going to get about 12 grams of naturally occurring lactose from one cup of milk, no matter what, whether that’s a cup of dairy, cup of yogurt, a cup of milk,” said Jaclyn London, head of nutrition and wellness of WW. You might not get fewer total grams of sugar, but you will get a lower percentage, which will help you feel full because it takes longer for your body to digest, absorb, and metabolize the sugar that you’re getting from dairy, said London.\n3. Full-fat yogurt will curb your appetite for longer\nAnother benefit of eating yogurt made with whole milk is that you’re more likely to feel full for longer than if you eat low-fat or nonfat yogurt. “A cup of plain Greek yogurt can give you up to 20 grams of protein per that 6-to 7-ounce serving. So you’re really going to get a lot of that filling benefit from the protein itself, not necessarily just from the fact that the combo of those two (fat and protein) together can help you feel fuller longer,” London said.\nYou’ll also feel more satisfied. Sharpe explained that anything can fill you up — for example, a bowl of spinach — but for something to have staying power it needs to be more nutritionally complete. “When we have the full-fat yogurt, there’s definitely more of that satisfaction factor, so that you’re not continuing to think about food all the time because you just feel obviously full from the fat and the protein that’s in the yogurt, but also you feel satisfied,” Sharpe said.\n4. It tastes better, and that matters!\nAs one researcher at Stanford University found, it may be easier to make nutritious food choices when you eat what tastes delicious. “Full-fat yogurt is rich, tasty, versatile and nutritious,” said Al Bochi.\nNutritionally, yogurt made with whole milk isn’t much different from plain low-fat or nonfat yogurt. They have about the same amount of protein and have probiotics. But the fat content in the whole-milk yogurt makes the eating experience go from droopy to wow, which may make you less likely to reach for the junk food later.\nFull-fat yogurt is also a great ingredient to use in recipes when you want added creaminess with a boost of protein. Use it in place of milk when you’re making macaroni and cheese (especially if you make boxed mac), or use it as a substitute for sour cream.",
    "https://www.huffpost.com/entry/worst-foods-for-cast-iron-skillet_l_6400bcd7e4b0bdb99f4a8c97": "The cast iron skillet enjoys a well-earned reputation as a kitchen workhorse. This tool is both reasonably priced and shockingly durable, as proven by the fact that cast iron skillets are regularly passed down through generations of home cooks. Another point in favor of the cast iron skillet comes in the form of its versatility: “With a well-seasoned cast iron skillet, you can cook nearly everything,” said Tiffany Swan, a trained chef, food scientist and recipe developer behind Salt + Sage.\nBut that “nearly” is doing some heavy lifting, because there are, without question, dishes that aren’t well-suited to this particular type of pan. We asked a group of professional chefs and food scientists to share the foods that they’d never cook in cast iron, and they provided this list of eight dishes to avoid.\nTomato Sauce\nOur consulted chefs largely agreed that acidic foods don’t interact positively with unenameled cast iron, and they cited tomato sauce ― like marinara sauce, Bolognese sauce or shakshuka sauce ― as a prime example of an acidic dish that can wear down cast iron. Bryan Quoc Le, a food scientist and author, explained that “the acidity found in tomatoes is high enough to extract the iron from the cast iron.” Tomatoes naturally include a high amount of citric acid (up to 9% of their body weight, according to Le), and “since the cast iron is bare and not alloyed with chromium, the surface will continue to oxidize and be stripped of the surface iron in the presence of tomato-based dishes,” he said.\nThe risk of iron particles leeching into your sauce is really only relevant if you’re making “a long-simmered tomato sauce,” as brief contact with tomatoes won’t release enough acid to affect the pan’s surface, Swan noted. Also, the damage caused by the iron particles in the sauce is primarily flavor-related ― the leeching “is minimal enough that you don’t need to worry about iron poisoning or ruining the seasoning of the pan,” she said.\nDishes With Wine-Based Sauces, Like Chicken Piccata Or Coq Au Vin\nAnother example of an acidic dish that can react to cast iron, chicken piccata (breaded chicken cooked in lemon sauce) thrives in a pan with an enameled surface that won’t have an impact on its finished flavor. The lemon itself can leech iron from the pan (much as tomato acid can). And another problem arises when you deglaze the pan with white wine, as many chicken piccata recipes require.\n“If you’re making chicken piccata and [plan to] make the sauce by deglazing the pan with wine, I would not recommend using cast iron,” suggested Jeff Carter, the executive chef of Dancing Bear Appalachian Bistro in Townsend, Tennessee. “The cast iron will release flavors or seasonings into your white wine deglazing sauce and give it an off-putting flavor. If you must deglaze a cast iron pan, use stock or water ― never use acidic liquids like wine or vinegar.”\nThe same goes for coq au vin. Deglazing a cast iron pan with wine isn’t a great move, so it stands to reason that any “wine-heavy stews, sauces or braises” also don’t thrive in cast iron, said professionally-trained chef and culinary educator Micole Rondinone. A dish like coq au vin, which involves chicken slow-braised in wine with mushrooms, pork lardons and vegetables, could be a victim of the wine’s acidity pulling iron flavor from the skillet. Stick with an enameled Dutch oven or a deep enameled skillet for wine braises.\nAdobo\nAccording to chef Kevin Truong of Fil N’ Viet in Austin, Texas, adobo, “a popular Filipino dish where meat or seafood is marinated in vinegar, soy sauce, garlic and other spices,” shouldn’t be prepared in a cast iron skillet, mainly because of the vinegar. “The high acidity of adobo from the vinegar will impart a metallic flavor in the dish,” Truong said. Because the vinegar’s acidity is so high, cooking a vinegar-based sauce in cast iron “could also mean you would have to re-season your cast iron skillet,” he added.\nBrothy Beans\nBoiling and simmering broth, water or other liquids in a seasoned cast iron skillet “will strip the pan of that nice patina and loosen the beautiful seasoning that you have achieved,” said Gee Cuyugan, executive chef of Mercat a la Planxa in Chicago. If you’d like to skip the long process of re-seasoning your skillet, cook your brothy recipes in enameled or stainless steel pots.\nCaramel\nIf you’re making your own caramel sauce, keep in mind that caramel can easily absorb flavors ― and because most cast iron users don’t thoroughly scrub their pans with soap after each use (as rigorous cleaning can remove the pan’s seasoning), cast iron skillets are a poor choice for caramel-making.\n“Caramel sauce will pull in the flavor or seasoning from your cast iron, making your dessert taste like the dishes made in your cast iron in the past,” Carter warned.\nFlaky Fish\nCompared to nonstick pans and other lighter-weight cookware items, cast iron doesn’t conduct heat with great efficiency. That’s why Los Angeles-based chef Kai Chase chooses to avoid cast iron when cooking delicate, flaky fish like cod, sea bass, flounder and salmon.\n“Flaky fish, such as salmon or flounder, are too delicate to cook in the cast iron skillet because it’s a poor conductor of heat, unlike its nonstick counterpart,” she said. “To cook a salmon filet, you need a pan that provides high heat transfer so the fish doesn’t stick and break apart when you try to flip it ― a cast iron skillet can’t do that.”\nCrepes\n“For crepes, you need to be able to quickly and easily tilt the pan to be sure the batter/egg covers the pan’s surface easily. That’s really hard to do with a heavy cast iron skillet,” explained Lisa Steele, author of the Fresh Eggs Daily Cookbook. “They’re too heavy for me (and I would guess most people!) to lift with one hand and tilt to flip the food. Cast iron is nice to cook in generally because it retains heat so well, but this can also lead to overcooking or over-browning on crepes since they’re so thin.”\nOmelets\nOn the topic of delicate dishes, “egg-based items like fried eggs and omelets are often difficult to cook correctly in cast iron,” said chef/instructor Stephen Chavez of the Institute of Culinary Education.\nSteele agreed that omelets don’t make sense in cast iron. “Eggs in general tend to stick in cast iron, no matter how much butter or oil you use,” she explained. “A good steel pan or an enameled skillet are both far better choices for omelets. You also want a very shallow pan with sloped sides so you can slide your spatula under to flip and/or fold the sides. But mostly, lifting the pan over and over to [flip an omelet] would be very tiring with a heavy cast iron pan.”\nNeed a new cast iron skillet? Here are our favorites.\nHuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change.",
    "https://www.huffpost.com/entry/best-worst-yogurt-health_l_6408c5bbe4b0c62918e02303": "Yogurt is loaded with good-for-you properties, like probiotics and calcium (good for gut health and bone density!) and the ability to keep us full for a while (great for weight loss or maintenance!). But a trip down the dairy aisle of your local grocery store can be an overwhelming experience because, well, there are a lot of yogurt options to choose from. And they’re not all exactly healthy.\nNutritionists will be the first to tell you that not all yogurts are created equal. Some will deliver a healthy dose of probiotics, fat and protein, while others are straight-up sugar bombs and deliver next to no health benefits.\nTo get a clearer picture, we asked dietitians to name the best and worst yogurts at the grocery store. These were their picks.\nThis yogurt is low in saturated fat, contains no added sugar and is an excellent source of protein, according to Mary Wirtz, a registered dietitian and consultant for Mom Loves Best. She recommends the 0% fat option. “It’s also organic and non-GMO project verified,” she said. “Topping this Greek yogurt with a drizzle of raw honey, berries and slivered almonds is a fantastic protein-rich breakfast to include regularly.”\n“This yogurt is very high in saturated fat and also contains 23g of sugar (15g of added sugars) per 1 cup serving,” Wirtz said. “Unfortunately, that is more sugar than five Oreo cookies.”\nThis yogurt contains 15 grams of protein, 0 grams of added sugar, simple ingredients and is made from the milk of grass-fed cows, making it a great option, according to Tamar Samuels, a registered dietitian and the co-founder of Culina Health. “It has a tart taste, but we love adding toppings like fresh fruit, chopped nuts, raw oats, and one to two teaspoons of honey or all-natural maple syrup for sweetness and texture,” Samuels said.\nWorst: Dannon Fruit On The Bottom\n“This yogurt has around 20 grams of sugar depending on the flavor, and sugar is listed second on the ingredient list,” Samuels said. “This product also has several additives and preservatives, including modified food starch and carrageenan.”\nBest: Fage Greek Yogurt\nMade without any preservatives or artificial sweeteners or flavors, Fage Greek yogurt is a favorite of registered dietitian Karina Tolentino. She especially loves the 2% Total Split Cup with the fruit separated out on one side (the strawberry flavor is a great option), so you don’t have to add all of it. “It has a smooth and creamy taste that is not tart, gives 12 grams of protein, and is not high in sugar,” she said.\nWhile registered dietitian Stephanie Csaszar loves the idea of non-dairy yogurts, she said you should probably skip the So Delicious Vanilla Coconutmilk Yogurt. “It has next to no protein (less than 1 gram per 3/4-cup serving), only 2 grams of fiber, and too many added sugars at 17 grams ― that’s over 4 teaspoons of sugar!” she said.\nDan Gallagher, a registered dietitian with Aegle Nutrition, said Siggi’s skyr, with a whopping 18 grams of protein and 0 grams of added sugar in the plain option (and just 7 grams of added sugar in the flavored ones) can be a great pick if you’re trying to lose weight. That’s true of even the higher-fat options. “It has a high protein content and low caloric content,” he said. “Icelandic yogurt also tends to contain far less sugar than many Greek yogurts, which means it will be filling and help curb appetite for longer.”\nWorst: Yoplait Whips\nWhen shopping for yogurt, Gallagher said people should skip the Yoplait Whips. “These yogurts are packed full of calories and sugar and they actually contain a smaller serving of yogurt than the average amount, so they certainly won’t help curb cravings,” he said.\nBest: Any Skyr-Style Yogurt\nSkyr, which has up to 17 grams of protein and 0 grams of added sugar for plain flavors, is always a great pick, according to Jen Scheinman, registered dietitian and nutrition affairs manager of Timeline Nutrition. And while Siggi’s gets a lot of hype, there are plenty of other skyr-style yogurts out there, including Thor’s Skyr or Icelandic Provisions. “This is a style of yogurt from Iceland, and it’s much higher in protein than regular yogurt and has even more protein than Greek yogurt,” she said.\nWorst: YoCrunch\nScheinman steers clear of the YoCrunch line of yogurts. “They add candy and cookies as toppers to yogurt, turning a highly nutritious food into a dessert,” she said. “There’s little protein and a lot of added sugar in this brand, which takes away from all the great health benefits of yogurt. These yogurts could be part of a healthy diet if used as dessert, but most people I’ve worked with use them instead of a healthier yogurt option for breakfast or snacks.”\nIf you’re looking for a plant-based yogurt option that’s good for you, registered dietitian Anna Kalfayan suggested Siggi’s plant-based coconut blend, specifically the mixed berry flavor, which has 10 grams of protein and just 7 grams of added sugar. “It’s high in protein and low in added sugar,” she said.\nWorst: Noosa Yoghurt\nAlthough delicious, Noosa yogurts are often high in sugar ― the blueberry flavor, for example, has 31 grams of sugar, 18 gram of which are added sugar. “When a yogurt has 20 grams or more of sugar, you have to ask yourself: Is this really necessary?” Kalfayan said.\nThe Bottom Line\nWhile there’s no question that some yogurts are better for you than others, it’s important to remember that it’s OK to have a little bit of everything in moderation. Just don’t fool yourself into thinking you’re having a healthy meal when you’re really loading up your breakfast bowl with sugar.",
    "https://www.huffpost.com/entry/what-are-ultra-processed-foods_l_64186cdce4b0cfde25c60853": "You’ve likely heard health experts say that eating whole foods and skipping processed foods is a key to optimal health. A December 2022 study, for example, presented a pretty scary statistic linking ultra-processed foods to cognitive decline, saying that people who ate more than 20% of their daily calories from processed foods had a 28% faster decline in global cognition and a 25% faster decline in executive functioning, compared with people who ate less than 20%.\nIf you’re wondering what an “ultra-processed” food is, you’re not alone. It’s a complicated topic.\nMost foods are at least minimally processed — usually for preservation or safety reasons — so completely staying away from all processed foods can be difficult, if not impossible. It’s also unnecessary.\n“Processed food tends to get a negative reputation, but there are many minimally processed foods that are actually good for us,” Ashlee Wright, a registered dietitian at Orlando Health, told HuffPost. “If we think about foods, like baby carrots, nuts, chicken and fish, these have to be processed in some way, but they only have one ingredient.”\nAt the other end of the processed foods spectrum are ultra-processed foods, like frozen meals, doughnuts, cookies and candy. These typically contain dozens of ingredients, many of which you’ve never heard of and can’t pronounce. These are the items nutritionists suggest limiting.\nStill, nutritionists acknowledge that understanding the difference between processed and ultra-processed foods is difficult. Here are some tips to help you sort them out.\nMost foods are processed, at least somewhat\n“Just about all food needs to be processed to eat it, so this can be so confusing,” said Colleen Tewksbury, a spokesperson for the Academy of Nutrition and Dietetics.\nThe healthiness of processed foods usually comes down to other ingredients, like sugar or salt, that are added during processing. The U.S. Department of Agriculture defines processed foods as those that have undergone changes to their natural state. So, it’s any raw agricultural commodity that’s been milled, cut, chopped, cooked, frozen, dehydrated or canned.\n“Many foods that people think of as whole foods technically are minimally processed, like frozen fruits or vegetables, or those bags of pre-cut veggies at the grocery store,” said Kristine Dilley, a registered dietitian at The Ohio State University Wexner Medical Center.\nProcessing techniques, like pasteurization, canning or dehydrating, also make foods safer to store and ensure they keep for longer periods of time, Dilley said.\nHow to understand the different kinds of processed foods\nNot all processed foods are created equal. One way to explain the different levels of processed foods is the NOVA food classification system, developed by researchers at the University of Sao Paulo, Brazil. The system has four categories:\nGroup 1: Unprocessed or minimally processed foods. This refers to fruits, vegetables, seeds, eggs, fungi or milk that are consumed in their natural state or altered to remove inedible or unwanted parts, like stems or shells. The foods might be dried, filtered, roasted, frozen or packaged to preserve their natural state, store them or make them more palatable.\nGroup 2: Processed culinary ingredients. These items are derived from Group 1 or nature, and include oils, butter, lard, sugar and salt. They’re usually used to prepare Group 1 foods and are rarely consumed on their own.\nGroup 3: Processed foods. These foods are produced by adding items, like salt, sugar, or oil (Group 2 items) to Group 1 foods. Examples include pickles, canned fish, cheese, canned fruits or vegetables, bacon or fresh bread. The foods usually retain their basic identity and some original characteristics.\nGroup 4: Ultra-processed foods. These items are created by industrial processes, like hydrogenation or adding emulsifiers, artificial colors, artificial flavors or preservatives. They include prepared meat, pasta or pizza; packaged bread, cookies or cakes; and soft drinks, candy, chicken nuggets or fast food. Ultra-processed foods tend to be highly palatable, inexpensive, convenient and contain multiple ingredients.\nOne issue with the NOVA system, Dilley said, is that it attempts to define the healthiness of foods in broad categories based on ingredients added during processing, which can be confusing for people. It also may inadvertently fuel the concept of “good” versus “bad” foods.\n“This may be harmful to individuals who struggle with balanced eating or eating disorders, and may lead to an over-restrictive food intake,” Dilley said.\nShould you limit ultra-processed foods?\nMany ultra-processed foods are convenient and inexpensive, compared to some whole foods, so avoiding them is difficult for most people, Dilley said. Plus, there’s nothing wrong with enjoying sweets or soft drinks sometimes.\nBut the more processed the food, the more likely it is to contain extra calories, salt and sugar.\nResearch has linked consuming high amounts of ultra-processed foods to obesity, diabetes, high blood pressure and dementia. And the previously mentioned 2022 study has linked ultra-processed foods to cognitive decline.\nIf you’re eating processed foods, but are paying attention to the number of calories you’re consuming overall, some ultra-processed foods may not be worrisome, Tewksbury said.\nTry sticking to the 80/20 rule, where you focus on eating unprocessed or minimally processed foods 80% of the time, Wright said.\n“Give yourself some grace and realize that it can be challenging to avoid ultra-processed foods completely,” Wright said.\nWhich processed foods are the healthiest to eat?\n“The simplest way to think about it is the fewer ingredients, the better,” Wright said. “If you start reading an ingredient list, and you can’t understand or even pronounce what’s in it, try not to eat it often.”\nChoosing healthy foods can be confusing, especially when labels say things like “all-natural” or “made with whole grains,” but contain a host of other ingredients that make them ultra-processed, Wright added.\nTo make sure you’re opting for the least-processed options most of the time:\n- Look for items with five ingredients or fewer (or ones with the shortest ingredient list).\n- Note the first ingredient listed — that’s what the item contains the most of (look for bread listing “whole grain” first rather than “enriched flour,” for example).\n- Avoid (or minimize) products with added sugar, saturated fat and a high sodium content (20% or more of your daily value of sodium per serving is considered high).\n- Choose foods that are as close to their natural state as possible.\n“I would encourage individuals to look at how often they are eating ultra-processed foods and in what quantity,” Dilley said. “Planning ahead for meals and snacks, and doing any amount of meal prep can help reduce how often these convenience foods are needed.”",
    "https://www.huffpost.com/entry/can-cooking-heal-grieving_l_641b6847e4b0fef152480851": "In Elizabeth Gilbert’s 2006 bestselling memoir “Eat, Pray, Love,” the author dives into the flavors that make up Italian cuisine to deal with the grief spurred by a divorce and a sedentary life.\nIn Nora Ephron’s beloved 2009 film “Julie & Julia,” Amy Adams’ character vows to cook all 524 recipes that make up Julia Childs’ iconic cookbook, “Mastering the Art of French Cooking,” in an effort to assuage the frustration she feels toward her job at a local call center.\nTaking on the role of successful restaurateur Jane Adler in Nancy Meyers’ 2009 rom-com “It’s Complicated,” Meryl Streep quite literally hides in the protagonist’s home kitchen and bakery when reflecting on (or avoiding) matters of the heart, all the while baking some truly delicious-looking treats on screen.\nFood-adjacent plotlines abound throughout Hollywood. In some cases, characters’ creative arcs and ability to overcome periods of agony and sorrow completely rely on their devotion and relationship to food. In “Burnt,” Bradley Cooper’s character dives into the culinary arts to assuage his drug addiction; “Eat Drink Man Woman,” the 1994 Ang Lee film, uses a family’s standing Sunday night dinner plans as a point of reflection when it comes to dealing with sorrow and joy throughout life’s up and downs.\nIt’s clear: thinking, talking and looking at food soothes our spirit. This human tendency was never as pronounced in modern history as it was during the COVID-19 pandemic, when folks constricted to the household turned to cooking and baking to pass the time and, perhaps, alleviate a general sense of sadness.\nThe trend should come as no surprise, as there have been countless research projects on the topic.\nCreative activities like cooking and baking are directly connected to an increased sense of well-being, according to a 2016 study by the University of Otago in New Zealand published in the Journal of Positive Psychology.\nResearchers asked 658 university students to keep a record of their activities and associated mental states over 13 days. After partaking in creative pursuits ― a common one among the subjects was cooking new recipes, according to a related study ― students reported feeling more enthusiasm and positive growth than usual, the researchers found.\n“The act of cooking and the ability to prepare food is in itself a sacred act,” said Dr. Sudhir Gadh, a board-certified psychiatrist with a private practice in New York. “It’s something you do carefully and with focus. You don’t do it while doing other things and you put care and love into it.”\nThe ability to focus entirely on the task at hand — one that requires attention to detail, including specific measurements and constant monitoring — allows us to easily block out distractions that may cause stress and anxiety throughout the day.\nOf course, the characterization is not solely relegated to the kitchen. But there’s something about the end result of cooking for oneself, from aromas to colors and flavors, that can deliver even more comfort than, say, crocheting or coloring.\n“I find that the more time you spend cooking, the more time you want to spend eating and appreciating all the hard work you’ve done,” said Sarah Wagner, a registered dietician with Memorial Hermann Health System in Houston. “That helps you to be more mindful, have less distractions and be more grateful for the moment.”\n“Many people find joy and calmness in baking, because it is very tactile and typically commands your full attention, primarily when you use repetitive motions with your hands,” Kimberly Lou, the author of “Becoming Who You’re Meant to Be,” told Fast Company in 2019.\nIn addition to its therapeutic effects, experts argue that eating food cooked by oneself will help our bodies function better on a biological level.\n“When you’re not feeling well and either don’t eat or eat fast foods, you’re not feeding the system that requires you to adjust its inflammation and therefore make the situation worse,” Gadh said. “If you cook, the food is generally more digestible and it will help the body instead of harming it.”\nWagner agreed, focusing on diet patterns over specific ingredients or foods. “I suggest eating the rainbow and getting a lot of colors in your diet,” she said. “Cooking with more whole ingredients is also important as it might lead you to use family recipes that will connect you to your ancestors and be good mood boosters.”\nDuring the pandemic, the dietician noticed the importance of using whole ingredients in the kitchen. “Some people were just snacking all day because they were home while others embraced whole foods and cooking and those were the people that lost weight and felt healthier,” she noted. “I wish people could indulge in that slower-paced lifestyle again just to enjoy things and the experience of eating more. Convenience and quickness generally outweigh healthiness and appreciation of the meal. I noticed with my peers and patients that a healthy relationship with food goes a lot further than a single ingredient would on your mood.”\nIn short: eat well, cook what you eat and don’t focus too much on a single dish. It’s all about the big picture.\nThose who thrive on specifics, though, should keep in mind that one of the most important aspects of staying healthy both mentally and physically involves the consumption of water, according to experts. “Water is very good for mood, cognitive performance and energy levels,” Wagner said. “A lot of clients don’t drink enough water but, once they start hydrating, they start to feel a lot better. When you’re dehydrated, you’re not going to work as efficiently.”\nGadh echoed those feelings, suggesting drinking three liters of water a day to stay in shape.\nAnother tip from the psychiatrist involves the actual act of eating.\n“We have to look at meals as a sacred time and a meditative moment of connection and peace,” he argued. “If you’re eating while watching TV, for example, it delegitimizes the importance of breaking bread. Every dinner should be candlelit, feature small amounts of wine and basically be a moment for you to remove yourself from the stimuli that you’re bombarded with all day.”",
    "https://www.huffpost.com/entry/lap-band-weight-loss-surgery_n_6452b9c8e4b02df749cead8c": "I was 16 when I first learned about the surgery. My mother told me she had heard of something that could help me. Something that could fix me.\nThe lap band surgery would place an adjustable ring around the top portion of my stomach, thus restricting the amount of food I could eat. The procedure was non-FDA-approved for adolescents but was being offered as a study for ages 13 to 17. The idea was the lap band would help me feel fuller faster and that I wouldn’t be categorized as a health risk any longer. That I would lose weight. That I would be normal.\n“I want it,” I told my mom, never so certain in my life. It felt right, like this was the answer I had been searching for. I was tired of dieting, wishing to lose weight every birthday and New Year’s, throwing out clothes that no longer fit every year. I wanted more than anything to not be the fat kid, not be bullied or ostracized, and to be able to live the life I had always dreamed about. And after I had the surgery, I didn’t tell anyone about it for over a decade.\nBefore the surgery, I thought about the weight I hadn’t lost, the weight I could never lose no matter how hard I tried — all the diets I had failed, all the promises to myself I had broken. I felt like a failure, but now, I would be redeemed. This surgery would be my miracle.\nAs a pre-operation requirement, I had to maintain a liquid diet for two weeks to shrink my liver to provide easier and safer access when performing the laparoscopic surgery. I found it nearly impossible to restrict food for that long, but I was desperate, and when you’re desperate, you find the strength to do things you never thought that you could.\nDuring those weeks, I brought a Slim Fast drink to school for lunch, careful to remove the label so that none of my classmates saw. I thought if I never addressed my problem body, it would be like it didn’t exist. If anyone asked me why I was drinking out of a no-brand can and not eating lunch, I told them it was a protein shake.\nI missed a week of my senior year in high school for the surgery, and I made up some excuse as to why I was absent and why I couldn’t participate in gym class for a month. It was easier this way. My surgery was a secret from everyone I knew.\nAt 17, I had been through almost every diet and exercise regime, only to see the number on the scale increase. People everywhere claimed that it only took the right diet, the right moment to change their lives. It was clear that if you were fat, you were broken. If you were fat, you needed to do something to change it.\nAfter the surgery, I started to lose weight without even trying. Halfway through a meal, I would become too full and have to stop eating or I’d get sick. But I would get sick, and often. When I went to restaurants with friends, I’d make up an excuse to go to the bathroom to vomit. I would pick at my food and shrug off comments about how little I was eating. I couldn’t eat certain foods, such as bread, and when offered any, I’d respond, “I just don’t like it.”\nBut although my body had changed, my relationship with food hadn’t. I didn’t know it at the time, but I had an underlying eating disorder that had persisted my whole life. I’d grown up not eating most of the day and eating large quantities at night, something not unusual for many Americans. However, this led to vomiting, a side effect of the lap band surgery, which contributed to my weight loss. In the years after the surgery, I continued to eat how I’d always eaten and live how I’d always lived: in a dysfunctional medical system in a dysfunctional society.\n“It was clear that if you were fat, you were broken. If you were fat, you needed to do something to change it.”\nAlthough I had finally achieved my dream of losing weight, I was still uncomfortable in my body. I knew I was thinner, but I wasn’t that thin. I didn’t look like the women I saw on TV and in movies. My body was changing faster than my self-perception, and the truth I now know is that no amount of weight loss would have ever made me happy with my body.\nBut people did treat me differently, and that mattered more than what I thought about myself. They took time to listen to me and not just stare at my size. I found that I made friends easier and was getting attention from men — something that had never happened before. I finally felt accepted.\nStill, I was terrified that someone would discover my secret — not just the surgery, but the history of my body, the fact that I grew up bigger. I painted scenarios in my mind of rejection and ridicule from my friends, from strangers, as if “fat” was a terminal diagnosis.\nUp until recently, my surgery had remained a secret. I was ashamed of my body, the one that made me an outcast, a target for abuse, and I didn’t want anyone to know about it. I didn’t want to draw any more attention to my body, to how I was different. I wanted to disappear into normalcy. Aside from my parents, no one knew.\nThe few times I was required to tell, usually to medical providers, I was almost always met with widened eyes and raised voices. “At 17?” I heard incredulous shock and judgment.\nI shrunk back into my body. They couldn’t believe my parents would do that to me. They couldn’t believe I was that bad as to require weight loss surgery. They looked at me differently, as if their perception of me had changed.\nBut they don’t know the whole story.\nIn my early 20s, I started experiencing side effects from the lap band surgery. After undergoing an upper endoscopy, I found out that I had gastritis, esophagitis and gastroesophageal reflux disease. I started wondering why and how this had happened. If the surgery was supposed to fix everything, then why was I having these medical problems?\nI discovered the terms “binge eating disorder” and “compulsive overeating,” diagnoses not incorporated into the Diagnostic and Statistical Manual of Mental Disorders until 2013, six years after my surgery. I learned that these pathologies were symptoms of much larger problems: trauma, family dynamics, generational abuse, societal neglect, mental illness. Everything I had been taught to believe had been wrong, and I now needed to unearth the truth.\nMy relationship with food was attributed to a lack of self-control, gluttony and moral weakness, but I would learn that the issues with my mental health were never addressed or even acknowledged. It was as if I went to the emergency room with a broken leg and the doctors put a cast on my arm. The wrong part of me was being treated — and by treated, I mean blamed.\nNot long after I learned all of this, I became hyperaware, obsessive, fearful of food and of my body. I began exhibiting what are seen as more “traditional” disordered eating behaviors, such as restricting and purging. And only then did people start to realize I had a problem.\n“This has nothing to do with my size. You cannot look at my body and know my story.”\nHere is the real story: I started gaining weight at an early age. Every professional looked at my body as something that needed to be fixed, and yet now, 15 years after my surgery, I understand the mistakes that were made.\nThe problem was never my body. My body was manifesting the problems with everything else in my life ― societal obsession with thinness, dysfunctional family environment, genetics, mental illness and more, as I would come to learn. It was complex, and our bodies hold all of these complexities.\nIn my mid-20s, I discovered how I ended up in this body and what had happened to me. I was able to finally take ownership of my body and of my story. I still have the lap band, but it is loosened and doesn’t affect me as it used to, and I can eat now without the same fears.\nThe side effects from the lap band — the inability to eat and vomiting — had exacerbated my eating disorder. But I’m in recovery now, which means that my mental health and my relationship with food and my body are more stable than they ever have been. This has nothing to do with my size. You cannot look at my body and know my story.\nWhen I was 17, I didn’t know any of this because I grew up in a world where only things on the surface mattered. I didn’t know what else to do to save myself from myself, so my family and I made a decision. We made a decision with the support of medical providers and current research to give me an opportunity to live a different story. We made a decision that, at 17, affected my life in ways I hadn’t predicted, but I knew at that point I was in a losing battle. The battle would eventually end once I discovered that the battle wasn’t one with the body, but with the mind. But the shame would linger.\nI have only just begun telling family, friends and co-workers about my surgery. And even after all these years, my breath still catches in my throat when I reveal my deepest secret, waiting for their reaction. Some people are surprised. Some are angry that I kept it a secret or that I would do that to my body, especially at such a young age. But most are receptive: The ones who truly matter to me don’t see me any differently than before. But having a “morbidly obese” childhood made me a victim in more ways than one, and so I had kept my surgery secret, as victims do.\nI wish I could say that 15 years after my surgery, this fear inside of me has disappeared, but I still have the urge to hide, to protect myself from the judgment and scrutiny of others and from myself. To keep my surgery secret. But shame lives in secrets, and I’m writing now to rid myself of shame, to seek understanding and compassion not only from others but from myself.\nAmy Scheiner has had writing featured in Slate, Blue Mesa Review, the Southampton Review and Longreads. She is currently seeking an agent for her memoir on eating disorders, generational trauma and body acceptance.\nIf you’re struggling with an eating disorder, call the National Eating Disorder Association hotline at 1-800-931-2237.\nDo you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch.",
    "https://www.huffpost.com/entry/raw-oyster-safety-vibrio_l_6464c7f8e4b056fd46d6c69b": "In a viral TikTok video with 2.2 million views, TikTok user @malamamaofficial opens a $1 Whole Foods bag of raw oysters, revealing a pea crab in one of the shells. “This is why it’s $1,” the TikTok user says as she digs into the oyster. “It’s a parasite crab!”\nAlthough pea crabs can be eaten with oysters, there might be a bigger concern found in your favorite seafood.\nIn a now-viral video made in response to the first one, Morticia, a microbiologist in Boise, Idaho, who worked on research under grants from the United States Department of Agriculture and the National Institutes of Health, shares the risks associated with eating oysters ― or any seafood ― as oceans get warmer as a result of climate change. One of the rising concerns Morticia (who asked to use a pseudonym because of digital safety) mentions is an increase in Vibrio vulnificus, a bacteria found in marine environments.\nVibrio vulnificus can make its way into the body through eating raw or uncooked seafood, or exposing a wound to seawater where the bacteria is found.\n“Oysters are especially susceptible because they are filter feeders, so this bacteria can travel through into the organism and just kind of get stuck in its tissue,” she says in the video. “You cannot tell if an oyster is contaminated with Vibrio bacteria by looking at it.”\nThe bacteria doesn’t make the oyster look, smell or taste any different, which makes it hard to tell you’ve been exposed to Vibrio until you start experiencing symptoms. Although rates of infection are low overall, oysters have the highest amount of seafood related deaths in the U.S.\n“If you are healthy and what we call ‘immunocompetent,’ which really just means your immune system is able to work properly and eliminate infections, your body will be able to clear the infection without a hospital visit or antibiotics. But in the context of a tissue infection or someone who already has a compromised immune system, these infections can quickly turn fatal,” Morticia told HuffPost. “This is where that high mortality rate we associate with Vibrio infections comes from.”\nThe most recent outbreak was in 2019, causing gastrointestinal illnesses linked to oysters imported from Mexico. (No deaths were reported.) Climate change ― which is causing a rise in sea temperature ― has caused an increase in bacteria in water, leading to more cases of the infection.\nWhile you may not need to stop eating fresh oysters entirely, there are still important factors to consider. We asked general physicians, microbiologists and seafood distributors about the risks of consuming the shellfish, symptoms of Vibrio infection and treatment options. Here’s what to know:\nSymptoms of Vibrio vulnificus include gastrointestinal problems and even sepsis.\nOysters are filter-feeders, so when bacteria attach to particles and other organisms in the water that then pass through the oyster, the shellfish can accumulate a concentration of bacteria up to 100 times that of surrounding waters. Since oysters are typically eaten raw, the infection risk is higher compared to eating cooked or boiled seafood.\nAs a result, there are an estimated 84,000 people in the U.S. who contract an infection from Vibrio every year. Timothy J. Sullivan, the national program leader at Animal Health and Aquaculture, a division of the USDA National Institute of Food and Agriculture, explained the differences between symptoms among healthy and immunocompromised people.\n“It typically results in mild GI distress with healthy individuals experiencing fever, chills, cramping, diarrhea or nausea within 48 hours of ingestion,” he said. “Mortality is extremely rare in healthy individuals, but for individuals with certain medical conditions, it can cause severe side effects.”\nImmunocompromised people are more vulnerable to infections, and since the immune system plays a role in defending the body from bacterial, fungal, parasitic and viral infections, this puts them at a higher risk for complications, one of which is sepsis.\nPrimary sepsis, or the body’s extreme response to an infection, appears in about 60% of Vibrio cases. People with certain illnesses ― including people with chronic liver disease, diabetes, cancer, renal disease, HIV or other immunocompromised conditions ― can more easily get sepsis, which can rapidly lead to tissue damage and organ failure if left untreated. Infections can progress rapidly when symptoms are severe. When gastrointestinal symptoms are completely absent — which happens in about 10 to 15% of people with the infection — cases of sepsis and death are minimal.\nIf you’re an oyster fan, there are ways to reduce your risk.\nAlmost all of Vibrio infections stem from eating raw or uncooked oysters. As a result, several regulations have been placed to reduce risk through sanitation. The National Shellfish Sanitation Program, recognized by the Food and Drug Administration, ensures that shellfish-producing states are following safety guidelines, including certification, handling and process procedures.\nHowever, harvesting regulations do not eliminate the risk of Vibrio. As a result, shellfish states are providing customers with warning about infection risk. You may be able to find these on seafood packaging and menus.\nChristina Z. (who asked to keep her full name private for her job), a third-generation seafood industry professional and a seafood wholesale distributor, told HuffPost that eating oysters, whether from a grocery store or a high-end restaurant, doesn’t change how the seafood is prepared. In a viral video she posted on TikTok, she shared that she would never eat raw shellfish.\n“As long as the oyster is eaten raw, the risk remains the same. Restaurants and grocery stores are both held to high standards to responsibly buy from reputable distributors and maintain the cold chain preventing any spoilage,” Christina said. “However, the preparation method to reduce the risk is key. Raw/uncooked oysters will always present the highest risk. If oysters are a must, opt for them steamed or baked.”\nIf you’re going to eat oysters, it’s important to take note as to how the shellfish was prepared and where it comes from.\n“Some safe seafood practices I would recommend is to buy most of your seafood flash frozen at sea if available,” Christina said. “This maintains the integrity and peak freshness of the seafood, kills any living parasites and prevents the conditions needed for bacterial growth after the catch. However, if you do buy fresh, make sure to buy from a reputable monger who can tell you when the seafood was caught, and consume within one to two days after your purchase.”\nAll coastal waters contain Vibrio bacteria. However, infections from Vibrio species are on the rise, and as mentioned, climate change can increase cases.\n“Most bacteria relevant for human disease love warmth, and they need it to proliferate. Vibrio already likes heat. It lives in warm, coastal seawater,” Morticia said. “As those waters get warmer because of a warming planet and climate change, they’re not going to only grow to higher numbers in that water, they’re also going to spread to new places as oceans that were once on the colder side become more temperate.”\nThere’s always a risk associated with eating raw oysters, Sullivan said. However, preventing consequences can start with preparation, knowing where your oysters come from, and recognizing symptoms of infection.",
    "https://www.huffpost.com/entry/farmers-market-worst-things_l_6418c1efe4b01ea5cd8fada1": "Farmers markets are a wonderful place to buy in-season fruits and vegetables, eggs, bakery items, honey and more. They also provide an opportunity to meet the people who grow or make your food — and a chance for you to accidentally annoy or offend them.\nSome customers may act differently at a farmers market than they would at a grocery store. Others might bring an attitude that can irritate vendors, or generally behave in a rude way.\nHuffPost spoke to market managers, farmers and vendors about some frustrating things that customers do. Here are the five biggest offenses they encounter.\nHaggling Over Prices\nShopping at the farmers markets lets you purchase directly from the people responsible for your food. This unique experience makes some customers feel like they can ask for discounts or negotiate the price — something you wouldn’t consider doing at the grocery store.\n“All of the vendors at the markets either grow or handmake what they are selling; time, effort and money go into that. It is not a flea market,” said Erin Mann, the owner of Erin’s Elderberries and a board member of the Virginia Farmers Market Association. “By haggling a vendor on pricing for something they made with their bare hands, you are not only devaluing the item itself, but the person who spent their time doing it.”\n“It’s upsetting when a customer, usually a tourist from another state, insists on negotiating a price for a wedge of cheese,” said Angela Miller, the founder and co-owner of Consider Bardwell Farm in Vermont. “Our cheeses are artisanal, handmade, cave-aged and very labor intensive. We try to price them fairly, commensurate with the quality and costs.”\nFarmers markets aren’t a place to haggle or ask for discounts. “Would someone argue the price of a $20 bottle of wine from a small vineyard?” Miller said.\n“At busy farmers markets, the visitor who blocks a pretty display just to take multiple selfies is costing that farmer sales.”\nSometimes customers don’t haggle or ask for discounts but simply grumble about costs.\n“When a customer gets out of their high-dollar car, walks up with a demeaning attitude and complains about the cost of the goods we are selling, this is irritating,” said Craig Schmidt, the owner of Shaded Grove Farm Market in Mississippi. “We try to overcome this by sharing about our production methods and explaining that the actual cost of cheap, commodity food is much, much higher than what you pay upfront.”\nThat’s not the only reason why buying directly from these farmers may seem more expensive. “Our food system often hides the true cost of food by subsidizing commodity producers with your tax dollars,” said Catt Fields White, the director of San Diego Markets in California. “Those benefits rarely extend to small farmers.”\nLetting Children Run Wild\nFarmers markets are a place for the whole family, but parents still need to keep an eye on their kids, just like they would anywhere else.\n“We love seeing families with children at farmers markets, but please keep your children in order,” Schmidt said. He recalled an incident in which one child was touching eggs at his stall and “soon the whole carton of eggs was scrambled on the sidewalk.”\n“We had to clean it up,” Schmidt said. “They didn’t pay for it, either.”\nJodie Kieliszewski, the founder of Bee Lovely Botanicals, also remembered times when parents lost track of their kids and items were damaged.\n“There was a small girl who was opening multiple lip balms, which are safety-sealed,” she said. “In a matter of a few moments, she ruined about $40 to $50 worth of product, as well as wiping colored lip balm all over our display.”\nBreaking Sampling Etiquette\nHaving the chance to sample foods before you purchase is one of the perks of shopping at a market. But if you know you have no interest in buying something or it’s not going to be part of your shopping budget that week, you may want to reconsider before enjoying all the samples on offer.\n“People [are sometimes] trying multiple cheese samples and then either walking away ... or saying that they would have to locate their spouse to get money, or also responding ‘Will you be here next week?’” Miller said. “These comments are disingenuous.”\nThere are also certain items that you should generally not sample, such as handmade soaps that shoppers may want to touch and smell.\n“People bring multiple bars of soaps to their faces,” said Erin Link, the owner of EB Ranch Farmstead in Wisconsin. She suggested that shoppers first “ask permission to pick things up and touch them.”\nSnapping Photos Of Products Without Buying Them\nIn the quest for a great Instagram photo, many people take pictures or videos of booths while others are trying to shop, which can interrupt sales. Some markets have created social media rules to thwart this.\n“We have a saying: ‘You tweet it, you eat it!’” White said.\nAt busy farmers markets, the visitor who blocks a pretty display just to take multiple selfies is costing that farmer sales,” she added. “Farmers need to sell what they’ve harvested for the day.”\n“By haggling a vendor on pricing for something they made with their bare hands, you are not only devaluing the item itself, but the person who spent their time doing it.”\nStill want to snap a photo or make a reel? Ask permission from the seller to record their stall or display. If they say yes, be sure not to block other patrons from shopping.\n“The considerate influencer is one that loads up a shopping bag after they use that lovely background to create an eye-catching post,” White said.\nArriving Before Opening Or After Closing\nFarmers markets have set hours, just like any retail store. The difference is, there isn’t a door that locks and unlocks.\n“When someone shows up early and asks to be sold to, that vendor has to stop what they are doing, find whatever that person is looking for or answer questions, and then also figure out how to promptly take payment,” Mann said. This can disrupt the setup process, which in turn may prevent vendors from attending to customers in a timely fashion once the market opens.\nThe same is true for coming to the market late or at closing.\n“Vendors have to be off the premises by a certain time,” Mann said. “When everything is packed up and you’re asking someone to undo 30 minutes of work, it can be construed as rude.”\nYour local grocer, clothing store or restaurant isn’t going to just let you come in whenever you want. So have the same respect for your vendors and allow them to put their best foot forward each week by giving them time to set up.",
    "https://www.huffpost.com/entry/best-foods-to-eat-for-covid-breakthrough_l_61f9a837e4b02136b6ed0887": "The rise of the COVID-19 omicron variant has resulted in many vaccinated and boosted people testing positive. And, as someone who contracted both the alpha variant (back in January 2021, before vaccinations were widely available) and the omicron variant this year, I can say firsthand that the COVID symptoms that I dealt with post-vax were far milder and shorter-term. Most notably, I was able to keep food down during my omicron outbreak (unlike the alpha experience, which left me constantly nauseated and unable to smell or taste what I was eating).\nThis felt like a massive relief, but when I went to place grocery delivery orders while quarantining, I did wonder whether there might be specific food items that could help boost my energy and ease my cold-like symptoms. This curiosity led me to consult some licensed nutritionists, who shared recommendations for seven food and drink items that can make breakthrough COVID easier to manage for people of all ages.\nVegetable Soup\nEven though my own personal experience with an omicron breakthrough didn’t involve nausea, an unsettled stomach is still a common COVID symptom. For that reason, it makes sense that easy-to-eat (and easy-to-digest) foods like vegetable soup were popular recommendations from our nutritionist sources.\n“Warm vegetable soup with a side of protein (like chicken or tofu) is my top choice because the vegetables will provide plenty of extra vitamins and minerals, which are especially essential in times of illness,” registered dietician Morgyn Clair said.\nAlso, “if someone is suffering from a sore throat or congestion, the warm fluids can help soothe these symptoms and help break up phlegm,” Clair explained. She advises the protein addition because it “supports healthy immune function, since all enzymes in the body are made up of proteins.”\nBone Broth\nAnother soup that makes a smart menu addition for those grappling with breakthrough COVID is bone broth (or, if you’re on a plant-based diet, vegan “bone broth”). Registered nutritionist Paula Doebrich told HuffPost that “most people experience poor appetite when they get COVID, so soup is an excellent way to get nutrients in. Making it with bone broth adds valuable nutrients, such as a higher protein content, calcium, magnesium, phosphorus, zinc, iron and other minerals. Many of these nutrients are needed for the immune system to function properly.”\nDr. Frank Lipman, chief medical officer of The Well in New York City, described bone broth as “hydrating, nutrient-rich and supportive [of] immunity.” It makes a great dietary addition for adults with COVID, he said, and is an easy form of sustenance for COVID-positive children who may find their appetites compromised by their illness.\n“The best thing you can do for your kids’ health is avoid feeding them processed, sugary foods that lead to systemic inflammation and compromise immune function,” Lipman said.\nBerries\nWhen looking for vitamin-rich foods to eat during a COVID infection, “go for berries, which are packed with antioxidants such as quercetin and vitamin C,” said registered dietician and certified dietician nutritionist Linda Altenburger of the Cornell Cooperative Extension of Suffolk County, New York. “ These are necessary to reduce inflammation and provide resistance to infection by boosting immunity.”\nBerries, explained Altenburger, “contain powerful antioxidants, called flavonoids, that are responsible for providing immune-boosting benefits.” Flavonoids can “reduce free radical formation and oxidative damage, and contain anti-viral properties.”\nWhile the scientific community is still studying the effect of flavonoids on COVID outbreaks, the National Institutes of Health says they’ve shown “promising evidence” against COVID, “thereby reducing severity of illness.”\nSo, go ahead and add blueberries, raspberries, strawberries or any other berry to your shopping list. They’re also crowd-pleasers with children, and work well when you’re trying to urge your COVID-positive child to eat.\nOatmeal\nOatmeal is an excellent source of fiber, which “helps nourish the good bacteria in our microbiome and [sends] anti-inflammatory and virus-fighting signals to the immune system,” according to owner, licensed nutritionist and head of research Shawn M. Talbott of Amare Wellness Center in Plymouth, Massachusetts. Plus, it’s easy to zhuzh up oatmeal in healthy (and kid-friendly) ways. Talbott recommends adding “a handful of blueberries and a scoop of whole-fat yogurt.”\nCitrus Fruits\nMany of the symptoms associated with breakthrough COVID infections resemble those of the common cold, from congestion to coughs to sore throats. Citrus fruits like lemons, limes, grapefruits and oranges are often recommended for cold patients.\n“They’re a great source of vitamin C, a helpful antioxidant commonly known to boost the immune system,” explained Jay Cowin, a registered nutritionist. “These same properties also make citrus fruits a wise choice for COVID patients. Vitamin C can also reduce and even prevent catching a cold; it may help fight off the infections faster and prevent any complications that these viruses might cause,”\nCowin pointed out that “citrus fruits are affordable, convenient and can easily be enjoyed by adults and kids. They can be eaten or drunk, making them easy to consume even with a sore throat. There’s no magic food that can completely protect us from any virus, but the best thing we can do is consume things that can help strengthen our immune system to fight off these diseases.”\nWild Salmon\nIf you (like me) find yourself with a decent appetite in spite of breakthrough COVID, then consider adding a heartier source of protein to your diet, like wild salmon. “Oily fish such as salmon are packed full of healthy fats,” said certified nutritionist Reda Elmardi. She noted that “omega-3 fish oil, which wild salmon contains, is a potent anti-inflammatory, which means it can play a key role in [treating] COVID cases, as has been shown in this study.”\nWater\nFor adults and children dealing with COVID, hydration proves crucially important. “Water performs many vital functions in the body,” explained registered dietician Lyndsay Hall. “Being even slightly dehydrated can lead to or make worse the feelings of fatigue often associated with breakthrough COVID-19 symptoms.”\nA fluid loss of just 1% to 3% can impact mental sharpness, focus and energy — all likely already compromised by a virus. Mancuso recommends “sipping on water throughout the day to keep you well-hydrated. If drinking water on its own is not up to your liking, try adding a slice of lemon for some zest. Tea performs a similar function to water.”\nIf your COVID-positive kids have trouble drinking water (or simply prefer sweeter or more flavorful beverages), try Pedialyte, which registered dietician Ricci-Lee Hotz describes as “helpful for children experiencing fever who are having difficulty drinking enough liquid.”",
    "https://www.huffpost.com/entry/healthy-pantry-staples_l_61d87348e4b0bcd2195ece16": "Having a well-stocked pantry can help you make healthier choices on weekdays, especially when dinnertime rolls around and you don’t already have a plan in place. Pantry staples can be used to supplement fresh fruits and vegetables you already have on hand, or serve as an alternative to frozen pizza and instant ramen.\nWhen buying canned beans, broths, vegetables and other shelf-stable foods, it’s worth taking a look at the nutritional labels, as these types of foods often have more salt and sugar than their fresh counterparts.\n“Definitely look at the sodium if you’re at risk for high blood pressure or have high blood pressure,” said Jonathan Valdez, owner of Genki Nutrition and spokesperson for New York State Academy of Nutrition and Dietetics. While the Dietary Guidelines for Americans recommend consuming under 2,300 milligrams of sodium per day (and no more than 2,000 milligrams of sodium per day for people with high blood pressure), Valdez told HuffPost that the average American consumes about 3,400 milligrams of sodium per day.\nIf you’re watching your sodium intake, look for low-, reduced- or no-sodium options if they’re available. In a similar vein, for canned fruits, experts recommend finding options in which the fruit is packed in its own juices or water (instead of syrup).\n“Looking at the ingredients list to see if anything has been added is the best place to look for this,” Meredith Price, a plant-based registered dietitian and co-founder of Plant-Fit Besties, told HuffPost.\nWe asked registered dietitians to share their go-to pantry staples and their favorite ways to use them. Below, we’ve rounded up their top picks.\nNutritional yeast\n“This is a must in any plant-based person’s kitchen,” Price said, noting that nutritional yeast is a great source of protein, fiber and B vitamins. Plus, it’s shelf-stable for up to two years and gives food a cheesy flavor.\n“It’s also low-FODMAP friendly, which is great for anyone with digestive issues, particularly IBS,” she said.\nPrice likes to sprinkle nutritional yeast over popcorn for a healthy snack, and she also uses it to make vegan macaroni and cheese (mixing cashews with nutritional yeast to make a creamy vegan sauce).\nDried lentils\nLentils are a great source of plant-based protein, fiber and iron, Price said, adding, “they’re a great meat substitute for many dishes.”\nDried lentils are the star ingredient of some of her favorite weeknight meals, including daal (lentil stew) and lentil curry, which she serves with rice. When cooking with pantry staples, Price tries to incorporate at least some kind of fresh produce, even if it’s just an onion.\n“I like to have some fresh vegetables on the side to make the meal more flavorful and nutritious, such as a side salad, sauteed kale or roasted carrots,” she said.\nWant specific recipes? Here’s how to turn a bag of lentils into three meals.\nRice\nRice is a great base for adding proteins and vegetables, and any leftovers you have can be made into fried rice the next day. Throw in an egg, chopped garlic and whatever vegetables you have wilting away in your fridge and thank us later — leftovers have never tasted this good.\n“It goes with practically every dish and has a very long shelf life,” Valdez said of the grain.\nAli Webster, director of research and nutrition communications at the International Food Information Council, is partial to brown rice because it’s a whole grain.\n“It’s higher in nutrients like fiber, manganese, magnesium and selenium compared to white rice,” Webster told HuffPost.\nCanned vegetables that aren’t in season\nIf fresh vegetables aren’t available, frozen is the next best option. And then after that, canned options are good to have on hand.\n“On the rare occasions that I can’t find the vegetables I’m looking for in the grocery store, I love to turn to canned corn for something that’s easy and microwavable, especially if corn is not in season,” Valdez said. He uses canned corn in ramen, on salads and more.\nCanned beans\nCanned beans add fiber and protein to soups and salads, Webster said, and they can also be blended into dips like hummus or paired with tortillas and other toppings for weeknight tacos.\n“The versatility of canned beans is unmatched,” she said.\nAt home, Webster and her family cook with a lot of pantry staples because they cut down on prep time and help get healthy meals on the table quickly. Unlike dried beans, which can take hours to soak and cook, canned beans can be heated up and added to dishes in minutes.\nNut butter\nWhether you like peanut butter, almond butter or some other type of nut butter, this is your reminder to stock up.\n“Nut butters are a source of protein and fiber, and they’re high in healthy fats,” Webster said. “They can be used for everything from toast to smoothies to sauces.”\nWebster likes using peanut butter to make peanut sauces for dipping vegetables into or as a complement for rice noodle dishes.",
    "https://www.huffpost.com/entry/plant-milk-makers_l_61f18620e4b094ce54a52501": "I confess, I am no KonMari follower. My kitchen is stuffed with specialty appliances ranging from a Benedict egg maker to a miniature Bundt cake baker. But there always comes a time ― usually after the turn of the year, when my husband is cleaning out but I’m eyeing the after-holiday sales ― when my husband looks at me and intones, “No more.”\nThis January, with three different kinds of turkey fryers from the holidays still lingering out on the patio, I replied, “Not even a plant-based milk maker?”\nAnd I could swear, as an avowed oat milk drinker, he hesitated.\nWhat is plant-based milk?\nMost of us are familiar by now with soy, almond or oat milk. But plant-based (i.e., nondairy or vegan) milks really can be manufactured with any nuts, seeds, legumes, grains or even fibrous plant matter. From pea to hemp, these materials are first soaked, then pureed, strained and sometimes boiled.\nThe resulting milk is often sweetened with anything from agave to dates and flavored with spices such as nutmeg and cinnamon. If it’s going on the market, it’s also occasionally stabilized (with ingredients like carrageenan) or preserved (with other multisyllabic ingredients). Commercial nondairy milks are sometimes organic, and sometimes not.\nSo, should you make it or buy it?\nThe advantages to making your own vegan milks are manifold. For consumers like She L. Robinson, a public relations and branding strategist who is diabetic, it was initially about controlling her sugars and carbs. But the Georgia-based marketing professional quickly learned that her preferred healthy choices, walnut and pecan, were not widely produced. This led her to start rendering a variety of flavors, including hemp.\n“Hemp is what I have used to replace cow’s milk in formula for my grandchildren who had an extremely hard time processing traditional formula, when mom wasn’t consistent in milk production to keep up with baby’s needs,” she said. “I mean, have you had the chance to read the ingredients in the commercial baby formula? The list is outrageous.”\nHowever, she does concede that she’ll purchase the more popular choices, including coconut and oat milk, both out of convenience and because the products are good. “Buying them is a lot easier than making them. I tend to go for Silk when I buy coconut milk and Elmhurst when I buy oat milk. These two are amazing in making sauces, creams or drinks that you want to have a heavier, more creamy texture.”\nDarline Dorcely, chef and general manager of Chef Liline, a premium catering service based in Stamford, Connecticut, decries canned coconut milk. “I prefer to make my own,” she said. “It tastes so much better. It’s fresh from the coconut and there are no preservatives.”\n“Homemade or store-bought, a good quality nut milk will supply vitamins, minerals, phytonutrients and antioxidants,” said Serena Poon, certified nutritionist and celebrity chef to clients such as Kerry Washington. “Some of my personal favorite plant-based milks include almond milk, cashew milk, macadamia milk and pumpkin seed milk (a great source of zinc).”\nStill, you’re not likely to find macadamia or pumpkin milk in the local market. These are just some of the reasons you might want to, as she says, “experiment in the kitchen and deepen connections to your food.”\n“That being said, I don’t want to discourage anyone from buying packaged nut milk in the store if that is the better option for their lifestyle,” Poon said. “It does become important to really check the labels on these milks. Opt for organic nut milk with few ingredients, ideally just two: nuts and water. Packaged plant-based milks tend to contain fillers and added sugar that can detract from their nutritional value.”\nDo you really need a special appliance to make plant-based milk?\nThe short answer is no ... and yes. It depends on your lifestyle, comfort level and the amount of time you want to commit to working with the ingredients and cleaning them up.\nIt’s not a difficult learning curve, but it can be time-consuming and messy. Some appliances will take care of everything for you ― even dispose of the pulp ― and all you have to do is put the right amount of ingredients in the machine, according to the accompanying recipe manuals. They don’t even ask that you soak the materials first (soaking makes the milk creamy) because the mechanisms and technology inside the appliance will take care of that aspect. These appliances often resemble a cross between a food processor and a coffee maker.\nBut other tools are really just mills or even carafes, which means that you’re responsible for soaking raw nuts, seeds or legumes first. Depending on the ingredients, that can take anywhere from six hours to overnight, and even up to 48 hours. Then you need to blend, strain and, in some cases, boil (which you must do with soy to get rid of certain chemical compounds). It’s ... a lot.\nRobinson, who makes her milks daily, uses her Instant Pot Ace Nova Cooking Blender, which has a milk-making speed option, and a cheese cloth. But you can really use any blender.\nIf you do want a plant-based milk maker, which one should you get?\nIf you don’t already have a blender or you need more guidance, there are a good number of home appliances on the market that are created specifically for making plant-based milks. They range from the simplest and most inexpensive products, like the Chef’n Nut Milk Maker ($25) ― a basic carafe that requires you to soak and strain ― to the hard-to-swallow Almond Cow ($1,195), which creates 2 gallons in minutes without any prep at all.\nSome are very specific. For those who are single or the only vegan in the house, the Nutr Machine ($169) is a single-server. Tayama ($67.51) is only for soy milk, but also can cook other soy products. The VeganMilker by ChufaMix ($59.90) is compact and inexpensive, but requires that you already have an appliance to initially mill the materials.\nFor kitchen appliance fans, the most interesting ones lie in between, in the moderately priced options. The Soyabella Automatic Nut & Seed Milk Maker ($109.95) from Lifeboost (which is also marketed under the name Tribest) converts into a coffee or spice grinder, and also cooks soup. The ChefWave Milkmade ($209.95) is as easy to use as a coffee machine. It has preset programs for six different kinds of milks, along with a delayed start and auto-cleaning.\nIn the end, as long as we read labels, there’s no right or wrong way to look at it. We get to decide how to invest our time and money: Supporting the producers making literal advances in the field or experimenting in the kitchen with our own appliances. As long as we have cabinet and counter space, that is.\nHuffPost may receive a share from purchases made via links on this page. Every item is independently selected by the HuffPost Shopping team. Prices and availability are subject to change.",
    "https://www.huffpost.com/entry/transparency-trumps-sugar-the-new-nutrition-label_b_573d1ba2e4b0084474946647": "Could it be we’re entering a sugar awareness Zeitgeist? That is, are we awakening to the abundance of sugar in the American diet and the toll it can take on health?\nWith today’s announcement by the FDA and First Lady Michelle Obama that ‘added sugars’ will now be listed on the nutrition facts label – the black-and-white grid found on nearly every packaged food and beverage sold in the U.S. – I’m hopeful.\nThe stakes are high: sugar consumption is helping drive growing rates of obesity and type 2 diabetes. It is also linked to cardiovascular disease, certain cancers, and cavities.\nAmericans have not been able to assess the added sugars that are in many of their foods. The 2015 Dietary Guidelines for Americans (DGAs) included a critical building block for the new nutrition facts label when, for the first time, they recommended that no more than 10 percent of a person’s daily calories come from sugar. This new daily value for sugar will also be listed on the nutrition facts label, giving consumers guideposts for where their sugar consumption should be.\nThe 10 percent upper limit on sugar is critical information. It’s also sobering: a person can hit the 10% limit by drinking a 12 oz. can of soda, which contains nearly 10 teaspoons of sugar. Harvard’s Nutrition Source has a list of drinks by brand and amount of added sugars – in teaspoons and grams – per 12 oz. serving. They also categorize the drinks by red (“drink sparingly and infrequently”), yellow (“a better choice but don’t overdo it”) and green (“best choice”). From sodas to smoothies, flavored milks and sports drinks, the sugar content is eye-popping.\nA recent study showed that soft drinks and fruit juices are the top sources of added sugars in the U.S. diet. Cakes, cookies and pies follow. The study also found that nearly all – about 90 percent – of the added sugars Americans consume come from ‘ultra-processed foods,’ which includes sugar drinks, but also pizza, cereals, breads and other foods made with multiple additives along with salt, sugar and oils. The same study also suggested that Americans are getting more than half their daily calories from such ‘ultra-processed foods.\nMomentum for the sugar awareness Zeitgeist can also be seen in city legislatures, which we’ve been watching intently at the Sumner M. Redstone Global Center for Prevention and Wellness. In 2014, voters in Berkeley, CA approved a sugar drink tax – the first city in the country to successfully do so. Oakland, CA put a similar tax on the ballot for November. Other municipalities are trying to do the same. Precedent suggests such taxes yield not only revenue to fund health, education and other needs, but potential positive outcomes for public health. Mexico began taxing sugar drinks in 2014 and sales dropped by 12 percent while water sales increased by four percent. Skyrocketing obesity and diabetes rates in Mexico drove the decision to tax sugar drinks.\nInformation is power. Highlighting ‘added sugars’ – not just total sugar content – on the nutrition facts label will tell a mom or dad making choices at the grocery store exactly how much extra sweetener has been put into a food or drink by the manufacturer. I hope that this new information on the label will prompt parents and other consumers to begin purchasing healthier products with less sugar, which in turn will initiate reformulation of products to contain less sugar. This label change represents an example of sound public health policy with the potential to move Americans toward better health.\nThere is a reason policymakers and consumers are paying heed; sugar is really not so sweet after all.\nCould it be we’re entering a sugar awareness Zeitgeist? That is, are we awakening to the abundance of sugar in the American diet and the toll it can take on health?",
    "https://www.huffpost.com/entry/processed-foods-in-america_n_56d60859e4b03260bf78743d": "Who doesn't love to eat? Food is just a really good thing.\nBut what we consider \"food\" has drastically changed over the years, helped along by a commercial food industry that creates processed, highly palatable snacks and treats that are actually designed to keep you eating.\nThis new age of convenience food is the subject of episode 7 of Next Level Living, a 10-part HuffPost Originals video series on the science behind our everyday habits. In this episode, we learn that some foods actually trick your brain into thinking you've consumed fewer calories.\n\"Essentially, the processing of food isn't just to make it safe or shelf stable. Processing of food is to maximize profit by maximizing the eating we do before we feel full,\" Dr. David Katz, director of the Yale-Griffin Prevention Research Center, says in the video.\nIn addition to packaged foods, restaurant meals have a lot of calories, and consumers aren't exactly helping themselves: In 2015, for the first time in history, Americans spent more money on dining out than they did on groceries. Research shows that meals we eat out are never as healthful as the ones we make at home -- whether we eat at a fast food joint or an upscale restaurant.\nFortunately, food doesn't have to control us, and we don't have to live under the reign of the cheese puff. Watch above, then start by spending some time in your kitchen. Check out one of the healthy slow cooker recipes below for inspiration.",
    "https://www.huffpost.com/entry/healthier-junk-food_l_5c7451e6e4b0bf1662023408": "We all have a complicated relationship with junk food. On one hand, it’s completely delicious, comforting and flat-out fun to eat. On the other, it leaves us feeling tired and crabby shortly after eating it, and leads to unwanted weight gain, among other health issues.\nBecause we wholeheartedly believe in enjoying life, we don’t want to discourage you from eating it altogether ― we just want to remind you that you have options.\n“Food cravings, especially for the unhealthy junk food stuff, are real and powerful,” nutritionist Karina Heinrich, founder of the The Karina Method, told HuffPost. “But instead of fighting your craving, just feed it with a healthier version. There are many brands that are redefining the junk food scene, making needed strides with real ingredient innovation, so what we traditionally think of as ‘junk food’ can now actually be considered healthy.”\nYep, you read that right ― there are “junk foods” out there that are actually pretty good for you. Here, three nutritionists explain which ones you should consider stocking up on for that 4 p.m. snack attack.\nPopcorn\nPopcorn isn’t just a buttery delicacy to eat at the movies ― it can also be a healthy snack. “Try any kind of herb spiced popcorn, like this one from Trader Joe’s,” nutritionist Maya Feller suggested. “It’s very crunchy and filled with fiber.”\nSome other great popcorn options include Skinny Pop, Buddha Bowl Himalayan Pink Organic Popcorn and Angie’s Boom Chicka Pop Lightly Sweet Kettle Corn.\nAnd, if you’re looking for packaged popcorns to avoid, you’d be wise to steer clear of traditional microwave popcorns, kettle corns that load in sugar (try to stay under 15 grams, if possible), and stay away from super-cheesy popcorns, which can pack on the fat, salt and vegetable oil.\nIce cream\nYes, you read that right. As long as you don’t overdo it, ice cream actually has some good nutrients in it, like calcium and protein. And, if you switch it up from the traditional Ben & Jerry’s pint, you may get even more of the good stuff, like probiotics and B-vitamins. “Adonia by Ciao Bella and Enlightened are great options, as well as frozen Greek yogurt bars by Yasso,” suggested Heinrich. “Remember, though, one and done!”\nGummy snacks\nSorry, but loading up on Sour Patch Kids isn’t great for you ― these sour gummy candies are packed with sugar, corn syrup, and artificial dyes. There are, however, some gummy snacks out there that aren’t too bad for you. “Some of my family favorite brands are Black Forest Organic, Newman’s Own Organics and Surf Sweets,” Heinrich said. These treats are just as delicious, but they’re made with organic ingredients and are GMO-free.\nDark chocolate\nYes, you can have your chocolate and eat it too ― especially if it’s not packed with sugar! “On top of usually being lower sugar, dark chocolate actually has a decent amount of fiber and protein, and it’s so intense that it’s hard to overeat,” nutritionist Tamar Samuels said. To avoid high-sugar chocolate, look for bars that are 70 percent cacao or higher.\nPotato chips that pack a healthier punch\nNot all chips are created equal, according to Heinrich. If you’ve got a hankering for potato chips, worry not ― they can actually be pretty good for you. “You can certainly get your chip fix without ingesting all of the harmful diet disasters that come along with it,” she noted. “Make sure to always choose chip brands that do not contain MSG, which is a common additive in chips and is linked with headaches, allergic reactions, and obesity. Kettle Brand chips are a great clean ingredient option.”\nDang coconut chips\nWhile coconut chips may not be the first thing that pop into your mind when you think of a traditional junk food, hear us out: Dang brand coconut chips are a great, healthy way to satisfy that sweet-salty craving. “They have some fat and fiber, which help you to eat them in moderation,” Samuels said. “They also make some great salty-sweet options, if you like that combo.”\nTortilla chips (or something like them)\nThese days, you have a ridiculous amount of options in the tortilla chip aisle, and many of them are packed with nutritious ingredients. “Lots of chip brands are getting on the healthy bandwagon and coming out with chips that are made from high-fiber ingredients, often high-protein beans and other good-for-you whole grains,” Heinrich said. “Some are even made from kale, seaweed and other greens, versus just your traditional potato. Beanitos bean chips taste like tortilla chips minus the junk food ingredients and are perfect for dipping into delicious guacamole. Siete Foods Grain Free Tortilla Chips is another great option that even has a nacho flavor. You may possibly never eat another greasy chip again.”\nRamen\nAh, ramen ― is there anything more comforting? While the traditional packaged variety packs the MSG and high sodium, there are some healthier options out there. “Not too many brands replace this college-age favorite, but I do like Lotus Foods,” Heinrich said. “Need to prepare the original style as a healthy meal? Add frozen veggies, eggs, skip the seasoning packet and instead sprinkle your own sea salt, miso or low-sodium soy sauce.\nOne more thing to keep in mind? Giving in to your flat-out “bad” junk food cravings once in a while isn’t always the worst idea. “There’s something to be said about mindful eating,” Samuels said. “If you do have a craving, sometimes it is best to honor it. Don’t eat the whole bag. Instead, serve yourself and put a portion of the snack you want on a plate or in a bowl so you can be more intentional about portion size and more mindful about how much you need to feel satisfied.”\nAmen to that.",
    "https://www.huffpost.com/entry/eat-healthy-working-from-home_l_5e724b03c5b63c3b6488ee71": "Working from home during the coronavirus pandemic means distractions like water coolers and small talk are in the rearview mirror, but in the era of social distancing, one major work-from-home distraction remains: the refrigerator.\nHave a deadline? Sure, but first, you should probably check on last night’s leftovers — just for a quick little bite. Starting a project? You’ll need brain food, obviously. Of course, you’ve already had breakfast (and lunch — and snacks).\nFood can be a remote worker’s worst enemy, and sometimes the efficiency of working from home leads to people straight-up forgetting to eat at all.\nSince overeating and undereating aren’t sustainable habits, we talked with veteran remote workers about their tried-and-true strategies for eating healthily while working from home.\nStick To A Schedule\nSuccessful freelancers swear by routines — washing your face, putting on real clothes and setting smartphone boundaries — and those recommendations extend to eating. Nutritional therapist and longtime work-from-homer Wilma MacDonald told HuffPost that snacking here and there is the biggest mistake she sees new remote workers make. She recommends setting up your day like any regular working day, with a lunch break, a few smaller breaks and a focus on the most important meal: breakfast.\n“Eat breakfast away from your desk before you start work,” MacDonald said. “Think of something like warm oats with nut butter and fruit, or avocado and eggs on toast. Protein-rich breakfasts keep you full and keep your sugar levels balanced so you’re not looking for a snack in an hour.”\nLucille Whiting, founder of jewelry brand Sophia Alexander, has juggled working from home with five kids for the past 14 years. She recognizes schedules are a bit crazy, but finds following the needs of her children works best. “I try to eat when the children are eating, so breakfast with my toddler, lunch together before his afternoon nap and dinner all together in the evening,” she told HuffPost. “I buy or make cakes and biscuits for the children after mealtimes, but often make just enough for them to help me avoid temptation.”\nWhen You Can, Eat Away From Your Desk\nIt’s easy to think eating breakfast or lunch at your desk could help you end the day early, but work-from-home veterans know it rarely works this way. There’s always something more to do, and your focus dwindles without dedicated breaks. That’s why MacDonald suggests eating all meals away from not just your desk, but your tech.\nWhiting agrees — she institutes a no-tech at dinnertime rule — but she will work through lunch when her kids are occupied. For her, parenting while working from home is all about being flexible. “Having a total break from work helps clear my mind, but if I’m on my own when the children are sleeping or out, I almost always eat lunch at my desk,” she said. “There’s always the temptation to keep working and get as much done as possible. Having the children around gives my day a healthy structure.”\nSet Caffeine Boundaries And Increase Hydration\nThose new to the work-from-home lifestyle are often astounded by how much coffee they drink. If you brew a pot, you don’t want to waste any, and you end up drinking way more than you ever would at work. Surprisingly, this isn’t the worst thing you could do for your health. The FDA says 400 milligrams (the equivalent of four to five cups of coffee) is typically safe, depending on the person. The important thing is timing.\n“If you drink caffeine, have your coffee between 9 and 11 a.m.,” MacDonald said. “This is the best time to have caffeine so that it doesn’t interrupt your natural sleep and wake cycle by triggering a release of adrenaline and setting you up for a crash in an hour.”\nCoffee gets people out of bed in the morning, but the same can’t be said for water. A 2016 report by the CDC showed most American adults between 20 to 60 years old drink barely enough water, while adults over age 60 drink less than recommended. In addition to hydration benefits, MacDonald says water can help people feel full, because thirst is often mistaken for hunger.\nWhiting’s go-to hydration trick is to make water easily accessible. “I keep a pint glass of water on the worktop at all times,” she said. “The glass sitting there acts as a reminder, and it helps me avoid unnecessary snacking when I’m not really hungry.”\nKeep Healthy Snacks Ready\nYou don’t want to overdo it with snacking, but you also don’t want to starve yourself. That’s why MacDonald recommends taking personal inventory prior to hitting the refrigerator. “Before you head to the snacks, check in with yourself,” she said. “Are you eating because you’re hungry or because you’re bored, stressed, annoyed or lonely? We eat our emotions from time to time. Feel those feelings — especially now — then have a drink of water.”\nWhen it is hunger, not procrastination or emotions, MacDonald leans on go-to snacks like chopped carrots, pepper, celery with hummus, or stuffed dates with nut butter. “Smoothies are also good to have because they’re hydrating and you’re getting a boost of goodness,” she said. “Start with a base of a green vegetable, add fruit, some protein like chia seeds or protein powder, and some fat like nut butter.”\nWhiting says fruit is her favorite snack, and it’s something her children can enjoy, too. “I have loads of apples and pears around, which is easy with small children,” she said. “I buy a lot so they have healthy things to snack on, and I buy extra for whenever I get hungry between meals.”\nBut sometimes, snacking isn’t the answer. Judy Bartkowiak, author and neuro-linguistic programming (NLP) trainer and 30-year work-from-home veteran, sticks to a disciplined, no-snack approach. “I eat a big healthy breakfast, and stick to eating three times a day,” she told HuffPost. “That way, I don’t even think of going to the fridge during the work day except to get something at lunchtime.”\nKeep A Food Journal\nNutrition is highly personal, and what works for one person may not work for another. That’s why MacDonald recommends journaling during your first few weeks working at home. “Keep track of how you’re feeling over the course of the day energy-wise, and keep a food diary to see any patterns emerging,” she said.\nAt the same time, self-isolation due to a pandemic is different than casually working from home. It’s all about adapting to these emotional weeks and months, and taking life in stride.\n“You might find yourself eating everything at first, then you realize how sluggish it makes you feel,” she said. “It takes a while to find your groove, and these are weird times. As people adapt to working from home, they need to give themselves grace.”",
    "https://www.huffpost.com/entry/handwritten-menu-study_l_5c7568e2e4b02efbde1f2f62": "The menu at your favorite healthy restaurant might be trying to tell you something ― and it’s not just the daily specials.\nA 2019 Ohio State University and Pennsylvania State University study that will be published in the Journal of Business Research found that diners eating in a health-focused restaurant are more likely to associate that restaurant with healthiness if the menu features a font that is handwritten, or appears to be.\nAccording to the study, these menus also make you more likely to post photos of your food on social media.\nStephanie Liu, lead author of the study, explained to HuffPost that as more people are focused on “eating clean,” she and her colleagues were interested in offering restaurants, well, a hand.\n“Many restaurants are branding or rebranding themselves as healthy, but they might not know how to do it effectively,” Liu told HuffPost. “We wanted to help these restaurants by offering a creative marketing strategy that does not necessarily increase cost — you just need to print your menu in a different font that appears handwritten.”\nThe study, conducted with 185 people ages 20-84, set out to determine if a “handwritten” menu can better convey love or evoke more of a human touch. Participants were split up into four groups and asked to imagine they were eating in a made-up restaurant called Rilo’s Kitchen.\nAccording to the study, two groups were presented with the following statement explaining that the eatery was health-conscious: “Its entire menu is based on locally-grown, non-GMO, antibiotic-free ingredients and it is committed to sustainability.”\nOf those participants, one group was given a menu with a handwritten font, while the other group received menus that did not appear handwritten. The researchers found that participants who received handwritten menus expressed more favorable attitudes toward the menu, perceived the food to be healthier and engaged with it on social media at a higher rate.\nHowever, these differences were only apparent when the restaurant was described as “healthy.” The different menu fonts didn’t have any perceivable effect on the two groups that were not informed of the restaurant’s health focus.\nAccording to Liu, that’s a result of our attitudes toward fast food or regular restaurants in general. “At regular restaurants or with fast food, the typeface doesn’t matter as much because you’re not expecting that human touch or extra effort,” Liu told MarketWatch.\nFor James Rigato, head chef at Mabel Gray in Hazel Park, Michigan, it’s not necessarily health that drives its handwritten menu, but certainly an emphasis on connecting with the customer.\n“We don’t pursue the optics of healthy but definitely fresh and handmade,” he told HuffPost. “A lot of American food in general is unhealthy so I think handmade often correlates to healthy, but the handmade part of it is more important for us to convey.”\nRigato’s girlfriend Sam Stanisz, a sous chef at the restaurant, handwrites the menu daily, and Rigato says it’s become engrained into the restaurant’s overall aesthetic and vibe. “It’s an incredibly human touch, like when someone sends a handwritten thank you note,” he said.\nBut not everyone is picking up what the study is writing down.\nBasing notions about a restaurant on the menu alone is “oversimplifying” what goes into branding a restaurant as health-focused, Douglas Riccardi, owner of New York City-based restaurant branding agency Memo Productions and Type Director’s Club board member, told HuffPost. He noted that in general, restaurants are now doing a lot more to send out a healthy message.\n“The entire messaging in restaurants has become much more transparent about how ingredients are sourced, how the food is prepared, even calorie counts,” he said. “People are just more open now and there’s less of a desire to hide things under the rug.”\nStill, it’s an interesting idea to keep in mind the next time you order off a menu ― handwritten or not.",
    "https://www.huffpost.com/entry/nutritionists-rank-thanksgiving-side-dishes_l_5fac0ff8c5b6ed84597d525c": "Everything Thanksgiving: Get all our Thanksgiving recipes, how-to’s and more!\nWhile turkey has its fans, many people see the side dishes as the real stars of the Thanksgiving meal. But when it comes to nutrition, not all sides are created equal.\nPlenty of Thanksgiving favorites are drowning in butter, sugar and other unhealthy ingredients ― even those that seem “healthy” due to their vegetable content. That’s no reason to avoid partaking in the festivities or feel shame for eating an indulgent meal, however.\n“It’s great if you can lighten up some of those decadent Thanksgiving dishes and cut out some of the excessive sodium, sugar and fat without sacrificing flavor,” said Stefani Sassos, a registered dietitian for the Good Housekeeping Institute. “But my cardinal rule with Thanksgiving and holidays in general is to eat what you want but listen to your body and respect your fullness.”\n“Some of these foods only come around once a year and are just too good to pass up!” she added. “As a registered dietitian, of course I try to choose healthy items, but I know that if you restrict too much, it may ultimately backfire and you’ll wind up eating more than you would have in the first place.”\n“Pick and choose your absolute favorite items, portion out a serving, and sensibly indulge,” she added. “You can still enjoy your favorite foods in moderation and avoid that Thanksgiving food coma.”\nStill, for those who would like to learn about the dietary properties of different Thanksgiving sides, HuffPost asked nutritionists to rank these dishes from healthiest to least healthy and to share their tips for upping the nutritional value of each option.\nIt’s important to note that nutritional rankings can be subjective and based on an individual’s current health goals, and that preparation plays a major role in how healthy a side dish can be. The below list reflects an average of each nutritionist’s individual rankings.\n1. Brussels Sprouts (Healthiest)\nBrussels sprouts may not be a showstopping Thanksgiving side dish, but these cruciferous vegetables can bring some real nutrient value to the table. They’re a great source of vitamins A, C and K, and researchers tout their anti-inflammatory and anti-cancer properties.\nPreparation style can limit their health impact, however.\n“Brussels sprouts themselves are rich in fiber and nutrients, but if they’re sautéed in duck fat and loaded with salt (that’s how they are commonly prepared in many restaurants), it kind of defeats the purpose,” Sassos said. “Air frying Brussels sprouts is my favorite way to prepare them and substantially cuts down on the calories and fat.”\nConsider roasting them with a small amount of olive oil and balsamic vinegar, or preparing a shaved Brussels sprouts salad. Cooking Brussels sprouts with bacon can add extra fat and increase your intake of animal fat and red meat, but some experts believe a little bit of bacon isn’t the worst option, as it may help your body absorb fat-soluble vitamins and keep you satiated.\n2. Butternut Squash\nButternut squash doesn’t just make for a lovely fall display. It also packs a serious nutritional punch.\n“Butternut squash is a great source of vitamin A, B, C and E, as well as calcium, magnesium and zinc,” said Brianna Bernard, a nutrition coach and Isopure spokesperson. “This is great roasted in a little olive oil and also makes a delicious soup!”\nFilled with immune-boosting nutrients, butternut squash is tasty without unhealthy add-ons, so it’s not necessary to use a super buttery or sugary recipe. It’s possible to make a good butternut squash soup with little to no milk and cream as well. Still, caramelizing it with just a little bit of butter can add some extra sweetness.\n3. Green Bean Casserole\n“Green beans are loaded with vitamins A, C and K, as well as fiber, but this dish can be high in sodium due to the cream of mushroom soup, soy sauce and fried onions,” said Bernard. She advised replacing these ingredients with a low-sodium soup and coconut aminos.\nConsider substituting caramelized onions or whole-grain bread crumbs for the crispy fried onions and skipping the can of cream of mushroom soup. Instead, add mushrooms and some milk or Greek yogurt to your dish for the same creamy richness.\n“Mix in some sautéed mushrooms, onion, garlic, and celery,” suggested Kimberley Rose-Francis, a registered dietitian nutritionist. “Then add a pinch of flour, salt and pepper with a splash of low-sodium vegetable broth for a cream-of-mushroom soup flavor.”\nYou can also make a simple roasted green beans recipe or green beans almondine instead of the casserole.\n4. Sweet Potato Casserole\nSweet potatoes are a great source of fiber, beta-carotene, vitamins A, B and C, and more. But sweet potato casseroles tend to be loaded with butter and sugar.\n“It’s really more of a dessert than a side dish once you count up the sugar content,” Sassos said, pointing to the marshmallows and brown sugar in many classic recipes. “Roasting sweet potatoes and adding a touch of maple syrup would be a far healthier option that tastes great, too.”\nAnother healthier alternative would be preparing sweet potatoes with cinnamon, which “has been tied to reducing inflammation, increasing insulin sensitivity and lower blood sugar levels,” said Tracy Lockwood Beckerman, registered dietitian and author of “The Better Period Food Solution.”\nYou can also incorporate nuts, raisins, nutmeg and cardamom, or consider coconut swaps like coconut sugar or coconut oil.\n5. Mashed Potatoes\n“Mashed potatoes may have a bad rap, but the spud has plenty to brag about: potassium, fiber, even a bit of vitamin C,” said registered dietitian nutritionist Jill Weisenberger. “You can health-ify them by using less fat such as butter or cream cheese.”\nInstead, she suggested a combination of butter, olive oil and chicken or vegetable broth. Other alternatives to heavy cream and butter include almond milk and yogurt.\n“One excellent way to up the fiber and nutrient content of mashed potatoes is to leave on the skin of the potatoes, where many of the vitamins and much of the fiber is found,” said nutritionist Alyssa Northrop. “Many people actually prefer the taste of skin-on mashed potatoes once they’ve tried it. Try roasting a head of garlic and smashing it along with your potatoes for even more nutritional benefits.”\nAnd of course, you could always go the cauliflower route ― either as a replacement or a supplement.\n“Mashed cauliflower can be mixed into your mashed potatoes,” suggested Stephanie Snell, a registered dietitian at UCHealth. “If you are looking for one less starch on your table, you could prepare mashed cauliflower in place of mashed potatoes.”\n6. Dinner Rolls\n“Unless they are made with whole grains, I would steer clear of dinner rolls, which load you up on processed carbs without providing much fiber,” Northrop said.\nIndeed, classic white bread dinner rolls don’t offer much nutritional value, though the whole grain versions are healthier.\n“Whole grains contain B vitamins which are needed for energy production, as well as fat and protein metabolism,” Rose-Francis said. “One should be careful of how much butter is added to their bread. Whether your rolls are made of whole grains or refined grains, extra butter can make them unhealthy.”\n7. Cranberry Sauce\n“Cranberries are an excellent source of antioxidants like polyphenols that help repair cell damage and have been shown to help reduce heart disease risk factors such as high cholesterol and high blood pressure,” Beckerman said.\nResearch has also shown that cranberries are rich in vitamin C, promote urinary tract health and reduce inflammation.\n“Cranberries are a superfruit, but all the sugar in the canned stuff and traditional recipes undoes their greatness,” said registered dietitian nutritionist Dawn Jackson Blatner. “Make cranberry sauce with 50% less sugar, and it will still taste great. Or use just a little honey and some fresh-squeezed oranges and you can ditch white sugar altogether.”\nA little maple syrup and orange zest can also serve as good sugar replacements. Northrop noted that homemade cranberry sauce made with the actual cranberries with their skins also contains more fiber and other nutrients.\n8. Stuffing\nWhile stuffing is a fan favorite, it’s the source of many hidden Thanksgiving calories due to its high sodium, carbohydrate and fat content. The dish is often prepared with refined breads, lots of butter and high-fat proteins like sausage and bacon.\n“Traditionally, we choose our more processed grains for the bread in stuffing,” Snell said. “Choosing whole grain bread can reduce your intake of processed grains and increase your intake of fiber.”\nSassos suggested making stuffing with cauliflower rice or whole wheat bread ― or portioning it out into muffin tins and baking “stuffins.” Bernard recommended low-sodium chicken broth. But the biggest tip from multiple nutritionists: Load up on veggies.\n“Spinach or mushrooms could be an ingredient in your stuffing,” Snell said. “When possible, we want to increase the use of vegetables throughout our sides.”\nCelery, onion carrots, kale and sweet potatoes can also increase the fiber and nutrients and decrease the calories in a serving of stuffing.\n9. Macaroni And Cheese\nTraditional macaroni and cheese doesn’t offer much in terms of nutrition, between the refined grains, butter and cheese.\n“You can get decent amounts of protein from the cheese, but the fat and carbohydrate content is very high, which means the dish ends up being very calorie-dense,” said Jonathan Valdez, owner of Genki Nutrition and spokesperson for the New York State Academy of Nutrition and Dietetics.\nHe suggested adding vegetables to the dish, using a fat-free or reduced-fat cheese and choosing a whole wheat, lentil or chickpea pasta to increase the fiber and protein content while reducing calories. Keeping portions smaller can also be helpful.\n10. Gravy\n“Turkey gravy is often made from grease drippings and the neck and giblets from the Thanksgiving turkey,” Bernard explained. “These fatty ingredients make it taste delicious, but are not very healthy ― especially when coupled with more high-sodium chicken broth and butter.”\nThe high saturated fat and sodium content mean it’s best to be mindful of portion sizes when ladling out the gravy. There are also ways to make it a bit healthier.\n“Instead, create a roux using a lighter fat, like a plant-based butter, and flour,” Rose-Francis advised. “Try using less meat drippings and adding vegetable stock to enhance the flavors even more. Stir and simmer, simmer and stir ... and voila! Your savory ‘silky sauce’ is served.”"
}
